{"viewData":{"url_key":"samsung_ua_32j4303_j4303_series_32_hd","name":"Samsung J4303 32\" HD Multi-System Smart LED TV","sku":"1192114","price":"349.95","categories":{"0":{"categoryName":"Televisions","urlKey":"televisions"},"1":{"categoryName":"Samsung","urlKey":"samsung"}},"short_description":"Buy Samsung J4303 32&quot; HD Multi-System Smart LED TV featuring Multi-System Compatible, HD 1366 x 768 LED Panel Clear Motion Rate 100 Technology. Review Samsung J4303","long_description":"With the Samsung J4303 32\" HD Multi-System Smart LED TV you can enjoy Internet streaming content and detailed 720p images across NTSC, PAL, and SECAM TV systems. This model has a large 32\" display and features a 1366 x 768 resolution for viewing high-definition content. On-board Clear Motion Rate 100 technology uses the TVs native 50 Hz refresh rate to reduce distortion and image blur on fast moving images like televised sporting events. This LED TV incorporates Wide Color Enhancer Plus technology for vivid and life-like color reproduction. As a Smart TV, this model has built-in Wi-Fi and Ethernet for accessing Samsung's on-board apps and streaming services. With component video, USB, and two HDMI ports, you have multiple options for connecting high-resolution audio and video sources. On-board MHL connectivity allows you to mirror and charge compatible smart devices. This model has stereo speakers, which deliver 10W of total power. This multi-system TV comes with a European plug and includes a plug adapter for US use.Please Note: This is a multi-system television and it does not include a digital/ATSC tuner to receive over-the-air broadcast channels in the US. In order to receive US broadcast channels, a separate converter or cable/satellite box is required. Please refer to the owner's manual for setup and operational assistance.","images":{"0":"1125f48aff4117e7a8e29d585841cda7-0.jpg","1":"1125f48aff4117e7a8e29d585841cda7-1.jpg","2":"1125f48aff4117e7a8e29d585841cda7-2.jpg","3":"1125f48aff4117e7a8e29d585841cda7-3.jpg","4":"1125f48aff4117e7a8e29d585841cda7-4.jpg"}},"configuration":{},"availability":{"1192114":{"aditional_price":0,"availabile":588}}}
