{"viewData":{"url_key":"sony_xbr75x850f_x850f_series_75_class_hdr_uhd","name":"Sony X850F 75\" Class HDR UHD Smart LED TV","sku":"1391682","price":"1,798.00","categories":{"0":{"categoryName":"Televisions","urlKey":"televisions"},"1":{"categoryName":"Sony","urlKey":"sony"}},"short_description":"Buy Sony X850F 75&quot; Class HDR UHD Smart LED TV featuring UHD 3840 x 2160 LED Panel, HDR10- &amp; HLG-Compatible Future Update for Dolby Vision Support. Review Sony X850F","long_description":"View content at four times the resolution of 1080p with the Sony X850F 75\" Class HDR UHD Smart LED TV. It has a 74.5\" LED edge-lit display, and incorporates Sony's Motionflow XR technology to digitally enhance fast-moving images to reduce blur. HDR10 and HLG compatibility provide a wide color gamut for compatible content, and Dolby Vision HDR support is scheduled to be made available via a future firmware update. The X850F series has built-in Wi-Fi and Ethernet connectivity to allow access to the Google Play store, your favorite apps, and Internet-based content via its Android operating system, plus content sharing and screen mirroring with your other compatible smart devices such as your smartphone or tablet. The Vewd web browser is also available for download through the Google Play store. With four HDMI inputs, there are multiple options for connecting high-definition video sources. A component video input is also available for connecting legacy equipment, while three USB ports are onboard for connecting compatible multimedia peripherals like flash drives. The component video input can alternatively serve as a composite video port for standard definition gear.","images":{"0":"46eb78b25b92ecc0cb5396d2fa8f211d-0.jpg","1":"46eb78b25b92ecc0cb5396d2fa8f211d-1.jpg","2":"46eb78b25b92ecc0cb5396d2fa8f211d-2.jpg","3":"46eb78b25b92ecc0cb5396d2fa8f211d-3.jpg","4":"46eb78b25b92ecc0cb5396d2fa8f211d-4.jpg","5":"46eb78b25b92ecc0cb5396d2fa8f211d-5.jpg","6":"46eb78b25b92ecc0cb5396d2fa8f211d-6.jpg","7":"46eb78b25b92ecc0cb5396d2fa8f211d-7.jpg","8":"46eb78b25b92ecc0cb5396d2fa8f211d-8.jpg"}},"configuration":{},"availability":{"1391682":{"aditional_price":0,"availabile":254}}}
