{"viewData":{"url_key":"sony_kd55x750f_x750f_series_55_class_hdr","name":"Sony X750F 55\" Class HDR UHD Smart LED TV","sku":"1391687","price":"748.00","categories":{"0":{"categoryName":"Televisions","urlKey":"televisions"},"1":{"categoryName":"Sony","urlKey":"sony"}},"short_description":"Buy Sony X750F 55&quot; Class HDR UHD Smart LED TV featuring UHD 3840 x 2160 LED Panel, HDR10- &amp; HLG-Compatible 60 Hz Refresh + Motionflow XR 240. Review Sony X750F","long_description":"View content at four times the resolution of 1080p with the Sony X750F 55\" Class HDR UHD Smart LED TV. It has a 54.6\" LED-backlit display, and incorporates Sony's Motionflow XR 240 technology to digitally enhance fast-moving images to reduce blur. HDR10 and HLG HDR compatibility provide a wide color gamut for compatible content. The X750F series has built-in Wi-Fi and Ethernet connectivity to allow access to the Google Play store, your favorite apps, and Internet-based content via its Android operating system, plus content sharing and screen mirroring with your other compatible smart devices such as your smartphone or tablet. The Vewd web browser is also available for download through the Google Play store. With four HDMI inputs, there are multiple options for connecting high-definition video sources. A component video input is also available for connecting legacy HD equipment; it's a hybrid port that allows you to connect a composite video source instead. Three USB ports are onboard for connecting compatible multimedia peripherals like flash drives.","images":{"0":"a7c9ba6f84f927a807374a8a07dbc25d-0.jpg","1":"a7c9ba6f84f927a807374a8a07dbc25d-1.jpg","2":"a7c9ba6f84f927a807374a8a07dbc25d-2.jpg","3":"a7c9ba6f84f927a807374a8a07dbc25d-3.jpg","4":"a7c9ba6f84f927a807374a8a07dbc25d-4.jpg","5":"a7c9ba6f84f927a807374a8a07dbc25d-5.jpg","6":"a7c9ba6f84f927a807374a8a07dbc25d-6.jpg","7":"a7c9ba6f84f927a807374a8a07dbc25d-7.jpg","8":"a7c9ba6f84f927a807374a8a07dbc25d-8.jpg","9":"a7c9ba6f84f927a807374a8a07dbc25d-9.jpg"}},"configuration":{},"availability":{"1391687":{"aditional_price":0,"availabile":308}}}
