{"viewData":{"url_key":"samsung_un43ls03nafxza_the_frame_ls03_series_43_class","name":"Samsung The Frame LS03 43\" Class HDR UHD Smart LED TV","sku":"1420663","price":"1,197.99","categories":{"0":{"categoryName":"Televisions","urlKey":"televisions"},"1":{"categoryName":"Samsung","urlKey":"samsung"}},"short_description":"Buy Samsung The Frame LS03 43&quot; Class HDR UHD Smart LED TV featuring UHD 3840 x 2160 LED Panel, HDR10, HDR10+, HLG Compatible Motion Rate of 120. Review Samsung LS03","long_description":"Enjoy your favorite professional and personal artwork, streaming services, TV shows, and more with the Samsung The Frame LS03 43\" Class HDR UHD Smart LED TV. It features an internal library of artwork, plus you can purchase new works online, and the included No-Gap Wall Mount will add to its portrait-like appearance. The Frame has a UHD 3840 x 2160 native resolution and supports the HDR10, HDR10+, and HLG HDR formats for brighter, more vibrant colors than non-HDR displays. Motion Rate 120 technology will digitally enhance fast-moving objects to reduce any blurring that may occur. The Frame includes the One Connect box, which will accept the inputs from all your devices, such as cable/satellite boxes and Blu-ray/DVD players, and connects to the TV with a single cable for a streamlined installation. The One Connect box has four HDMI inputs and three USB ports. Integrated Wi-Fi and Ethernet connectivity provide access to the Internet to download apps, and a full web browser is also onboard.","images":{"0":"39a0b5846ed08607c96dda42ec6b8995-0.jpg","1":"39a0b5846ed08607c96dda42ec6b8995-1.jpg","2":"39a0b5846ed08607c96dda42ec6b8995-2.jpg","3":"39a0b5846ed08607c96dda42ec6b8995-3.jpg","4":"39a0b5846ed08607c96dda42ec6b8995-4.jpg","5":"39a0b5846ed08607c96dda42ec6b8995-5.jpg","6":"39a0b5846ed08607c96dda42ec6b8995-6.jpg","7":"39a0b5846ed08607c96dda42ec6b8995-7.jpg","8":"39a0b5846ed08607c96dda42ec6b8995-8.jpg","9":"39a0b5846ed08607c96dda42ec6b8995-9.jpg","10":"39a0b5846ed08607c96dda42ec6b8995-10.jpg","11":"39a0b5846ed08607c96dda42ec6b8995-11.jpg"}},"configuration":{},"availability":{"1420663":{"aditional_price":0,"availabile":502}}}
