{"viewData":{"url_key":"hp_1bs31ut_aba_zbook_15_g4_mobile","name":"HP 15.6\" ZBook 15u G4 Mobile Workstation","sku":"1317539","price":"649.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ZBook 15u G4 Mobile Workstation featuring Designed for the Creative Professional, 2.5 GHz Intel Core i5-7200U Dual-Core 4GB DDR4 RAM | 500GB 7200 rpm HDD. Review HP 15u G4","long_description":"Thin at 0.78\" and weighing 4.18 lb, the 15.6\" ZBook 15u G4 Mobile Workstation from HP delivers workstation performance and long battery life within a compact mobile form factor. This system is powered by a 2.5 GHz Intel Core i5-7200U Dual-Core processor which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 3.1 GHz using Intel Turbo Boost 2.0 technology. The 4GB of 2133 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently-used files and programs. The 15.6\" SVA TN anti-glare display features a Full HD 1920 x 1080 screen resolution, LED-backlighting, a 16:9 aspect ratio, 300 cd/m2 brightness, a 400:1 typical contrast ratio, a refresh rate of 60 Hz, 142 ppi, and viewing angles of 45/45/25/35°. The dedicated AMD FirePro W4190M graphics card has 2GB of discrete GDDR5 RAM and delivers a sharp, clear picture. You'll also be able to output video to an external display at resolutions up to 3840 x 2160 using the system's DisplayPort 1.2 and VGA outputs. For long term storage of your files, this ZBook 15u G4 is equipped with a 500GB 7200 rpm SATA III 2.5\" / 7mm hard drive. If you want to add external storage, optical drives, memory card readers, and more, the ZBook 15u G4 offers one USB 3.0 Type-C port and two USB 3.0 Type-A ports, one of which doubles as a charging port. Gigabit Ethernet and 802.11ac dual-band Wi-Fi are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. So that content from memory cards may be accessed, a built-in SD/SDHC/SDXC card reader supports UHS-II flash media and lets users download content from their digital camera. Other integrated features include a 720p webcam, dual-array microphones, stereo speakers with Bang & Olufsen HD audio, a smart card reader, and a SIM module slot. The ZBook 15u G4 includes a 65W Slim Smart AC adapter that operates using 90-265 VAC at 47-63 Hz and an HP Long Life 3-cell / 51Wh lithium-ion polymer battery that can last for up to 10 hours before recharging is required. The installed operating system is Windows 10 Professional (64-bit). B&H Photo is an authorized HP reseller with professional in-house technicians available for upgrades & installations on these workstations and laptops. Built with power and speed in mind, the Z Series is designed to enhance audio and video post-production workflows and more. Each HP Z series workstation or laptop features a range of top-tier processors and large RAM loadouts. The workstations are built with graphics flexibility in mind as well so that the end consumer can configure the graphics options to their needs, and each unit includes a 3/3/3 warranty - 3 years limited warranty for parts, 3 years limited warranty for labor, and 3 years of repairs performed at customer site for those parts not eligible for Customer Self Repair (CSR). For 24/7 customer service, please call 1-866-625-1175.","images":{"0":"cf1dfd780bf46d383a5cef3a1b0428f5-0.jpg","1":"cf1dfd780bf46d383a5cef3a1b0428f5-1.jpg","2":"cf1dfd780bf46d383a5cef3a1b0428f5-2.jpg"}},"configuration":{},"availability":{"1317539":{"aditional_price":0,"availabile":356}}}
