{"viewData":{"url_key":"hp_1nl44ut_aba_zbook_17_g4_xeon","name":"HP 17.3\" ZBook 17 G4 Mobile Workstation","sku":"1335003","price":"2,499.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 17.3&quot; ZBook 17 G4 Mobile Workstation featuring Designed for the Creative Professional, 3.1 GHz Intel Xeon E3-1535M v6 Quad-Core 16GB ECC DDR4 RAM | 512GB SSD + 1TB HDD. Review HP 17 G4","long_description":"Made for mobile creative and design professionals with demanding projects, the 17.3\" ZBook 17 G4 Mobile Workstation from HP provides desktop workstation power, performance, and expandability in a device designed for the road. This system is powered by a 3.1 GHz Intel Xeon E3-1535M v6 Quad-Core processor which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 4.2 GHz using Intel Turbo Boost 2.0 technology. The 16GB of 2400 MHz ECC DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The 17.3\" UWVA IPS anti-glare display features a Full HD 1920 x 1080 screen resolution that is equipped with LED-backlighting, a 16:9 aspect ratio, 300 cd/m2 brightness, a 600:1 typical contrast ratio, a refresh rate of 60 Hz, 128 ppi, and viewing angles of 85/85/85/85°. The dedicated NVIDIA Quadro P4000 graphics card has 8GB of discrete GDDR5 RAM and delivers a sharp, clear picture. You'll also be able to output video to an external display at resolutions up to 5120 x 2880 using the system's HDMI 1.4, VGA, and dual Thunderbolt 3 ports, the last of which supports DisplayPort 1.2. For long-term storage of your files, this ZBook 17 G4 is equipped with a 512GB Z Turbo Drive G2 NVMe PCIe SSD that uses MLC-type NAND and has an M.2 2280 form factor, as well as a 1TB 7200 rpm SATA 2.5\" / 7mm hard drive, for a total storage capacity of 1.512TB. While the SSD may not have the larger storage capacity of the 1TB spinning hard drive, it contains no moving parts which helps it to be more resistant against bumps, drops, and other kinds of damage. SSDs also receive less wear and tear than traditional hard drives, as they don't have any read and write heads. Additionally, as this SSD connects via PCIe as compared to SATA, it is able to operate with even greater data transfer speeds. It provides sequential reads up to 3000 MB/s and sequential writes up to 1500 MB/s. If you want to add external storage, optical drives, memory card readers, and more, the ZBook 17 G4 offers two 40 Gb/s Thunderbolt 3 ports that also support 10 Gb/s USB 3.1 Type-C. There are also four 5 Gb/s USB 3.0 ports, with one of these ports doubling as a charging port. Gigabit Ethernet and 802.11ac dual-band Wi-Fi are built-in for wired and wireless networking and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. Content from memory cards may be accessed via a built-in SD/SDHC/SDXC card reader that supports UHS-II flash media. Other integrated features include a 720p webcam, dual-array microphones, stereo speakers with Bang & Olufsen HD audio, and a smart card reader. The ZBook 17 G4 includes a 200W Slim Smart AC adapter that operates using 100-240 VAC at 47-63 Hz and an HP Long Life 6-cell / 96Wh lithium-ion prismatic battery that lasts for up to 16.9 hours before recharging is required, and typically recharges in 3-5 hours. The installed operating system is Windows 10 Professional (64-bit) and also included is recovery media. B&H Photo is an authorized HP reseller with professional in-house technicians available for upgrades & installations on these workstations and laptops. Built with power and speed in mind, the Z Series is designed to enhance audio and video post-production workflows and more. Each HP Z series workstation or laptop features a range of top-tier processors and large RAM loadouts. The workstations are built with graphics flexibility in mind as well so that the end consumer can configure the graphics options to their needs, and each unit includes a 3/3/3 warranty - 3 years limited warranty for parts, 3 years limited warranty for labor, and 3 years of repairs performed at customer site for those parts not eligible for Customer Self Repair (CSR). For 24/7 customer service, please call 1-866-625-1175.","images":{"0":"26866b09fd6abf258d585715a093552b-0.jpg","1":"26866b09fd6abf258d585715a093552b-1.jpg","2":"26866b09fd6abf258d585715a093552b-2.jpg","3":"26866b09fd6abf258d585715a093552b-3.jpg","4":"26866b09fd6abf258d585715a093552b-4.jpg","5":"26866b09fd6abf258d585715a093552b-5.jpg","6":"26866b09fd6abf258d585715a093552b-6.jpg","7":"26866b09fd6abf258d585715a093552b-7.jpg","8":"26866b09fd6abf258d585715a093552b-8.jpg","9":"26866b09fd6abf258d585715a093552b-9.jpg"}},"configuration":{},"availability":{"1335003":{"aditional_price":0,"availabile":707}}}
