{"viewData":{"url_key":"hp_2ss98ut_aba_440_g5_i5_8250u_1_6ghz","name":"HP 14\" ProBook 440 G5 Laptop","sku":"1361356","price":"829.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 14&quot; ProBook 440 G5 Laptop featuring 1.6 GHz Intel Core i5-8250U Quad-Core, 8GB DDR4 RAM | 256GB PCIe M.2 SSD 14&quot; 1920 x 1080 SVA TN Display. Review HP 440 G5","long_description":"Designed for professionals in corporate or SMB environments who want a combination of innovation, security, and multimedia capabilities, the 14\" ProBook 440 G5 Laptop from HP is a full-featured, thin, and light system that lets users remain productive whether in the office or on-the-go. It is powered by a 1.6 GHz Intel Core i5-8250U Quad-Core processor and 8GB of 2400 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 3.4 GHz using Intel's Turbo Boost 2.0 technology, and the memory can also be upgraded to a maximum of 32GB. The 14\" anti-glare SVA TN display features a Full HD 1920 x 1080 screen resolution, a 16:9 aspect ratio, and LED-backlighting. The integrated Intel UHD Graphics 620 chipset delivers a sharp, clear picture, and you'll also be able to output video to an external display using the built-in HDMI 1.4b and VGA ports. For storage of your files, this system is equipped with a 256GB NVMe PCIe M.2 2280 SSD, and there is also a 2.5\" / 7mm SATA drive bay for additional internal storage. If you want to add external storage, optical drives, memory card readers, printers, and more, the ProBook 440 G5 offers one USB 3.0 Type-C port and two USB 3.0 Type-A ports, one of which is powered. Gigabit Ethernet and 802.11ac Wi-Fi are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals wirelessly. There is also an SD/SDHC/SDXC card reader, a 720p webcam, dual-array microphones, and stereo speakers. HP's ProBook 440 G5 includes a 45W AC adapter that operates using 100-240 VAC at 47-63 Hz and a 3-cell / 48Wh lithium-ion prismatic battery that lasts for up to 16.25 hours before recharging is required and can recharge in around 3 hours when the system is off or in standby mode. The installed operating system is Windows 10 Pro (64-bit).","images":{"0":"ec86f6224b8071c95327cd2931785258-0.jpg","1":"ec86f6224b8071c95327cd2931785258-1.jpg","2":"ec86f6224b8071c95327cd2931785258-2.jpg","3":"ec86f6224b8071c95327cd2931785258-3.jpg","4":"ec86f6224b8071c95327cd2931785258-4.jpg","5":"ec86f6224b8071c95327cd2931785258-5.jpg","6":"ec86f6224b8071c95327cd2931785258-6.jpg","7":"ec86f6224b8071c95327cd2931785258-7.jpg"}},"configuration":{},"availability":{"1361356":{"aditional_price":0,"availabile":907}}}
