{"viewData":{"url_key":"hp_2tt75ut_aba_470_g5_i7_8550u_1_8ghz","name":"HP 17.3\" ProBook 470 G5 Laptop","sku":"1361370","price":"959.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 17.3&quot; ProBook 470 G5 Laptop featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB DDR4 RAM | 1TB 5400 rpm 2.5&quot; HDD 17.3&quot; 1920 x 1080 Anti-Glare IPS Display. Review HP 470 G5","long_description":"Designed for professionals in corporate or SMB environments who want a combination of innovation, security, and multimedia capabilities, the 17.3.6\" ProBook 470 G5 Laptop from HP is a full-featured, thin, and light system that lets users remain productive whether in the office or on-the-go. It is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor and 8GB of 2400 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 3.7 GHz using Intel's Turbo Boost 2.0 technology, and the memory can also be upgraded to a maximum of 32GB. The 17.3\" anti-glare UWVA IPS display features a Full HD 1920 x 1080 screen resolution, a 16:9 aspect ratio, and LED-backlighting. The dedicated NVIDIA GeForce 930MX graphics card has 2GB of dedicated DDR3 memory and delivers a sharp, clear picture. You'll also be able to output video to an external display using the built-in HDMI 1.4b and VGA ports, as well as DisplayPort via USB Type-C. For storage of your files, this system is equipped with a 1TB 5400 rpm rpm SATA 2.5\" hard drive, and there is also an empty M.2 slot for additional internal storage. If you want to add external storage, optical drives, memory card readers, printers, and more, the ProBook 470 G5 offers one USB 3.0 Type-C port, which supports Power Delivery, two USB 3.0 Type-A ports, and one powered USB 2.0 Type-A port. Gigabit Ethernet and 802.11ac 2x2 Wi-Fi are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals wirelessly. There is also an SD/SDHC/SDXC card reader, a 720p webcam, dual-array microphones, and stereo speakers. HP's ProBook 470 G5 includes a 65W Smart AC adapter and a 3-cell / 48Wh long life lithium-ion battery that lasts for up to 14.25 hours before recharging is required. The installed operating system is Windows 10 Pro (64-bit).","images":{"0":"ed64f4091271e3c0f544b15f1ded359a-0.jpg","1":"ed64f4091271e3c0f544b15f1ded359a-1.jpg","2":"ed64f4091271e3c0f544b15f1ded359a-2.jpg","3":"ed64f4091271e3c0f544b15f1ded359a-3.jpg","4":"ed64f4091271e3c0f544b15f1ded359a-4.jpg","5":"ed64f4091271e3c0f544b15f1ded359a-5.jpg","6":"ed64f4091271e3c0f544b15f1ded359a-6.jpg"}},"configuration":{},"availability":{"1361370":{"aditional_price":0,"availabile":988}}}
