{"viewData":{"url_key":"hp_3pp87ut_aba_probook_455_g5_a9_9420","name":"HP 15.6\" ProBook 455 G5 Laptop","sku":"1389132","price":"499.99","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ProBook 455 G5 Laptop featuring 3.0 GHz AMD A9-9420 Dual-Core, 4GB DDR4 RAM | 500GB 7200 rpm 2.5&quot; HDD 15.6&quot; 1366 x 768 Anti-Glare. Review HP 455 G5","long_description":"Designed for professionals in corporate or SMB environments who want a combination of innovation, security, and multimedia capabilities, the 15.6\" ProBook 455 G5 Laptop from HP is a full-featured, thin, and light system that lets users remain productive whether in the office or on-the-go. It is powered by a 3.0 GHz AMD A9-9420 Dual-Core processor and 4GB of 2133 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 3.6 GHz and the memory can also be upgraded to a maximum of 16GB. The 15.6\" anti-glare TN display features an HD 1366 x 768 screen resolution, a 16:9 aspect ratio, LED-backlighting with a brightness of 220 cd/m2, a typical contrast ratio of 300:1, a refresh rate of 60 Hz, viewing angles of 45/45/25/35°, 6-bit + Hi FRC color depth, and 45% color gamut coverage. The integrated AMD Radeon R5 chipset delivers, a sharp, clear picture, and you'll also be able to output video to an external display using the built-in HDMI 1.4b and VGA ports, as well as DisplayPort via USB Type-C.  For storage of your files, this system is equipped with a 500GB 7200 rpm SATA III 2.5\" hard drive, and there is also an empty M.2 2280 slot available for additional internal SATA or PCIe storage. If you want to add external storage, optical drives, memory card readers, printers, and more, the ProBook 455 G5 offers one USB 3.0 Type-C port, which supports Power Delivery, two USB 3.0 Type-A ports, and one powered USB 2.0 Type-A port. Gigabit Ethernet and 802.11ac 1x1 Wi-Fi are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals wirelessly. There is also an SD/SDHC/SDXC card reader, a 720p webcam, dual-array microphones, and stereo speakers. HP's ProBook 455 G5 includes a 45W AC adapter and a 3-cell / 48Wh lithium-ion battery that lasts for up to 9.75 hours before recharging is required and can fast charge up to 90% in 90 minutes. The installed operating system is Windows 10 Pro (64-bit).","images":{"0":"8be86536e245106410714d2cd57be88e-0.jpg","1":"8be86536e245106410714d2cd57be88e-1.jpg","2":"8be86536e245106410714d2cd57be88e-2.jpg","3":"8be86536e245106410714d2cd57be88e-3.jpg"}},"configuration":{},"availability":{"1389132":{"aditional_price":0,"availabile":243}}}
