{"viewData":{"url_key":"hp_3rs12ut_aba_850_g5_i7_8650u_1_9g_16gb","name":"HP 15.6\" EliteBook 850 G5 Notebook","sku":"1391711","price":"1,799.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; EliteBook 850 G5 Notebook featuring 1.9 GHz Intel Core i7-8650U Quad-Core, 16GB of DDR4 RAM | 512GB PCIe M.2 SSD 15.6&quot; 1920 x 1080 UWVA IPS Display. Review HP 850 G5","long_description":"Designed with modern professionals in mind, the 15.6\" EliteBook 850 G5 Notebook from HP is secure, manageable, and offers powerful collaboration tools, allowing users to be productive whether they are at the office or on-the-go. This system is powered by a 1.9 GHz Intel Core i7-8650U Quad-Core processor which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 4.2 GHz using Intel Turbo Boost 2.0 technology. The 16GB of 2400 MHz DDR4 RAM, which comes in a 2 x 8GB configuration, helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. If you need more RAM, this system accepts up to 32GB, using one 16GB module in each of the 260-pin SO-DIMM slots. The 15.6\" UWVA Anti-Glare IPS display features a Full HD 1920 x 1080 native resolution that is equipped with LED-backlighting, a 16:9 aspect ratio, 400 cd/m2 brightness, a 600:1 typical contrast ratio, a refresh rate of 60 Hz, and viewing angles of 85/85/85/85°. Integrated Intel UHD Graphics 620 delivers a sharp, clear picture, and you'll be able to output video to an external display at resolutions up to 4K @ 24 Hz using the HDMI 1.4b output. For long-term storage of your files, a 512GB Opal 2 SED NVMe PCIe M.2 SSD offers quick access to your data. If you want to add external storage drives or other peripherals, the EliteBook 850 G5 features one 40 Gb/s Thunderbolt 3 port and two 5 Gb/s USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port, and a docking connector. Gigabit Ethernet and 802.11ac Wi-Fi are also built-in for wired and wireless networking and Bluetooth 4.2 technology will allow you to connect additional compatible peripherals. Other integrated features include a 720p IR webcam, multi-array microphones, and stereo speakers with Bang & Olufsen HD audio. The EliteBook 850 G5 Notebook includes a 65W Smart AC adapter and an HP 3-cell / 56Wh lithium-ion polymer long-life battery that supports fast charging of up to 50% in 30 minutes and lasts for up to 14.25 hours before recharging is required. The installed operating system is Windows 10 Pro (64-bit) and also included is recovery media.","images":{"0":"0776b81a376f5db3e60ed7eeba7efe27-0.jpg","1":"0776b81a376f5db3e60ed7eeba7efe27-1.jpg","2":"0776b81a376f5db3e60ed7eeba7efe27-2.jpg","3":"0776b81a376f5db3e60ed7eeba7efe27-3.jpg","4":"0776b81a376f5db3e60ed7eeba7efe27-4.jpg","5":"0776b81a376f5db3e60ed7eeba7efe27-5.jpg"}},"configuration":{},"availability":{"1391711":{"aditional_price":0,"availabile":131}}}
