{"viewData":{"url_key":"hp_3yw20ut_aba_zb15u_g5_i7_8550u_8_256ssd","name":"HP 15.6\" ZBook 15u G5 Mobile Workstation","sku":"1396390","price":"1,399.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ZBook 15u G5 Mobile Workstation featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB DDR4 RAM | 256GB PCIe M.2 SSD 15.6&quot; 1920 x 1080 UWVA IPS Display. Review HP 15u G5","long_description":"Workstation-class power meets a thin and light design with the 15.6\" ZBook 15u G5 Mobile Workstation from HP. Designed for on-the-go executives and customized for road warriors, this system delivers professional graphics and allows users to view and edit high-resolution files from almost anywhere. This system is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor, which allows you to run multiple applications simultaneously and power through tasks such as spreadsheets, CAD, Adobe, and Autodesk applications. If you need more power, the system can be overclocked to 4.0 GHz using Intel Turbo Boost 2.0 technology. The 8GB of 2400 MHz DDR4 RAM comes in a 1 x 8GB configuration and helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. Using a 16GB module in each of the two 260-pin SO-DIMM slots, the system's memory can be upgraded to 32GB. The 15.6\" UWVA IPS anti-glare display features a Full HD 1920 x 1080 native resolution, LED-backlighting, and a 16:9 aspect ratio. The AMD Radeon Pro WX 3100 graphics card has 2GB of discrete GDDR5 memory and delivers a sharp, clear picture. You'll also be able to output video to an external display at resolutions up to 3840 x 2160 using the system's DisplayPort 1.2 output by way of Thunderbolt 3, as well as HDMI 1.4b. Up to three independent displays are supported, allowing for the rich visual immersion and real-time visualization of complex, multi-layered files and projects. For storage of your files, this ZBook 15u G5 is equipped with a 256GB NMVe PCIe M.2 SSD that uses Tri-Level Cell (TLC) flash memory. If you want to add external storage, optical drives, memory card readers, and more, the ZBook 15u G5 offers one 40 Gb/s Thunderbolt 3 port and two USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port. Gigabit Ethernet and 802.11ac dual-band Wi-Fi (2x2) are built-in for wired and wireless networking and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. A built-in SD/SDHC/SDXC card reader supports UHS-II flash media and lets users download content from their digital camera. Other integrated features include a 720p webcam with near infrared (IR) imaging to authenticate and unlock Windows devices, as well as your Microsoft Passport account using Windows Hello face authentication, triple-array microphones, stereo speakers with Bang & Olufsen HD audio, a smart card reader, | NFC and a 102-key backlit and spill-resistant keyboard. The ZBook 15u G5 includes an Elite Services card, a 3.3' power cord, a Slim Smart 65W AC adapter that operates using 90-265 VAC at 47-63 Hz, and an HP Long Life 3-cell / 56Wh lithium-ion polymer battery that lasts for up to 10 hours before recharging is required. The installed operating system is Windows 10 Professional (64-bit) and protection is provided by a limited 3-year parts and labor warranty. Also included is Windows 10 Pro (64-Bit) recovery media.","images":{"0":"4acad9b9a8d786b8c388c8ad95ddcd90-0.jpg","1":"4acad9b9a8d786b8c388c8ad95ddcd90-1.jpg","2":"4acad9b9a8d786b8c388c8ad95ddcd90-2.jpg","3":"4acad9b9a8d786b8c388c8ad95ddcd90-3.jpg","4":"4acad9b9a8d786b8c388c8ad95ddcd90-4.jpg","5":"4acad9b9a8d786b8c388c8ad95ddcd90-5.jpg","6":"4acad9b9a8d786b8c388c8ad95ddcd90-6.jpg"}},"configuration":{},"availability":{"1396390":{"aditional_price":0,"availabile":829}}}
