{"viewData":{"url_key":"dell_thkw1_latitude_7490_i7_8650u_16gb","name":"Dell 14\" Latitude 7490 Laptop","sku":"1397939","price":"1,885.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 14&quot; Latitude 7490 Laptop featuring 1.9 GHz Intel Core i7-8650U Quad-Core, 16GB DDR4 RAM | 512GB SATA M.2 SSD 14&quot; 1920 x 1080 Anti-Glare Display. Review Dell 7490","long_description":"The 14\" Latitude 7490 Laptop from Dell is a business-class laptop built with durable materials. It is powered by a 1.9 GHz Intel Core i7-8650U Quad-Core processor and 16GB of 2400 MHz DDR4 RAM in a 2 x 8GB configuration, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 4.2 GHz using Intel's Turbo Boost 2.0 technology. Using a 16GB memory module in each of the 260-pin SO-DIMM slots, the total system memory can be upgraded to 32GB, or 16GB per slot. The 14\" Anti-Glare display features a Full HD 16:9 resolution of 1920 x 1080 for playback of your media content, plus a brightness of 300 cd/m2, a contrast ratio of 600:1, a refresh rate of 60 Hz, viewing angles of 80/80/80/80°, 157 ppi, and a response time of 35 ms rise/fall. Visuals are handled by the integrated Intel UHD Graphics 620 chipset, and you can output video to an external display using the HDMI 1.4 port, as well as DisplayPort via USB Type-C.  For storage of your files, this system comes with a 512GB SATA M.2 SSD. If you want to add external storage, optical drives, mice, keyboards, printers, memory card readers, and more, the Latitude 7490 offers one USB 3.1 Gen 1 Type-C port and three USB 3.1 Gen 1 Type-A ports (one with PowerShare). Built-in stereo speakers, dual microphones, and a 720p webcam let you participate in video calls for work or with friends and family. Connect to the internet via dual-band 802.11ac Wi-Fi (2x2) or Gigabit Ethernet LAN for a more stable and reliable connection. Furthermore, to free up USB ports and reduce wire clutter, you can connect additional peripherals and devices using Bluetooth 4.2, while a built-in media card reader supports UHS-II microSD, microSDHC, and microSDXC formats. Dell's 14\" Latitude 7490 Laptop operates using an included 65W AC adapter, a power cord, and a 4-cell / 68Wh lithium prismatic battery with ExpressCharge that can last for up to 20 hours before recharging is required. The installed operating system is Windows 10 Pro (64-Bit).","images":{"0":"30d9101860d8476557960382f78243c2-0.jpg","1":"30d9101860d8476557960382f78243c2-1.jpg","2":"30d9101860d8476557960382f78243c2-2.jpg","3":"30d9101860d8476557960382f78243c2-3.jpg","4":"30d9101860d8476557960382f78243c2-4.jpg","5":"30d9101860d8476557960382f78243c2-5.jpg","6":"30d9101860d8476557960382f78243c2-6.jpg","7":"30d9101860d8476557960382f78243c2-7.jpg","8":"30d9101860d8476557960382f78243c2-8.jpg"}},"configuration":{},"availability":{"1397939":{"aditional_price":0,"availabile":643}}}
