{"viewData":{"url_key":"dell_mmv2f_latitude_3590_i7_8550u_8gb","name":"Dell 15.6\" Latitude 3590 Laptop","sku":"1397900","price":"1,019.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 15.6&quot; Latitude 3590 Laptop featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB DDR4 RAM | 256GB SATA M.2 SSD 15.6&quot; 1920 x 1080 Anti-Glare Display. Review Dell 3590","long_description":"The 15.6\" Latitude 3590 Laptop from Dell provides security features critical for small and growing businesses in a durable, reliable, and portable design. The 15.6\" anti-glare display is driven by integrated AMD Radeon 530 Graphics and features a Full HD 1920 x 1080 resolution, 220 cd/m2 brightness, viewing angles of 40/40/10/30°, a 400:1 contrast ratio, and a refresh rate of 60 Hz. With its 16:9 aspect ratio, 1080p HD content is displayed without scaling or letterboxing. The system is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor. It also has 8GB of 2400 MHz DDR4 RAM, a 256GB SATA M.2 SSD, one USB 3.1 Gen 1 Type-C port with support for Power Delivery and DisplayPort, one USB 3.1 Gen 1 Type-A port with PowerShare, one USB 2.0 port Type-A port, one HDMI 1.4 port, one VGA port, a built-in SD/SDHC/SDXC card reader, dual-band 802.11ac Wi-Fi (2x2), Bluetooth 4.1, an integrated 720p webcam, dual integrated microphones, and stereo speakers that are driven by the Realtek ALC3253 codec with Waves MaxxAudio Pro. Included with this system are a 65W AC adapter that operates using 100-240 VAC at 50-60 Hz and a 4-cell / 56Wh battery that can recharge in around 3-4 hours. Windows 10 Pro (64-bit) is the installed operating system. Windows 10 Pro improves the user experience of Windows with several additions and changes. Cortana, Microsoft's digital assistant, is integrated into Windows 10 and is available to answer questions with information gathered from both your system and the internet. Microsoft Edge replaces Internet Explorer, and the Windows Store is now unified to include apps for PCs, tablets, and phones, which can now take advantage of the Windows Continuum feature. Xbox One streaming and integration for supported games are also included.","images":{"0":"a927b8ff4682b06d153304c40e8c8917-0.jpg","1":"a927b8ff4682b06d153304c40e8c8917-1.jpg","2":"a927b8ff4682b06d153304c40e8c8917-2.jpg","3":"a927b8ff4682b06d153304c40e8c8917-3.jpg","4":"a927b8ff4682b06d153304c40e8c8917-4.jpg","5":"a927b8ff4682b06d153304c40e8c8917-5.jpg","6":"a927b8ff4682b06d153304c40e8c8917-6.jpg","7":"a927b8ff4682b06d153304c40e8c8917-7.jpg","8":"a927b8ff4682b06d153304c40e8c8917-8.jpg","9":"a927b8ff4682b06d153304c40e8c8917-9.jpg"}},"configuration":{},"availability":{"1397900":{"aditional_price":0,"availabile":704}}}
