{"viewData":{"url_key":"dell_4km6x_latitude_5490_i5_8350u_8gb","name":"Dell 14\" Latitude 5490 Notebook","sku":"1397910","price":"1,119.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 14&quot; Latitude 5490 Notebook featuring 1.7 GHz Intel Core i5-8350U Quad-Core, 8GB DDR4 RAM | 256GB SATA M.2 SSD 14&quot; 1366 x 768 Anti-Glare Display. Review Dell 5490","long_description":"Designed for improved security, manageability, and reliability, with a versatile design and business features, the 14\" Latitude 5490 Notebook from Dell is powered by a 1.7 GHz Intel Core i5-8350U Quad-Core processor and 8GB of 2400 MHz DDR4 RAM in a 1 x 8GB configuration, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 3.6 GHz using Intel's Turbo Boost 2.0 technology, and the memory can be upgraded to 32GB in a 2 x 16GB configuration. The 14\" Anti-Glare display features an HD 16:9 resolution of 1366 x 768 for playback of your media content, plus a brightness of 220 cd/m2, a refresh rate of 60 Hz, and viewing angles of 40/40/10/30°. Visuals are handled by the integrated Intel UHD Graphics 620 chipset, and you can output video to an external display using the HDMI 1.4 port, as well as DisplayPort via USB Type-C.  For storage of your files, this system comes with a 256GB SATA M.2 SSD. If you want to add external storage, optical drives, mice, keyboards, printers, memory card readers, and more, the Latitude 5490 offers one USB 3.1 Gen 1 Type-C port and three USB 3.1 Gen 1 Type-A ports (one with PowerShare). Built-in stereo speakers, a microphone, and a 720p webcam let you participate in video calls for work or with friends and family. Connect to the internet via dual-band 802.11ac Wi-Fi or Gigabit Ethernet LAN for a more stable and reliable connection. Furthermore, to free up USB ports and reduce wire clutter, you can connect additional peripherals and devices using Bluetooth 4.2, while a built-in media card reader supports UHS-II SD formats. Dell's 14\" Latitude 5490 Notebook operates using an included 65W AC adapter, a power cord, and a 4-cell / 68Wh ExpressCharge battery. The installed operating system is Windows 10 Pro (64-Bit).","images":{"0":"9f542009107f18eb9d27408661162f45-0.jpg","1":"9f542009107f18eb9d27408661162f45-1.jpg","2":"9f542009107f18eb9d27408661162f45-2.jpg","3":"9f542009107f18eb9d27408661162f45-3.jpg","4":"9f542009107f18eb9d27408661162f45-4.jpg","5":"9f542009107f18eb9d27408661162f45-5.jpg","6":"9f542009107f18eb9d27408661162f45-6.jpg","7":"9f542009107f18eb9d27408661162f45-7.jpg","8":"9f542009107f18eb9d27408661162f45-8.jpg"}},"configuration":{},"availability":{"1397910":{"aditional_price":0,"availabile":498}}}
