{"viewData":{"url_key":"dell_i5579_7961gry_i7_8550u_16gb_512ssd_windows","name":"Dell 15.6\" Inspiron 15 5000 Series 5579 Multi-Touch 2-in-1 Notebook","sku":"1398204","price":"899.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 15.6&quot; Inspiron 15 5000 Series 5579 Multi-Touch 2-in-1 Notebook featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 16GB of DDR4 RAM | 512GB SATA 2.5&quot; SSD 15.6&quot; 1920 x 1080 IPS Touchscreen. Review Dell 15 5000","long_description":"With its 360° hinge design, the 15.6\" Inspiron 15 5000 Series 5579 Multi-Touch 2-in-1 Notebook from Dell allows you to switch between four different modes. You can use Tent Mode for using recipes in real time, Stand Mode for movies on an airplane, Laptop Mode for typing your novel or emailing work, and Tablet Mode to make reading easier while you're reclined. The Inspiron 15 5579 measures just 0.8\" thin and weighs 4.85 pounds. The 15.6\" TrueLife IPS display features a Full HD 1920 x 1080 resolution, a 16:9 aspect ratio, 80/80/80/80° viewing angles, a 60 Hz refresh rate, LED backlighting, and multi-touch functionality, which allows you to utilize the touch features and functions in Windows 10 Home to further improve accessibility and productivity. You can swipe, tap, and resize apps at your preference. The integrated Intel UHD Graphics 620 chipset delivers a sharp, clear picture, and you'll also be able to output video to an external display using the built-in HDMI 1.4b output. The system is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor that can be overclocked to 4.0 GHz. It also has 16GB of 2400 MHz DDR4 RAM, a 512GB SATA III 2.5\" SSD, two USB 3.1 Gen 1 Type-A ports (one with PowerShare), one USB 2.0 port Type-A port, one HDMI 1.4b port, a built-in SD/SDHC/SDXC card reader, dual-band 802.11ac Wi-Fi (2x2), and Bluetooth 4.1. Other features include an integrated 720p webcam for video calls, a 480p infrared (IR) webcam that senses depth to enhance security with Windows Hello face authentication, dual integrated microphones, and stereo speakers that are driven by the Realtek ALC3253-VA3 codec with Waves MaxxAudio Pro. Included with this system are a 45W AC adapter that operates using 100-240 VAC at 50-60 Hz and a 3-cell / 42Wh lithium-ion battery that has a life of 300 discharge/charge cycles. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"3b0573d76c3bbf2e43e471c76aa61198-0.jpg","1":"3b0573d76c3bbf2e43e471c76aa61198-1.jpg","2":"3b0573d76c3bbf2e43e471c76aa61198-2.jpg","3":"3b0573d76c3bbf2e43e471c76aa61198-3.jpg","4":"3b0573d76c3bbf2e43e471c76aa61198-4.jpg","5":"3b0573d76c3bbf2e43e471c76aa61198-5.jpg","6":"3b0573d76c3bbf2e43e471c76aa61198-6.jpg"}},"configuration":{},"availability":{"1398204":{"aditional_price":0,"availabile":626}}}
