{"viewData":{"url_key":"lenovo_20l9001aus_t580_i7_8650u_16gb_512ssd","name":"Lenovo 15.6\" ThinkPad T580 Multi-Touch Laptop","sku":"1400243","price":"1,879.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; ThinkPad T580 Multi-Touch Laptop featuring 1.9 GHz Intel Core i7-8650U Quad-Core, 16GB DDR4 | 512GB SSD Integrated Intel UHD Graphics 620. Review Lenovo T580","long_description":"The 15.6\" ThinkPad T580 Multi-Touch Notebook from Lenovo is a business-oriented system made for users who are constantly on-the-go. It features a fingerprint reader, TPM 2.0, as well as power-on and hard disk password protection to keep your system secure. Specs-wise, it's equipped with a 1.9 GHz Intel Core i7-8650U quad-core processor, 16GB of DDR4 RAM, and a 512GB M.2 PCIe NVMe SSD. Should you need more space, you can attach external storage solutions using its multiple USB ports.  Its 15.6\" display, driven by integrated Intel UHD graphics, is built with an IPS panel and has a 1920 x 1080 resolution for crisp and clear Full HD content playback. Furthermore, it supports touch inputs and gestures, which you can utilize within Windows 10 to enhance its efficiency and accessibility. Other integrated features include a 4-in-1 media card reader, 802.11ac Wi-Fi, Bluetooth 4.1, a Thunderbolt 3 port, an HDMI port, speakers, a webcam with microphones, a backlit keyboard, and a 3.5mm mic and headphone combo jack. The operating system installed is Windows 10 Pro.","images":{"0":"4f103de33fd406e7843bdfa95318a4d1-0.jpg","1":"4f103de33fd406e7843bdfa95318a4d1-1.jpg","2":"4f103de33fd406e7843bdfa95318a4d1-2.jpg","3":"4f103de33fd406e7843bdfa95318a4d1-3.jpg","4":"4f103de33fd406e7843bdfa95318a4d1-4.jpg","5":"4f103de33fd406e7843bdfa95318a4d1-5.jpg","6":"4f103de33fd406e7843bdfa95318a4d1-6.jpg","7":"4f103de33fd406e7843bdfa95318a4d1-7.jpg","8":"4f103de33fd406e7843bdfa95318a4d1-8.jpg","9":"4f103de33fd406e7843bdfa95318a4d1-9.jpg","10":"4f103de33fd406e7843bdfa95318a4d1-10.jpg","11":"4f103de33fd406e7843bdfa95318a4d1-11.jpg","12":"4f103de33fd406e7843bdfa95318a4d1-12.jpg"}},"configuration":{},"availability":{"1400243":{"aditional_price":0,"availabile":222}}}
