{"viewData":{"url_key":"lenovo_81ca000uus_flex_15_core_i7_8550u","name":"Lenovo 15.6\" Flex 5 Multi-Touch 2-in-1 Notebook","sku":"1401112","price":"779.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; Flex 5 Multi-Touch 2-in-1 Notebook featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB DDR4 | 256GB PCIe SSD 15.6&quot; 1920 x 1080 Anti-Glare IPS Display. Review Lenovo ","long_description":"The 15.6\" Flex 5 Multi-Touch 2-in-1 Notebook from Lenovo is a well-rounded system designed for everyday uses such as browsing the Internet, streaming movies and TV shows, creating and editing documents, and video chatting with friends. Thanks to its 2-in-1 design, you can easily flip it from laptop mode to tablet or tent mode to fit your current application. Powered by a 1.8 GHz Intel Core i7-8550U quad-core processor and 8GB of DDR4 RAM, it can efficiently multitask and quickly access frequently used files and programs. When handling a heftier workload, the CPU can reach a core clock speed of 3.7 GHz thanks to Intel Turbo Boost technology.  Its 15.6\" display features a 1920 x 1080 Full HD resolution and is built with an IPS (In-Plane Switching) panel, which offers vivid colors and wide viewing angles. It also supports touch input, so you can utilize touch gestures and commands within Windows 10 to enhance its accessibility and efficiency. Graphical processing is driven by an NVIDIA GeForce MX130 graphics card, and it has an HDMI port that allows you to connect an additional display for enhanced multitasking or larger viewing.  For storing your music, photos, videos, and more, it's equipped with a 256GB PCIe SSD. Should you need more room, you can connect external storage solutions using its multiple USB ports, as well as its 4-in-1 media card reader, which can also be used to quickly transfer files from mobile devices. Other integrated features include 802.11ac Wi-Fi, Bluetooth 4.1, a webcam, microphones, speakers, a fingerprint reader, and a 3.5mm mic and headphone combo jack. The operating system installed is Windows 10 Home.","images":{"0":"228c51a211cb36d503c6e4e8aa2d2e7f-0.jpg","1":"228c51a211cb36d503c6e4e8aa2d2e7f-1.jpg","2":"228c51a211cb36d503c6e4e8aa2d2e7f-2.jpg","3":"228c51a211cb36d503c6e4e8aa2d2e7f-3.jpg","4":"228c51a211cb36d503c6e4e8aa2d2e7f-4.jpg","5":"228c51a211cb36d503c6e4e8aa2d2e7f-5.jpg","6":"228c51a211cb36d503c6e4e8aa2d2e7f-6.jpg","7":"228c51a211cb36d503c6e4e8aa2d2e7f-7.jpg","8":"228c51a211cb36d503c6e4e8aa2d2e7f-8.jpg","9":"228c51a211cb36d503c6e4e8aa2d2e7f-9.jpg","10":"228c51a211cb36d503c6e4e8aa2d2e7f-10.jpg","11":"228c51a211cb36d503c6e4e8aa2d2e7f-11.jpg","12":"228c51a211cb36d503c6e4e8aa2d2e7f-12.jpg"}},"configuration":{},"availability":{"1401112":{"aditional_price":0,"availabile":507}}}
