{"viewData":{"url_key":"hp_3yx97ut_aba_650_g4_i7_8650u_8gb","name":"HP 15.6\" ProBook 650 G4 Laptop","sku":"1402890","price":"1,339.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ProBook 650 G4 Laptop featuring 1.9 GHz Intel Core i7-8650U Quad-Core, 8GB DDR4 RAM | 256GB PCIe M.2 SSD 15.6&quot; 1920 x 1080 UWVA AG Display. Review HP 650 G4","long_description":"Built to deliver enterprise-grade performance, security, and manageability, while also supporting today's technology and legacy devices, the 15.6\" ProBook 650 G4 Laptop from HP is powered by a 1.9 GHz Intel Core i7-8650U Quad-Core processor and 8GB of 2400 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 4.2 GHz using Intel's Turbo Boost technology.The 15.6\" UWVA anti-glare display features a Full HD 16:9 resolution of 1920 x 1080 for playback of your media content. Visuals are handled by the integrated Intel UHD Graphics 620 chipset, and you can output video to an external display using the HDMI 1.4 or VGA ports, as well as DisplayPort via USB Type-C.For storage of your files, this system comes with a 256GB NVMe PCIe M.2 SSD, which has a PCIe 3.0 x4 interface and an 80mm form factor. There is also one 2.5\" / 7mm drive bay available for a SATA hard drive or SSD. If you want to add external storage, optical drives, mice, keyboards, printers, memory card readers, and more, the ProBook 650 G4 offers one USB 3.1 Gen 1 Type-C port, which also supports Power Delivery, DisplayPort, and device charging, plus two USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port. Built-in stereo speakers, dual-array microphones, and a 720p privacy webcam let you participate in video calls for work or with friends and family. Connect to the internet via 802.11ac Wi-Fi or Gigabit Ethernet LAN for a more stable and reliable connection. Furthermore, to free up USB ports and reduce wire clutter, you can connect additional peripherals and devices using Bluetooth 4.2, while a built-in 3-in-1 media card reader supports microSD/SDHC/SDXC formats. The HP ProBook 650 G4 Laptop operates using an included 45W AC adapter that runs using 115-230 VAC at 47-63 Hz, a power cord, and a 3-cell / 48Wh lithium-ion Long Life battery that will last for up to 14.5 hours before recharging is required. The installed operating system is Windows 10 Pro (64-Bit).","images":{"0":"bbd53ffe8a8b8c48abd1e4217588cc87-0.jpg","1":"bbd53ffe8a8b8c48abd1e4217588cc87-1.jpg","2":"bbd53ffe8a8b8c48abd1e4217588cc87-2.jpg","3":"bbd53ffe8a8b8c48abd1e4217588cc87-3.jpg","4":"bbd53ffe8a8b8c48abd1e4217588cc87-4.jpg","5":"bbd53ffe8a8b8c48abd1e4217588cc87-5.jpg"}},"configuration":{},"availability":{"1402890":{"aditional_price":0,"availabile":937}}}
