{"viewData":{"url_key":"hp_3xj75ut_aba_640_g4_i5_7200u_8gb","name":"HP 14\" ProBook 640 G4 Laptop","sku":"1402873","price":"999.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 14&quot; ProBook 640 G4 Laptop featuring 2.5 GHz Intel Core i5-7200U Dual-Core, 8GB DDR4 RAM | 256GB NVMe PCIe M.2 SSD 14&quot; 1920 x 1080 UWVA Anti-Glare Display. Review HP 640 G4","long_description":"Built to deliver enterprise-grade performance, security, manageability, and flexible configuration options, the 14\" ProBook 640 G4 Laptop from HP is powered by a 2.5 GHz Intel Core i5-7200U Dual-Core processor and 8GB of 2400 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 3.1 GHz using Intel's Turbo Boost technology. The 14\" UWVA IPS Anti-Glare display features a Full HD 16:9 resolution of 1920 x 1080 for playback of your media content. Visuals are handled by the integrated Intel HD Graphics 620 chipset, and you can output video to an external display using HDMI 1.4 and VGA outputs, as well as DisplayPort 1.2, which is supported via the USB Type-C output.  For storage of your files, this system comes with a 256GB NVMe PCIe M.2 SSD, with one 2.5\" / 7mm SATA III drive bay available for additional internal storage. If you want to add external storage, optical drives, mice, keyboards, printers, memory card readers, and more, the ProBook 640 G4 offers one USB 3.1 Gen 1 Type-C port, which also supports Power Delivery and DisplayPort, and three USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port. Built-in stereo speakers, dual microphones, and a 720p webcam with a privacy cover let you participate in video calls for work or with friends and family. Connect to the internet via dual-band 802.11ac Wi-Fi (2x2) or Gigabit Ethernet LAN for a more stable and reliable connection. Furthermore, to free up USB ports and reduce wire clutter, you can connect additional peripherals and devices using Bluetooth 4.2, while a built-in 3-in-1 media card reader supports microSD, microSDHC, and microSDXC formats. The HP ProBook 640 G4 Laptop operates using an included 45W Smart AC adapter that runs using 115-230 VAC at 47-63 Hz, a power cord, and a 3-cell / 48Wh lithium-ion Long Life Prismatic battery that will last for up to 14.5 hours before recharging is required. The installed operating system is Windows 10 Pro (64-bit).","images":{"0":"b768de16d4c36e82e6399b726bc8eefa-0.jpg","1":"b768de16d4c36e82e6399b726bc8eefa-1.jpg","2":"b768de16d4c36e82e6399b726bc8eefa-2.jpg","3":"b768de16d4c36e82e6399b726bc8eefa-3.jpg","4":"b768de16d4c36e82e6399b726bc8eefa-4.jpg","5":"b768de16d4c36e82e6399b726bc8eefa-5.jpg"}},"configuration":{},"availability":{"1402873":{"aditional_price":0,"availabile":583}}}
