{"viewData":{"url_key":"lenovo_20kh002jus_x1_carbon_i7_8650_16gb","name":"Lenovo 14\" ThinkPad X1 Carbon Multi-Touch Ultrabook (6th Gen)","sku":"1404757","price":"2,099.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 14&quot; ThinkPad X1 Carbon Multi-Touch Ultrabook (6th Gen) featuring 1.9 GHz Intel Core i7-8650U Quad-Core, 16GB LPDDR3 | 512GB M.2 NVMe PCIe SSD 14&quot; 1920 x 1080 IPS Display. Review Lenovo X1 Carbon","long_description":"The 14\" ThinkPad X1 Carbon Multi-Touch Ultrabook from Lenovo is a lightweight laptop designed for on-the-go professionals who need a secure and portable system to keep up with them. To ensure your data is protected, the X1 Carbon is equipped with a fingerprint reader, power-on password protection, TPM (Trusted Platform Module), and a security keyhole slot. Performance-wise, it's powered by a 1.9 GHz Intel Core i7-8650U quad-core processor, 16GB of LPDDR3 RAM, and integrated Intel UHD graphics. Its 14\" display has a 1920 x 1080 resolution and is built with an IPS (In-Plane Switching) display, delivering crisp and clear content with vivid colors and wide viewing angles.  A 512GB M.2 NVMe PCIe SSD is installed to store your files and multimedia content offering fast boot and load times. Moreover, this Opal2 drive is self encrypting for an additional layer of security. Should you need more space, you can attach external storage solutions using its multiple USB ports as well as its microSD card reader. Connect to the Internet via 802.11ac Wi-Fi and pair compatible wireless peripherals using Bluetooth 4.1 technology. Other integrated features include Thunderbolt 3 ports, an HDMI port, speakers, a webcam with microphones, a backlit keyboard, and a mic/headphone combo jack. The operating system installed is Windows 10 Pro.","images":{"0":"23d7be984ac6be2dc23ebe72bbe73003-0.jpg","1":"23d7be984ac6be2dc23ebe72bbe73003-1.jpg","2":"23d7be984ac6be2dc23ebe72bbe73003-2.jpg","3":"23d7be984ac6be2dc23ebe72bbe73003-3.jpg","4":"23d7be984ac6be2dc23ebe72bbe73003-4.jpg","5":"23d7be984ac6be2dc23ebe72bbe73003-5.jpg","6":"23d7be984ac6be2dc23ebe72bbe73003-6.jpg","7":"23d7be984ac6be2dc23ebe72bbe73003-7.jpg","8":"23d7be984ac6be2dc23ebe72bbe73003-8.jpg","9":"23d7be984ac6be2dc23ebe72bbe73003-9.jpg","10":"23d7be984ac6be2dc23ebe72bbe73003-10.jpg","11":"23d7be984ac6be2dc23ebe72bbe73003-11.jpg","12":"23d7be984ac6be2dc23ebe72bbe73003-12.jpg","13":"23d7be984ac6be2dc23ebe72bbe73003-13.jpg","14":"23d7be984ac6be2dc23ebe72bbe73003-14.jpg","15":"23d7be984ac6be2dc23ebe72bbe73003-15.jpg","16":"23d7be984ac6be2dc23ebe72bbe73003-16.jpg"}},"configuration":{},"availability":{"1404757":{"aditional_price":0,"availabile":340}}}
