{"viewData":{"url_key":"lenovo_20lb0028us_p52s_i7_8550u_16gb_512ssd","name":"Lenovo 15.6\" ThinkPad P52s Multi-Touch Mobile Workstation","sku":"1404771","price":"1,599.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; ThinkPad P52s Multi-Touch Mobile Workstation featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 16GB of DDR4 RAM | 512GB PCIe M.2 SSD 15.6&quot; 1920 x 1080 IPS Touchscreen. Review Lenovo P52s","long_description":"Created for designers, engineers, and video artists, the 15.6\" ThinkPad P52s Multi-Touch Mobile Workstation from Lenovo blends the power of a workstation with ultrabook mobility. This system is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 4.0 GHz using Intel Turbo Boost 2.0 technology. The 16GB of 2400 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The 15.6\" anti-glare IPS display features a Full HD 1920 x 1080 screen resolution that is equipped with LED-backlighting, a 16:9 aspect ratio, 250 cd/m2 brightness, a 700:1 typical contrast ratio, and viewing angles of 85/85/85/85°. The display also features 10-point multi-touch functionality, allowing you to utilize the touch gestures and functions in Windows 10 Pro to further improve accessibility and productivity. The dedicated NVIDIA Quadro P500 graphics card has 2GB of GDDR5 RAM and delivers a sharp, clear picture. You'll also be able to output video to an external display at resolutions up to 4096 x 2304 @ 60 Hz using the system's USB Type-C port and up to 4096 x 2160 @ 30 Hz using the HDMI port. Three independent displays are supported. For storage of your files, this ThinkPad P52s is equipped with a 512GB Opal 2 NVMe PCIe M.2 SSD. If you want to add external storage, optical drives, memory card readers, and more, there is one 40 Gb/s Thunderbolt 3 port that also supports 10 Gb/s USB 3.1 Gen 2 Type-C, plus power delivery and DisplayPort, one 5 Gb/s USB 3.1 Gen 1 Type-C port that supports power delivery and DisplayPort, and two USB 3.1 Gen 1 Type-A ports, one of which doubles as an always-on port. Gigabit Ethernet and 802.11ac dual-band Wi-Fi (2x2) are built-in for wired and wireless networking and Bluetooth 4.1 technology will also allow you to connect additional compatible peripherals. Content from memory cards may be accessed via a built-in card reader that supports SD, SDHC, SDXC, and MMC media. Other integrated features include a 720p webcam, a dual-array microphone, and stereo speakers with Dolby Audio Premium. The ThinkPad P52s Mobile Workstation is powered by a 65W USB Type-C AC adapter and two lithium-ion batteries—an integrated 4-cell / 32Wh battery and an external 3-cell / 24Wh, which provide up to 13.5 hours of use before recharging is required. The installed operating system is Windows 10 Professional (64-bit).","images":{"0":"cf80c93da80b9209ddcf9e13ebc12d9a-0.jpg","1":"cf80c93da80b9209ddcf9e13ebc12d9a-1.jpg","2":"cf80c93da80b9209ddcf9e13ebc12d9a-2.jpg","3":"cf80c93da80b9209ddcf9e13ebc12d9a-3.jpg","4":"cf80c93da80b9209ddcf9e13ebc12d9a-4.jpg","5":"cf80c93da80b9209ddcf9e13ebc12d9a-5.jpg","6":"cf80c93da80b9209ddcf9e13ebc12d9a-6.jpg","7":"cf80c93da80b9209ddcf9e13ebc12d9a-7.jpg","8":"cf80c93da80b9209ddcf9e13ebc12d9a-8.jpg","9":"cf80c93da80b9209ddcf9e13ebc12d9a-9.jpg","10":"cf80c93da80b9209ddcf9e13ebc12d9a-10.jpg","11":"cf80c93da80b9209ddcf9e13ebc12d9a-11.jpg"}},"configuration":{},"availability":{"1404771":{"aditional_price":0,"availabile":159}}}
