{"viewData":{"url_key":"hp_3zw67ua_aba_pv15cw0075_ryz_5_2500u","name":"HP 15.6\" Pavilion 15-cw0075nr Laptop","sku":"1410618","price":"549.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; Pavilion 15-cw0075nr Laptop featuring 2.0 GHz AMD Ryzen 5 2500U Quad-Core, 8GB DDR4 RAM | 1TB 5400 rpm SATA HDD 15.6&quot; 1920 x 1080 BrightView IPS Display. Review HP ","long_description":"Thin at 0.7\" and weighing 4.18 pounds, the 15.6\" Pavilion 15-cw0075nr Notebook from HP powerful performance that can deliver throughout long workdays. The system is powered by a 2.0 GHz AMD Ryzen 5 2500U Quad-Core processor, which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 3.6 GHz. The 8GB of 2400 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The memory slot is not user-accessible and upgradable.The 15.6\" BrightView IPS display features a Full HD 1920 x 1080 native resolution, WLED-backlighting, a 16:9 aspect ratio, and a micro-edge bezel. The integrated AMD Radeon Vega 8 chipset delivers a sharp, clear picture, and you'll also be able to output video to an external display at resolutions using the system's HDMI 1.4 port.For storage of your files, the Pavilion 15-cw0075nr is equipped with a 1TB 5400 rpm SATA 2.5\" hard drive. If you want to add external storage, optical drives, memory card readers, and more, there is one USB 3.1 Gen 1 Type-C port and two USB 3.1 Gen 1 Type-A ports, all of which only support data transfers of up to 5 Gb/s. Gigabit Ethernet and 802.11ac Wi-Fi (2x2) are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. A built-in multi-format SD card reader lets users download content from their digital camera and other integrated features include a 720p Wide Vision HD webcam with an 88° field of view, dual-array digital mics, and audio backed by dual HP speakers, HP Audio Boost, and custom tuning by B&O PLAY.HP's 15.6\" Pavilion 15-cw0075nr Notebook includes a 45W AC adapter, and its 3-cell / 41Wh lithium-ion prismatic battery supports HP Fast Charge and can recharge up to 50% in 45 minutes, The installed operating system is Windows 10 Home (64-bit) and protection is provided by a limited 1-year hardware warranty with 90 days of limited technical support for software and setup from the date of purchase.","images":{"0":"ba91c6cf4655d1148633d767ed52c81e-0.jpg","1":"ba91c6cf4655d1148633d767ed52c81e-1.jpg","2":"ba91c6cf4655d1148633d767ed52c81e-2.jpg","3":"ba91c6cf4655d1148633d767ed52c81e-3.jpg"}},"configuration":{},"availability":{"1410618":{"aditional_price":0,"availabile":263}}}
