{"viewData":{"url_key":"hp_3we41ua_aba_nv17_ae110nr_i7_8550u_12gb_1tb","name":"HP 17.3\" ENVY 17-ae110nr Multi-Touch Laptop","sku":"1410614","price":"1,049.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 17.3&quot; ENVY 17-ae110nr Multi-Touch Laptop featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 12GB DDR4 RAM | 1TB 7200 rpm SATA HDD 17.3&quot; 1920 x 1080 IPS Touchscreen. Review HP ","long_description":"Thin at 0.92\" and weighing 6.73 pounds, the 17.3\" ENVY 17-ae110nr Multi-Touch Notebook from HP lets users tackle virtually any task that comes their way. The system is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor, which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 4.0 GHz. The 12GB of 2400 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The memory slots are not user-accessible and upgradable.The 17.3\" display features a Full HD 1920 x 1080 native resolution, WLED-backlighting, and a 16:9 aspect ratio. The display also features edge-to-edge multi-touch functionality, allowing you to utilize the touch gestures and functions in Windows 10 to further improve accessibility and productivity. The dedicated NVIDIA GeForce MX150 graphics card has 4GB of discrete GDDR5 memory and delivers a sharp, clear picture. You'll also be able to output video to an external display at resolutions using the system's HDMI output or DisplayPort 1.2 via USB Type-C.For storage of your files, the ENVY 17-ae110nr is equipped with a 1TB 7200 rpm SATA 2.5\" hard drive. If you want to add external storage, optical drives, memory card readers, and more, there is one USB 3.1 Gen 1 Type-C port, which supports DisplayPort 1.2 and HP Sleep & Charge, plus three USB 3.1 Gen 1 Type-A ports, one of which supports Sleep & Charge. Gigabit Ethernet and 802.11ac Wi-Fi (2x2) are built-in for wired and wireless networking and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. A built-in multi-format SD card reader lets users download content from their digital camera and other integrated features include a 720p Wide Vision HD IR webcam, dual-array digital mics, and HD audio with stereo speakers.HP's 17.3\" ENVY 17-ae110nr Multi-Touch Notebook includes a 90W AC adapter, and its 3-cell / 55.8Wh lithium-ion prismatic battery supports HP Fast Charge and can recharge up to 50% in 45 minutes, while also being able to last up to 9 hours before recharging is required. The installed operating system is Windows 10 Home (64-bit) and protection is provided by a limited 1-year hardware warranty with 90 days of limited technical support for software and setup from the date of purchase.","images":{"0":"2c1c9b93e0a456f80e451e6e5727d73f-0.jpg","1":"2c1c9b93e0a456f80e451e6e5727d73f-1.jpg","2":"2c1c9b93e0a456f80e451e6e5727d73f-2.jpg","3":"2c1c9b93e0a456f80e451e6e5727d73f-3.jpg"}},"configuration":{},"availability":{"1410614":{"aditional_price":0,"availabile":443}}}
