{"viewData":{"url_key":"hp_3vn43ua_aba_pv14_ba175nr_i5_8250u_8gb_1tb","name":"HP 14\" Pavilion x360 14-ba175nr Multi-Touch 2-in-1 Laptop","sku":"1410616","price":"649.99","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 14&quot; Pavilion x360 14-ba175nr Multi-Touch 2-in-1 Laptop featuring 1.6 GHz Intel Core i5-8250U Quad-Core, 8GB DDR4 RAM | 1TB 5400 rpm SATA HDD 14&quot; 1366 x 768 Edge-to-Edge Touchscreen. Review HP x360","long_description":"Built with a 360° hinge, the 14\" Pavilion x360 14-ba175nr Multi-Touch 2-in-1 Laptop from HP enables users to work, write, watch, and play, while being free to create, connect and share. Also compatible with digital pens and Windows Ink technology, the Pavilion x360 can be used for a wide variety of functions.The system is powered by a 1.6 GHz Intel Core i5-8250U Quad-Core processor, which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 3.4 GHz. The 8GB of 2400 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The memory slots are not user-accessible and upgradable.The 14\" SVA display features an HD 1366 x 768 native resolution, WLED-backlighting, and a 16:9 aspect ratio. The display also features edge-to-edge multi-touch functionality, allowing you to utilize the touch gestures and functions in Windows 10 to further improve accessibility and productivity. The integrated Intel UHD Graphics 620 chipset delivers a sharp, clear picture, and you'll also be able to output video to an external display using the system's HDMI output.For storage of your files, the Pavilion x360 14-ba175nr is equipped with a 1TB 5400 rpm SATA 2.5\" hard drive. If you want to add external storage, optical drives, memory card readers, and more, there is one USB 3.1 Gen 1 Type-C port and two USB 3.1 Gen 1 Type-A ports, all of which only support data transfers up to 5 Gb/s. 802.11ac Wi-Fi (1x1) are built-in for wired and wireless networking and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. A built-in multi-format SD card reader lets users download content from their digital camera and other integrated features include a 720p Wide Vision HD webcam with an 88° field of view, dual-array digital mics, and B&O PLAY audio with dual speakers.HP's 14\" Pavilion x360 14-ba175nr Multi-Touch 2-in-1 Laptop includes a 65W AC adapter, and its 3-cell / 41Wh lithium-ion prismatic battery supports HP Fast Charge and can recharge up to 50% in 45 minutes, while also being able to last up to 9 hours before recharging is required. The installed operating system is Windows 10 Home (64-bit) and protection is provided by a limited 1-year hardware warranty with 90 days of limited technical support for software and setup from the date of purchase.","images":{"0":"99074ce810709718d408b7e8b1c51e8e-0.jpg","1":"99074ce810709718d408b7e8b1c51e8e-1.jpg","2":"99074ce810709718d408b7e8b1c51e8e-2.jpg","3":"99074ce810709718d408b7e8b1c51e8e-3.jpg","4":"99074ce810709718d408b7e8b1c51e8e-4.jpg","5":"99074ce810709718d408b7e8b1c51e8e-5.jpg","6":"99074ce810709718d408b7e8b1c51e8e-6.jpg","7":"99074ce810709718d408b7e8b1c51e8e-7.jpg"}},"configuration":{},"availability":{"1410616":{"aditional_price":0,"availabile":159}}}
