{"viewData":{"url_key":"lenovo_20h50045us_e570_i5_7200u_2_50_ghz","name":"Lenovo 15.6\" ThinkPad E570 Series Laptop","sku":"1411776","price":"675.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; ThinkPad E570 Series Laptop featuring 2.5 GHz Intel Core i5-7200U Dual-Core, 8GB DDR4 RAM | 256GB Opal2 SSD 15.6&quot; 1920 x 1080 IPS Display. Review Lenovo E570","long_description":"The 15.6\" ThinkPad E570 Series Notebook from Lenovo is a business and security oriented system designed for the on-the-go professional. To ensure your security, it's outfitted with Windows 10 Pro, a fingerprint reader, and a TPM (Trusted Platform Module) chip, which encrypts your files. For performance, it has a 2.5 GHz Intel Core i5-7200U dual-core processor and 8GB of DDR4 RAM, which lets you efficiently multitask. Store your data in its 256GB Opal2 solid-state drive, which provides you with enhanced security, and boot and load files and applications within seconds.  Its 15.6\" display features a 1920 x 1080 resolution and is built on an IPS (In-Plane Switching) panel, which offers vivid colors and wide viewing angles, so you can enjoy crisp and clear HD content. With integrated Intel HD Graphics 620, the E570 can handle everyday graphical processing such as watching videos, streaming movies, and more. Other integrated features include a SuperMulti DVD drive for reading and writing optical media, 802.11ac Wi-Fi and Gigabit Ethernet to connect to the Internet, Bluetooth 4.1, USB 3.0 and 2.0 ports, a 4-in-1 media card reader, an HDMI port, a webcam, speakers, microphones, as well as a 3.5mm mic and headphone combo jack.","images":{"0":"3ed5c80c71adc42603607893642bd11d-0.jpg","1":"3ed5c80c71adc42603607893642bd11d-1.jpg","2":"3ed5c80c71adc42603607893642bd11d-2.jpg","3":"3ed5c80c71adc42603607893642bd11d-3.jpg","4":"3ed5c80c71adc42603607893642bd11d-4.jpg","5":"3ed5c80c71adc42603607893642bd11d-5.jpg","6":"3ed5c80c71adc42603607893642bd11d-6.jpg","7":"3ed5c80c71adc42603607893642bd11d-7.jpg","8":"3ed5c80c71adc42603607893642bd11d-8.jpg","9":"3ed5c80c71adc42603607893642bd11d-9.jpg","10":"3ed5c80c71adc42603607893642bd11d-10.jpg","11":"3ed5c80c71adc42603607893642bd11d-11.jpg"}},"configuration":{},"availability":{"1411776":{"aditional_price":0,"availabile":519}}}
