{"viewData":{"url_key":"huawei_53010caj_hwd_nb_matebook_x","name":"Huawei 13.9\" MateBook X Pro Multi-Touch Laptop (Space Gray)","sku":"1411003","price":"1,499.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Huawei 13.9&quot; MateBook X Pro Multi-Touch Laptop (Space Gray) featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 16GB LPDDR3 | 512GB NVMe PCIe SSD 13.9&quot; 3000 x 2000 Multi-Touch Display. Review Huawei ","long_description":"The 13.9\" MateBook X Pro Multi-Touch Notebook from Huawei is a sleek and portable notebook designed for on-the-go work and entertainment. It features a nearly borderless display with a 91% screen-to-body ratio for an immersive viewing experience. Moreover, it has a 3000 x 2000 resolution, a 450 cd/m2 brightness rating, 100% sRGB coverage, and a 1500:1 contrast ratio for crisp and clear details with brighter bright colors and deeper blacks. it also supports touch inputs, so you can utilize touch gestures and commands within Windows 10 to enhance its efficiency and accessibility.  Specs-wise, the MateBook X Pro is equipped with a 1.8 GHz Intel Core i7-8550U quad-core processor, 16GB of 2133 MHz LPDDR3 RAM, a 512GB NVMe PCIe M.2 SSD, and an NVIDIA GeForce MX150 graphics card. If you need extra storage, it has multiple USB ports for external storage solutions. Other integrated features include 802.11ac Wi-Fi, Bluetooth 4.1, a recessed webcam, a backlit keyboard, microphones, speakers, and a 3.5mm mic/headphone combo jack. The operating system installed is Windows 10 Home Signature Edition.","images":{"0":"30db340bf0e6a22f5f68c148e5123639-0.jpg","1":"30db340bf0e6a22f5f68c148e5123639-1.jpg","2":"30db340bf0e6a22f5f68c148e5123639-2.jpg","3":"30db340bf0e6a22f5f68c148e5123639-3.jpg","4":"30db340bf0e6a22f5f68c148e5123639-4.jpg","5":"30db340bf0e6a22f5f68c148e5123639-5.jpg","6":"30db340bf0e6a22f5f68c148e5123639-6.jpg"}},"configuration":{},"availability":{"1411003":{"aditional_price":0,"availabile":104}}}
