{"viewData":{"url_key":"hp_4tb35ut_aba_zb15v_g5_i5_8300h_8gb","name":"HP 15.6\" ZBook 15v G5 Mobile Workstation","sku":"1415380","price":"799.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ZBook 15v G5 Mobile Workstation featuring 2.3 GHz Intel Core i5-8300H Quad-Core, 8GB DDR4 RAM | 1TB 7200 rpm Hybrid Drive 15.6&quot; 1920 x 1080 Anti-Glare IPS Display. Review HP 15v G5","long_description":"The 15.6\" ZBook 15v G5 Mobile Workstation from HP is a high-performance system that has been built to supercharge and optimize your workflows. It is powered by a 2.3 GHz Intel Core i5-8300H Quad-Core processor and 8GB of 2666 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 4.0 GHz using Intel's Turbo Boost 2.0 technology. While the current memory configuration is 1 x 8GB, it can be upgraded to a maximum of 32GB by using one 16GB module in each of the 260-pin SO-DIMM slots. The 15.6\" Anti-Glare UWVA IPS display features a Full HD 1920 x 1080 screen resolution, a 16:9 aspect ratio, LED-backlighting, a brightness of 220 cd/m2, a contrast ratio of 600:1, 141 ppi, and viewing angles of 85/85/85/85°. The integrated Intel UHD Graphics 630 chipset delivers a sharp, clear picture, and you'll be able to output video to an external display using the system's HDMI 2.0 port, as well as DisplayPort 1.2 via Thunderbolt 3. For storage of your files, this system is equipped with a 1TB 7200 rpm SATA 2.5\" hybrid hard drive with an 8GB cache, and there are also two empty M.2 2280 slots available for SATA or PCIe SSDs. If you want to add external storage, optical drives, memory card readers, printers, and more, the ZBook 15v G5 offers one Thunderbolt 3 port, which supports 10 Gb/s USB 3.1 Gen 2 and PCIe 3.0, and three USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port. Gigabit Ethernet and Wi-Fi 5 (802.11ac 2x2) are built-in for wired and wireless networking, and Bluetooth 5.0 technology will also allow you to connect additional compatible peripherals wirelessly, such as keyboards, mice, and headsets. Content from memory cards may be accessed via a built-in SD/SDHC/SDXC card reader that supports UHS-II flash media. Other integrated features include dual-array microphones, stereo speakers with Bang & Olufsen HD audio, and a 720p webcam. HP's 15.6\" ZBook 15v G5 includes a 120W AC adapter and a 3-cell / 52.5Wh lithium-ion polymer battery that supports HP Fast Charge and will recharge up to 90% in 90 minutes. The installed operating system is Windows 10 Pro (64-bit) and also included is recovery media. Protection is provided by a limited 1-year parts & labor warranty.","images":{"0":"5553f65f6f5d436b5c0be3172bfe99c5-0.jpg","1":"5553f65f6f5d436b5c0be3172bfe99c5-1.jpg","2":"5553f65f6f5d436b5c0be3172bfe99c5-2.jpg","3":"5553f65f6f5d436b5c0be3172bfe99c5-3.jpg","4":"5553f65f6f5d436b5c0be3172bfe99c5-4.jpg","5":"5553f65f6f5d436b5c0be3172bfe99c5-5.jpg","6":"5553f65f6f5d436b5c0be3172bfe99c5-6.jpg","7":"5553f65f6f5d436b5c0be3172bfe99c5-7.jpg","8":"5553f65f6f5d436b5c0be3172bfe99c5-8.jpg","9":"5553f65f6f5d436b5c0be3172bfe99c5-9.jpg"}},"configuration":{},"availability":{"1415380":{"aditional_price":0,"availabile":397}}}
