{"viewData":{"url_key":"hp_4nh71ut_aba_zb15v_g5_i7_8850h_16gb","name":"HP 15.6\" ZBook 15v G5 Multi-Touch Mobile Workstation","sku":"1415388","price":"1,549.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ZBook 15v G5 Multi-Touch Mobile Workstation featuring 2.6 GHz Intel Core i7-8850H Six-Core, 16GB DDR4 RAM | 512GB PCIe SSD 15.6&quot; 1920 x 1080 BrightView Touchscreen. Review HP 15v G5","long_description":"The 15.6\" ZBook 15v G5 Multi-Touch Mobile Workstation from HP is a high-performance system that has been built to supercharge and optimize your workflows. It is powered by a 2.6 GHz Intel Core i7-8850H Six-Core processor and 16GB of 2666 MHz DDR4 RAM, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 4.3 GHz using Intel's Turbo Boost 2.0 technology. While the current memory configuration is 1 x 16GB, it can be upgraded to a maximum of 32GB by using one 16GB module in each of the 260-pin SO-DIMM slots. The 15.6\" BrightView UWVA IPS display features a Full HD 1920 x 1080 screen resolution, a 16:9 aspect ratio, LED-backlighting, a brightness of 250 cd/m2, a contrast ratio of 400:1, 141 ppi, and viewing angles of 45/45/35/25°. The display is protected by Corning Gorilla Glass 4 and also features multi-touch functionality, allowing you to utilize the touch gestures and functions in Windows 10 Pro to further improve accessibility and productivity. The dedicated NVIDIA Quadro P600 graphics card has 4GB of discrete GDDR5 RAM and delivers a sharp, clear picture. You'll also be able to output video to an external display using the system's HDMI 2.0 port, as well as DisplayPort 1.2 via Thunderbolt 3. For storage of your files, this system is equipped with a 512GB NVMe PCIe M.2 SSD, and there is also an empty 2.5\" / 7mm SATA drive bay available for additional internal storage, plus an empty M.2 2280 slot that supports SATA and PCIe SSDs. If you want to add external storage, optical drives, memory card readers, printers, and more, the ZBook 15v G5 offers one Thunderbolt 3 port, which supports 10 Gb/s USB 3.1 Gen 2 and PCIe 3.0, and three USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port. Gigabit Ethernet and Wi-Fi 5 (802.11ac 2x2) are built-in for wired and wireless networking, and Bluetooth 5.0 technology will also allow you to connect additional compatible peripherals wirelessly, such as keyboards, mice, and headsets. Content from memory cards may be accessed via a built-in SD/SDHC/SDXC card reader that supports UHS-II flash media. Other integrated features include dual-array microphones, stereo speakers with Bang & Olufsen HD audio, and a 1080p IR webcam for face authentication with Windows Hello. HP's 15.6\" ZBook 15v G5 includes a 150W AC adapter and a 3-cell / 52.5Wh lithium-ion polymer battery that supports HP Fast Charge and will recharge up to 90% in 90 minutes. The installed operating system is Windows 10 Pro (64-bit) and also included is recovery media. Protection is provided by a limited 1-year parts & labor warranty.","images":{"0":"973b08e663148ca418d205f9d4fef763-0.jpg","1":"973b08e663148ca418d205f9d4fef763-1.jpg","2":"973b08e663148ca418d205f9d4fef763-2.jpg","3":"973b08e663148ca418d205f9d4fef763-3.jpg","4":"973b08e663148ca418d205f9d4fef763-4.jpg","5":"973b08e663148ca418d205f9d4fef763-5.jpg","6":"973b08e663148ca418d205f9d4fef763-6.jpg","7":"973b08e663148ca418d205f9d4fef763-7.jpg","8":"973b08e663148ca418d205f9d4fef763-8.jpg","9":"973b08e663148ca418d205f9d4fef763-9.jpg"}},"configuration":{},"availability":{"1415388":{"aditional_price":0,"availabile":326}}}
