{"viewData":{"url_key":"hp_4tk14ut_aba_15_6_zbook_15_g3","name":"HP 15.6\" ZBook 15 G3 Mobile Workstation","sku":"1416806","price":"1,699.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; ZBook 15 G3 Mobile Workstation featuring Designed for the Creative Professional, 2.8 GHz Intel Xeon E3-1505M v5 Quad-Core 16GB of 2133 MHz DDR4 ECC RAM. Review HP 15 G3","long_description":"Thin at 1.0\" and weighing 5.7 lb, the 15.6\" ZBook G3 Mobile Workstation from HP is designed for mobile professionals who require a versatile system with powerful processing and graphics as well as simple scalability that can handle a wide variety of functions. The ZBook Studio G3 will help users stay productive, whether they are at home, at the office, or in the field, and it is powered by a 2.8 GHz Intel Xeon E3-1505M v5 Quad-Core processor that allows you to run multiple applications simultaneously. Using Intel Turbo Boost 2.0 technology, the processor is capable of boosting to 3.7 GHz if more power is needed. The 16GB of 2133 MHz DDR4 ECC RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently-used files and programs. The current memory configuration is 2 x 8GB 260-pin SO-DIMM memory modules with two additional slots that are available for memory upgrades. With all four slots in use, this system can support 64GB, or 16GB per slot. The 15.6\" UWVA anti-glare display features an Ultra HD 3840 x 2160 native resolution. The Ultra HD display also features IPS technology, LED-backlighting, and a 16:9 aspect ratio. The dedicated NVIDIA Quadro M2000M graphics card has 4GB of discrete GDDR5 RAM and delivers a sharp, clear picture. You'll also be able to output video to an external display at resolutions up to 5120 x 2880 using the system's HDMI and dual Thunderbolt 3 ports. For storage of your files, this ZBook G3 is equipped with a 256GB Z Turbo Drive PCIe SSD which offers quick access to your data. While the SSD may not have the larger storage capacity of a traditional spinning disk, it contains no moving parts, which helps it to be more resistant against bumps, drops, and other kinds of damage. SSDs also receive less wear and tear than traditional hard drives, as they never come into contact with read and write heads. Additionally, as this SSD connects via PCIe as compared to SATA, it is able to operate with even greater data transfer speeds. It provides sequential reads up to 2150 MB/s and sequential writes up to 1260 MB/s. If you want to add external storage, optical drives, memory card readers, and more, the ZBook Studio G3 offers two USB Type-C connectors that support 40 Gb/s Thunderbolt 3 and 10 Gb/s USB 3.1. There are also two 5 Gb/s USB 3.0 Type-A ports and one USB 3.0 Type-A charging port. Gigabit Ethernet and 802.11ac Wi-Fi are also built-in for wired and wireless networking and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. So that content from memory cards may be accessed, a built-in SD/SDHC/SDXC card reader supports UHS-II flash media and lets users download content from their digital camera. Other integrated features include stereo speakers with Bang & Olufsen HD audio. The ZBook G3 includes a 150W Slim Smart AC adapter and is also able to operate using an HP Long Life 9-cell / 90Wh Lithium-ion polymer battery that can last for up to 15.75 hours before recharging is required. The installed operating system is Windows 10 Pro (64-bit). B&H Photo is an authorized HP reseller with professional in-house technicians available for upgrades & installations on these workstations and laptops. Built with power and speed in mind, the Z Series is designed to enhance audio and video post-production workflows and more. Each HP Z series workstation or laptop features a range of top-tier processors and large RAM loadouts. The workstations are built with graphics flexibility in mind as well so that the end consumer can configure the graphics options to their needs, and each unit includes a 3/3/3 warranty – 3-year limited warranty for parts, 3-year limited warranty for labor, and 3 years of repairs performed at customer site for those parts not eligible for Customer Self Repair (CSR). For 24/7 customer service, please call 1-866-625-1175.","images":{"0":"4f98b0e6fbe0c4ce6dac255f5154f30f-0.jpg","1":"4f98b0e6fbe0c4ce6dac255f5154f30f-1.jpg","2":"4f98b0e6fbe0c4ce6dac255f5154f30f-2.jpg","3":"4f98b0e6fbe0c4ce6dac255f5154f30f-3.jpg","4":"4f98b0e6fbe0c4ce6dac255f5154f30f-4.jpg","5":"4f98b0e6fbe0c4ce6dac255f5154f30f-5.jpg"}},"configuration":{},"availability":{"1416806":{"aditional_price":0,"availabile":871}}}
