{"viewData":{"url_key":"hp_3we38ua_aba_om17_an120nr_i7_8750h_2_2ghz_16gb","name":"HP 17.3\" OMEN 17-an120nr Laptop","sku":"1416324","price":"1,319.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 17.3&quot; OMEN 17-an120nr Laptop featuring 2.2 GHz Intel Core i7-8750H Six-Core, 16GB DDR4 RAM | 128GB SSD + 1TB HDD 17.3&quot; 1920 x 1080 IPS Display (144 Hz). Review HP ","long_description":"Equipped with powerful hardware and an aggressive design, the 17.3\" OMEN 17-an120nr Notebook from HP takes mobile performance seriously, making it easy to conquer in-game challenges. This system is powered by a 2.2 GHz Intel Core i7-8750H Six-Core processor, allowing you to run multiple applications simultaneously. If you need more power, the CPU can be overclocked to 4.1 GHz. The system's 16GB of 2666 MHz DDR4 RAM, which is user accessible, allows the computer to quickly access frequently used files and programs. The 17.3\" Full HD IPS anti-glare display has a 1920 x 1080 native resolution, a refresh rate of 144 Hz, NVIDIA G-Sync technology, WLED-backlighting, a 16:9 aspect ratio, and viewing angles of 178°. The dedicated NVIDIA GeForce GTX 1060 graphics card has 6GB of dedicated GDDR5 video memory and delivers a sharp, clear picture. You'll also be able to output video to an external display via the integrated HDMI 2.0 and mini DisplayPort outputs, as well as DisplayPort 1.2 via USB Type-C. For storage of your files, there is a 128GB NVMe PCIe M.2 SSD and a 1TB 7200 rpm SATA hard drive, both of which provide quick access to your data with a total storage capacity of 1.128TB. While the SSD may not have the larger capacity of the traditional spinning hard drive, it contains no moving parts and thus is more durable in the event of accidental shock damage. The SSD will also receive much less wear and tear because there are no read or write heads like those used with traditional hard drives. Whether you are listening to music, watching a movie, or playing a game, the dual speakers with Bang & Olufsen audio deliver high fidelity. Use the dual-array digital microphones to record your own audio, or use them alongside the 720p Wide Vision HD webcam, with viewing angles of 88°, to engage in face-to-face conversations using Skype or other software. The OMEN 17-an120nr includes a 230W AC adapter and an 8-cell / 86Wh lithium-ion that will provide up to 6.75 hours of use before recharging is needed. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"822f8490391b3b11ca8a7b2059389025-0.jpg","1":"822f8490391b3b11ca8a7b2059389025-1.jpg","2":"822f8490391b3b11ca8a7b2059389025-2.jpg"}},"configuration":{},"availability":{"1416324":{"aditional_price":0,"availabile":707}}}
