{"viewData":{"url_key":"hp_4su69ut_aba_elitebook_x360_1030_g3_i5_8250u","name":"HP 13.3\" EliteBook x360 1030 G3 Multi-Touch 2-in-1 Notebook (Wi-Fi + 4G LTE)","sku":"1425667","price":"1,749.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 13.3&quot; EliteBook x360 1030 G3 Multi-Touch 2-in-1 Notebook (Wi-Fi + 4G LTE) featuring 1.6 GHz Intel Core i5-8250U Quad-Core, 8GB of LPDDR3 RAM | 256GB SATA SSD 13.3&quot; 1920 x 1080 Sure View Touchscreen. Review HP x360 1030 G3","long_description":"Create and present your vision of success on the 13.3\" EliteBook x360 1030 G3 Multi-Touch 2-in-1 Notebook from HP, which offers 360째 of versatility across four usage modes to get work done, share content, and enjoy some downtime. This system is powered by a 1.6 GHz Intel Core i5-8250U Quad-Core processor, which allows you to run multiple applications simultaneously. When running demanding tasks, the processor can increase to a max clock speed of 3.4 GHz using Intel Turbo Boost 2.0 technology. The 8GB of 2133 MHz LPDDR3 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. Please note that the memory is soldered down and cannot be upgraded. The 13.3\" UWVA IPS Sure View anti-glare display features a Full HD 1920 x 1080 resolution, a 16:9 aspect ratio, a typical contrast ratio of 600:1, a refresh rate of 120 Hz, 700 cd/m2 brightness, viewing angles of 85/85/85/85째, an integrated privacy screen, and multi-touch functionality that is protected by Corning Gorilla Glass. The built-in multi-touch functionality allows you to utilize the touch features and functions in Windows 10 Pro to further improve accessibility and productivity. Integrated Intel UHD Graphics 620 delivers a sharp, clear picture, and you'll also be able to output video to an external display using the HDMI 1.4 output and DisplayPort 1.2 technology built into the system's Thunderbolt 3 controller. For long-term storage of your files, the EliteBook x360 1030 G3 is equipped with a 256GB Opal 2 SED SATA III M.2 SSD. If you want to add external storage, optical drives, memory card readers, printers, and more, the EliteBook x360 1030 G3 offers two 40 Gb/s Thunderbolt 3 connectors, which also support 10 Gb/s USB 3.1 Gen 2, as well as one 5 Gb/s USB 3.1 Gen 1 Type-A port, which doubles as a charging port. Network connectivity may be achieved using 802.11ac dual-band Wi-Fi, or take advantage of Gigabit Ethernet for connecting to a wired network using the included USB Type-C to RJ45 cable. If you don't have access to Wi-Fi or Ethernet, there is an Intel XMM 7360 LTE-Advanced WWAN module that provides broadband connectivity when paired with an appropriate service plan. Bluetooth 4.2 technology allows you to connect additional compatible peripherals, a 1080p webcam, an IR camera for face-detection security and system unlocking via Windows Hello, a touch fingerprint sensor for fingerprint authentication, NFC, a three-microphone array, and a four-speaker audio system with discrete amps by Bang & Olufsen. The 13.3\" EliteBook x360 1030 G3 Multi-Touch 2-in-1 Notebook includes a 3.3' power cord, a 65W USB Type-C AC adapter that operates using 100-240 VAC @ 48-63 Hz, and a 4-cell / 56.2Wh lithium-ion battery that lasts for up to 18 hours before recharging is required. The installed operating system is Windows 10 Professional (64-bit) and protection is provided by a limited 3-year parts & labor warranty. Please note that when working in privacy mode, the contrast ratio, screen brightness, color gamut coverage, and viewing angles are all reduced. The contrast ratio drops from 600:1 to 150:1, screen brightness is reduced from 700 cd/m2 to 320 cd/m2, color gamut coverage is reduced from 72% to 60%, and viewing angles narrow from 85/85/85/85째 to 50/50/85/85째.","images":{"0":"28e36ec3a42e82a8a0c51da46dae39b8-0.jpg","1":"28e36ec3a42e82a8a0c51da46dae39b8-1.jpg","2":"28e36ec3a42e82a8a0c51da46dae39b8-2.jpg","3":"28e36ec3a42e82a8a0c51da46dae39b8-3.jpg","4":"28e36ec3a42e82a8a0c51da46dae39b8-4.jpg","5":"28e36ec3a42e82a8a0c51da46dae39b8-5.jpg","6":"28e36ec3a42e82a8a0c51da46dae39b8-6.jpg","7":"28e36ec3a42e82a8a0c51da46dae39b8-7.jpg","8":"28e36ec3a42e82a8a0c51da46dae39b8-8.jpg"}},"configuration":{},"availability":{"1425667":{"aditional_price":0,"availabile":690}}}
