{"viewData":{"url_key":"dell_aw17r5_7390slv_pca_alienware_17_17_3_r5","name":"Dell 17.3\" Alienware 17 R5 Laptop","sku":"1427329","price":"1,999.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 17.3&quot; Alienware 17 R5 Laptop featuring 2.2 GHz Intel Core i7-8750H Six-Core, 16GB DDR4 | 128GB SSD + 1TB HDD 17.3&quot; 1920 x 1080 60 Hz IPS. Review Dell 17 R5","long_description":"Crafted for immersive, high-definition gaming and VR applications, the 17.3\" Alienware 17 R5 Laptop from Dell balances power and portability. It is equipped with a 1920 x 1080 IPS display with 300 cd/m2 brightness, a 60 Hz refresh rate, wide viewing angles, and an NVIDIA GeForce GTX 1070 graphics card. With a dedicated graphics card, you'll be able to crank up in-game visual settings and enable additional graphical eye-candy options to enjoy your games at their best. Balancing out the rest of the system is a 2.2 GHz Intel Core i7-8750H processor and 16GB of 2400 MHz DDR4 RAM that'll allow you to efficiently multitask and quickly access frequently used files and programs.  For storage, the Alienware 17 R5 has a 128GB PCIe M.2 SSD and a 1TB 7200 rpm SATA III 2.5\" hard drive, which deliver a total storage capacity of 1.128TB. If you want to take advantage of external storage or connect peripherals such as optical drives, memory card readers, printers, and more, this can be done using one USB 3.1 Gen 2 Type-C port, two USB 3.1 Gen 1 Type-A ports, one of which features PowerShare technology, and one Thunderbolt 3 port, which also supports USB 3.1 Gen 2. Furthermore, using its HDMI 2.0, mini-DisplayPort 1.3, and Thunderbolt 3 ports, you can connect external displays for extensive multitasking. Other integrated features include a Full HD webcam, Gigabit Ethernet, 802.11ac Wi-Fi, Bluetooth 5.0, a headphone/mic combo jack, a headset jack, stereo speakers, and Alienware's TactX keyboard with N-key rollover, 9 user-programmable keys, and 4-zone, multi-color RGB-LED AlienFX lighting. Included is a power adapter and a 6-cell / 99Wh lithium-ion battery. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"8d73150bdd566b86d085a7fd0ed9478c-0.jpg","1":"8d73150bdd566b86d085a7fd0ed9478c-1.jpg","2":"8d73150bdd566b86d085a7fd0ed9478c-2.jpg","3":"8d73150bdd566b86d085a7fd0ed9478c-3.jpg","4":"8d73150bdd566b86d085a7fd0ed9478c-4.jpg","5":"8d73150bdd566b86d085a7fd0ed9478c-5.jpg","6":"8d73150bdd566b86d085a7fd0ed9478c-6.jpg","7":"8d73150bdd566b86d085a7fd0ed9478c-7.jpg","8":"8d73150bdd566b86d085a7fd0ed9478c-8.jpg","9":"8d73150bdd566b86d085a7fd0ed9478c-9.jpg"}},"configuration":{},"availability":{"1427329":{"aditional_price":0,"availabile":272}}}
