{"viewData":{"url_key":"acer_nx_vchaa_019_n3060_4gb_64gb_w10_11_6","name":"Acer 11.6\" TravelMate B1 TMB117-M-C012 Laptop","sku":"1429719","price":"195.99","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Acer 11.6&quot; TravelMate B1 TMB117-M-C012 Laptop featuring 1.6 GHz Intel Celeron N3060 Dual-Core, 4GB DDR3L SDRAM 64GB eMMC Flash Storage. Review Acer B1","long_description":"The 11.6\" TravelMate B1 TMB117-M-C012 Laptop from Acer is equipped with a 1.6 GHz Intel Celeron N3060 dual-core processor and 4GB of DDR3L SDRAM for efficient multitasking and everyday tasks. In terms of storing your files, the TravelMate has 64GB of onboard eMMC flash storage.  If you find yourself needing more room, you can attach an external storage solution using either its USB 3.1 Gen 1 or USB 2.0 Type-A ports. There's also a SD card slot reader built in, so you can review your captured photos and videos or transfer files across systems.  The TravelMate sports an 11.6\" display that's driven by an integrated Intel HD Graphics 400 chipset. The 1366 x 768 LCD display provides wide viewing angles and vivid colors. If you wish to extend the TravelMate's display onto an external monitor, you can do so with its built-in HDMI port. Other integrated features include Wi-Fi 5 (802.11ac), onboard Bluetooth, a microphone, dual stereo speakers, and a 3.5mm combo audio jack. The operating system installed is Windows 10 Pro.","images":{"0":"87920567a5ca25cf81a0450640c35c62-0.jpg","1":"87920567a5ca25cf81a0450640c35c62-1.jpg","2":"87920567a5ca25cf81a0450640c35c62-2.jpg","3":"87920567a5ca25cf81a0450640c35c62-3.jpg","4":"87920567a5ca25cf81a0450640c35c62-4.jpg","5":"87920567a5ca25cf81a0450640c35c62-5.jpg","6":"87920567a5ca25cf81a0450640c35c62-6.jpg","7":"87920567a5ca25cf81a0450640c35c62-7.jpg","8":"87920567a5ca25cf81a0450640c35c62-8.jpg","9":"87920567a5ca25cf81a0450640c35c62-9.jpg","10":"87920567a5ca25cf81a0450640c35c62-10.jpg","11":"87920567a5ca25cf81a0450640c35c62-11.jpg","12":"87920567a5ca25cf81a0450640c35c62-12.jpg"}},"configuration":{},"availability":{"1429719":{"aditional_price":0,"availabile":402}}}
