{"viewData":{"url_key":"acer_nx_gxzaa_010_swift_3_sf314_54_54vt_i5_8250u","name":"Acer 14\" Swift 3 Laptop","sku":"1432507","price":"549.99","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Acer 14&quot; Swift 3 Laptop featuring 1.6 GHz Intel Core i5-8250U Quad-Core, 8GB | 1TB HDD 14&quot; FHD 1920 x 1080 IPS Display. Review Acer ","long_description":"The 14\" Swift 3 Laptop from Acer features a compact chassis that is powered by a 1.6 GHz Intel Core i5-8250U processor along with 8GB of DDR4 RAM and a 1TB HDD, providing desktop-like computing performance while traveling. This level of performance lets you efficiently multitask and quickly access files and programs, and when handling a heavier workload is required, each of the processor's four cores can reach a max turbo frequency of 3.4 GHz. Windows 10 Home is the preinstalled operating system and occupies a portion of the HDD's 1TB storage capacity. Should you need more storage space, you can connect an external storage solution to one of the notebook's multiple USB ports, one of which is a convenient USB Type-C port. The Swift 3 notebook comes armed with an 14\" IPS display that provides wide viewing angles and vivid colors with a 1920 x 1080 resolution, which is powered by integrated Intel UHD graphics. For expanding the onscreen workspace, an HDMI port lets the system access an external display. Accessing the Internet can be accomplished wirelessly via Wi-Fi 5 (802.11ac). There's also a Gigabit Ethernet port for reliable access to the Internet. Other integrated features include a pair of speakers, webcam, microphone, 3.5mm audio jack, and SD card reader for quickly transferring files from mobile devices. Additionally, a fingerprint reader is on board for quickly accessing the system without typing a password on the notebook's backlit keyboard.","images":{"0":"3be764797f9787bdf5bcaf64ddb43ca2-0.jpg","1":"3be764797f9787bdf5bcaf64ddb43ca2-1.jpg","2":"3be764797f9787bdf5bcaf64ddb43ca2-2.jpg","3":"3be764797f9787bdf5bcaf64ddb43ca2-3.jpg","4":"3be764797f9787bdf5bcaf64ddb43ca2-4.jpg","5":"3be764797f9787bdf5bcaf64ddb43ca2-5.jpg","6":"3be764797f9787bdf5bcaf64ddb43ca2-6.jpg","7":"3be764797f9787bdf5bcaf64ddb43ca2-7.jpg"}},"configuration":{},"availability":{"1432507":{"aditional_price":0,"availabile":935}}}
