{"viewData":{"url_key":"acer_nx_gvzaa_007_aspire_1_n5000_1_1ghz","name":"Acer 14\" Aspire 1 Laptop (Black)","sku":"1432537","price":"269.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Acer 14&quot; Aspire 1 Laptop (Black) featuring Intel Pentium Silver N5000 Quad-Core, 4GB DDR4 | 64GB eMMC Flash Storage 14&quot; 1366 x 768 IPS Display. Review Acer ","long_description":"The 14\" Aspire 1 Laptop from Acer is designed to tackle everyday tasks such as browsing the internet, composing and editing documents, and streaming online videos. Specs-wise, the Aspire 1 is equipped with a 1.1 GHz Intel Pentium Silver N5000 quad-core processor, 4GB of DDR4 RAM, and 64GB of onboard eMMC flash storage. Should you need more space, you can attach external storage solutions using its single USB 3.1 Gen 1 Type-A port, two USB 2.0 Type-A ports, and SD card reader.In terms of visuals, the Aspire 1 has a 14\" display that's equipped with a 1366 x 768 resolution and an IPS panel that offers vivid colors and wide viewing angles. Furthermore, this notebook has an integrated Intel UHD Graphics 605 chipset onboard that can handle light multimedia-based tasks and gaming. If you need to extend the Aspire 1's display to an external monitor, you can do so with its built-in HDMI port. Other integrated features include a 640 x 480 webcam, high-definition audio support, two built-in stereo speakers, a digital microphone, a 3.5mm combination audio jack, Wi-Fi 5 (802.11ac), a Gigabit Ethernet port, and Bluetooth 4.1. The operating system installed on the Aspire 1 is Windows 10 S, which is designed to enhance student workflows. Moreover, the Aspire 1 can remain powered with its included AC adapter and power cord.","images":{"0":"f9bac2b52eacc86ef2bc67f85d3f80bc-0.jpg","1":"f9bac2b52eacc86ef2bc67f85d3f80bc-1.jpg","2":"f9bac2b52eacc86ef2bc67f85d3f80bc-2.jpg","3":"f9bac2b52eacc86ef2bc67f85d3f80bc-3.jpg","4":"f9bac2b52eacc86ef2bc67f85d3f80bc-4.jpg","5":"f9bac2b52eacc86ef2bc67f85d3f80bc-5.jpg","6":"f9bac2b52eacc86ef2bc67f85d3f80bc-6.jpg","7":"f9bac2b52eacc86ef2bc67f85d3f80bc-7.jpg","8":"f9bac2b52eacc86ef2bc67f85d3f80bc-8.jpg"}},"configuration":{},"availability":{"1432537":{"aditional_price":0,"availabile":742}}}
