{"viewData":{"url_key":"acer_nx_h0uaa_005_spin_1_n4000_4gb","name":"Acer 11.6\" 64GB Multi-Touch 2-in-1 Spin 1 Laptop","sku":"1432536","price":"249.99","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Acer 11.6&quot; 64GB Multi-Touch 2-in-1 Spin 1 Laptop featuring 1.1 GHz Intel Celeron N4000 Dual-Core, 4GB LPDDR4 RAM | 64GB eMMC Flash Storage 11.6&quot; 1366 x 768 Multi-Touch IPS Display. Review Acer ","long_description":"The 11.6\" 64GB Multi-Touch 2-in-1 Spin 1 Laptop from Acer features a 360° hinge, which lets you adjust it into four different viewing modes to best suit your needs. The notebook is equipped with a 1.1 GHz Intel Celeron N4000 dual-core processor and 4GB of LPDDR4 RAM for efficient multitasking and everyday tasks. In terms of storing your files, the Spin 1 has 64GB of onboard eMMC flash storage. If you find yourself needing more room, you can attach an external storage solution using either its USB 3.0 or USB 2.0 Type-A ports. There's also a microSD card slot reader built-in, so you can review your captured photos and videos or transfer files across systems.The Spin 1 sports an 11.6\" display that's driven by an integrated Intel UHD Graphics 600 chipset. The 1366 x 768 IPS display provides wide viewing angles and vivid colors. Moreover, the screen supports multi-touch inputs, so you can utilize touch gestures and commands to enhance your usage. If you wish to extend the Spin 1's display onto an external monitor, you can do so with its built-in HDMI port. Other integrated features include Wi-Fi 5 (802.11ac), a microphone, dual stereo speakers, and a 3.5mm combo audio jack. The operating system installed is Windows 10 S, which is designed to maximize student workflows.","images":{"0":"ef52d6be2710e00866c34b207444fcfc-0.jpg","1":"ef52d6be2710e00866c34b207444fcfc-1.jpg","2":"ef52d6be2710e00866c34b207444fcfc-2.jpg","3":"ef52d6be2710e00866c34b207444fcfc-3.jpg","4":"ef52d6be2710e00866c34b207444fcfc-4.jpg","5":"ef52d6be2710e00866c34b207444fcfc-5.jpg","6":"ef52d6be2710e00866c34b207444fcfc-6.jpg","7":"ef52d6be2710e00866c34b207444fcfc-7.jpg","8":"ef52d6be2710e00866c34b207444fcfc-8.jpg","9":"ef52d6be2710e00866c34b207444fcfc-9.jpg"}},"configuration":{},"availability":{"1432536":{"aditional_price":0,"availabile":837}}}
