{"viewData":{"url_key":"lenovo_20mas1tq00_p52_i7_8550h_32gb_512gb","name":"Lenovo 15.6\" ThinkPad P52 Mobile Workstation","sku":"1435125","price":"2,399.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; ThinkPad P52 Mobile Workstation featuring 2.6 GHz Intel Core i7-8850H Six-Core, 32GB DDR4 | 512GB NVMe SSD + 2TB HDD NVIDIA Quadro P3200 (6GB GDDR5). Review Lenovo P52","long_description":"The 15.6\" ThinkPad P52 Mobile Workstation from Lenovo is created for designers, engineers, and artists who require the power of a workstation with laptop mobility. It's powered by a 2.6 GHz Intel Core i7-8850H Six-Core processor, 32GB of 2400 MHz DDR4 RAM, and an NVIDIA Quadro P3200 graphics card. Thanks to its dedicated GPU, this system can handle creating, editing, and experiencing 3D and VR content. For storage, it's equipped with a 512GB PCIe NVMe Opal 2 SSD and a 2TB 5400 rpm HDD. If you need more space, you can connect external storage solutions using its three USB 3.1 Gen 1 Type-A ports, two Thunderbolt 3 / USB Type-C ports, and media card reader that supports UHS-II SD/SDHC/SDXC and MMC cards. The P52's storage can also be expanded internally, as there are a total of three drive bays - two NVMe PCIe 3.0 x4 M.2 and one SATA III 2.5\" / 7mm. Its 15.6\" display features a 1920 x 1080 resolution and is built with an anti-glare IPS panel to deliver wide viewing angles of 160°/160°, a brightness of 300 cd/m2, and vivid colors. Moreover, the ThinkPad P52 has HDMI 2.0 and mini DisplayPort 1.4 outputs you can use with a separate display for larger viewing. It can connect to the internet wirelessly using dual-band Wi-Fi 5 (802.11ac) or its Gigabit Ethernet port for a more stable and reliable connection. Additionally, it has Bluetooth 5.0 built-in, which lets you pair compatible wireless peripherals to free up its USB ports for more important devices. Other integrated features include a 720p webcam, dual-array microphones, two 2W speakers with Dolby Audio Premium, a backlit keyboard, and a combo audio jack. Its 6-cell / 90Wh battery will last for up to 6.1 hours when running discrete graphics or up to 8.9 hours with hybrid graphics, or use the included 170W AC adapter for continuous power while plugged in. The operating system installed is Windows 10 Pro (64-Bit).","images":{"0":"872c2b2c0e49319947742909a3f5dfe1-0.jpg","1":"872c2b2c0e49319947742909a3f5dfe1-1.jpg","2":"872c2b2c0e49319947742909a3f5dfe1-2.jpg","3":"872c2b2c0e49319947742909a3f5dfe1-3.jpg","4":"872c2b2c0e49319947742909a3f5dfe1-4.jpg","5":"872c2b2c0e49319947742909a3f5dfe1-5.jpg","6":"872c2b2c0e49319947742909a3f5dfe1-6.jpg","7":"872c2b2c0e49319947742909a3f5dfe1-7.jpg","8":"872c2b2c0e49319947742909a3f5dfe1-8.jpg","9":"872c2b2c0e49319947742909a3f5dfe1-9.jpg","10":"872c2b2c0e49319947742909a3f5dfe1-10.jpg","11":"872c2b2c0e49319947742909a3f5dfe1-11.jpg","12":"872c2b2c0e49319947742909a3f5dfe1-12.jpg","13":"872c2b2c0e49319947742909a3f5dfe1-13.jpg","14":"872c2b2c0e49319947742909a3f5dfe1-14.jpg","15":"872c2b2c0e49319947742909a3f5dfe1-15.jpg","16":"872c2b2c0e49319947742909a3f5dfe1-16.jpg","17":"872c2b2c0e49319947742909a3f5dfe1-17.jpg","18":"872c2b2c0e49319947742909a3f5dfe1-18.jpg","19":"872c2b2c0e49319947742909a3f5dfe1-19.jpg"}},"configuration":{},"availability":{"1435125":{"aditional_price":0,"availabile":123}}}
