{"viewData":{"url_key":"dell_i3180_a361gry_inspiron_11_3000_3180","name":"Dell 11.6\" Inspiron 11 3000 Series Laptop","sku":"1435132","price":"159.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 11.6&quot; Inspiron 11 3000 Series Laptop featuring 1.6 GHz AMD A6-9220e Dual-Core, 4GB DDR4 RAM | 32GB eMMC Storage 11.6&quot; 1366 x 768 WLED Display. Review Dell 3180","long_description":"Measuring 0.82\" thin and weighing 2.95 pounds, the 11.6\" Inspiron 11 3000 Series Laptop from Dell is powered by a 1.6 GHz AMD A6-9220e Dual-Core processor and 4GB of 2400 MHz DDR4 RAM in a 1 x 4GB configuration, allowing you to run multiple programs simultaneously and quickly access frequently used files and programs. When running more demanding programs or tasks, the processor can be boosted to achieve a speed of 2.4 GHz and the memory can be upgraded to 8GB in a 1 x 8GB configuration.The 11.6\" WLED anti-glare display features an HD resolution of 1366 x 768 for playback of your media content, a 16:9 aspect ratio, a refresh rate of 60 Hz, and viewing angles of 40/40/10/30°. Visuals are handled by the integrated AMD Radeon R4 chipset, and you can output video to an external display using the HDMI port.For storage of your files, this system comes with a 32GB of integrated eMMC flash memory. If you want to add external storage, optical drives, mice, keyboards, printers, memory card readers, and more, this Inspiron 11 3000 offers one USB 3.1 Gen 1 Type-A port and one USB 2.0 Type-A port. Built-in stereo speakers, a microphone, and a 720p webcam let you participate in video calls for work or with friends and family. Connect to the internet via 802.11b/g/n Wi-Fi and to free up USB ports and reduce wire clutter, you can connect additional peripherals and devices using Bluetooth 4.0, while a built-in media card reader supports microSD/SDHC/SDXC formats.Dell's 11.6\" Inspiron 11 3000 Series Laptop operates using an included 45W AC adapter, a power cord, and a 2-cell / 32Wh prismatic battery. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"625c872228dee391906ff4e1e6023ff7-0.jpg","1":"625c872228dee391906ff4e1e6023ff7-1.jpg","2":"625c872228dee391906ff4e1e6023ff7-2.jpg","3":"625c872228dee391906ff4e1e6023ff7-3.jpg","4":"625c872228dee391906ff4e1e6023ff7-4.jpg","5":"625c872228dee391906ff4e1e6023ff7-5.jpg","6":"625c872228dee391906ff4e1e6023ff7-6.jpg"}},"configuration":{},"availability":{"1435132":{"aditional_price":0,"availabile":732}}}
