{"viewData":{"url_key":"dell_i7370_7231slv_pus_insp_7000_i7_8gb_256ssd_w10_13_3","name":"Dell 13.3\" Inspiron 13 7370 Notebook","sku":"1435989","price":"719.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 13.3&quot; Inspiron 13 7370 Notebook featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB of DDR4 RAM | 256GB SSD 13.3&quot; 1920 x 1080 IPS Display. Review Dell 13 7370","long_description":"Designed with a 180° hinge and a thin bezel screen, the 13.3\" Inspiron 13 7370 Notebook from Dell provides expansive views within a compact form factor. This system is powered by a 1.8 GHz Intel Core i7-8550U Quad-Core processor which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 4.0 GHz using Intel Turbo Boost 2.0 technology. The 8GB of 2400 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The memory is integrated and cannot be upgraded. The 13.3\" TrueLife IPS display features a Full HD 1920 x 1080 native resolution that is equipped with LED-backlighting, a 16:9 aspect ratio, viewing angles of 160°, 300 cd/m2 brightness, and a refresh rate of 60 Hz. Integrated Intel UHD Graphics 620 delivers a sharp, clear picture, and you'll be able to output video to an external display using the HDMI port that supports resolutions up to 3840 x 2160 @ 60 fps, plus DisplayPort functionality via USB Type-C. For storage of your files, a 256GB SSD offers quick access to your data. If you want to add external storage drives or other peripherals, the Inspiron 13 7370 features one 5 Gb/s USB 3.1 Gen 1 Type-C port, which provides Power Delivery and DisplayPort output, plus two 5 Gb/s USB 3.1 Gen 1 Type-A ports, one of which doubles as a charging port. 802.11ac Wi-Fi is built-in for wired and wireless networking and Bluetooth 4.2 technology will allow you to connect additional compatible peripherals. Other integrated features include 720p and IR webcams, multi-array microphones, stereo speakers with Waves MaxxAudio Pro, and an SD/SDHC/SDXC card reader. The 13.3\" Inspiron 13 7370 Notebook includes a 45W AC adapter and a 3-cell / 38Wh lithium-ion battery that supports fast charging and can recharge in around 4 hours when the computer is off. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"dd45ce3391e7d8e8db24e4a792ef5d90-0.jpg","1":"dd45ce3391e7d8e8db24e4a792ef5d90-1.jpg","2":"dd45ce3391e7d8e8db24e4a792ef5d90-2.jpg","3":"dd45ce3391e7d8e8db24e4a792ef5d90-3.jpg","4":"dd45ce3391e7d8e8db24e4a792ef5d90-4.jpg"}},"configuration":{},"availability":{"1435989":{"aditional_price":0,"availabile":320}}}
