{"viewData":{"url_key":"dell_i5578_3627gry_pus_insp_5000_i3_4gb_1tb_w10_15_6_t","name":"Dell 15.6\" Inspiron 15 5000 Series 5578 Multi-Touch 2-in-1 Laptop","sku":"1435987","price":"399.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 15.6&quot; Inspiron 15 5000 Series 5578 Multi-Touch 2-in-1 Laptop featuring 2.7 GHz Intel Core i3-7130U Dual-Core, 4GB of DDR4 RAM 1TB 5400 rpm Hard Drive. Review Dell 15 5000","long_description":"The 15.6\" Inspiron 15 5000 Series 5578 Multi-Touch 2-in-1 Laptop from Dell is designed to entertain and get work done with its 2.7 GHz Intel Core i3-7130U dual-core processor and 4GB of 2400 MHz DDR4 RAM that allows you to run multiple applications simultaneously. Furthermore, this system's memory may be upgraded to 32GB, which is aimed to enhance your computer's access to frequently used files and programs, and even helps to ensure efficient multitasking. For long-term storage of your files, the Inspiron 5578 features a 1TB hard drive.In terms of visuals, Dell has equipped this laptop with a 15.6\" IPS touchscreen display with a 1920 x 1080 resolution and 16:9 aspect ratio. Additionally, the Inspiron 5578 has an integrated Intel HD Graphics 620 chipset that delivers a sharp, clear picture, and you'll also be able to output video to an external display using the built-in HDMI output.Connect to external peripherals, such as additional storage, printers, and more may be connected using the two 5 Gb/s USB 3.0 Type-A ports and one 480 Mb/s USB 2.0 port. Access wireless networks and peripherals via Wi-Fi 5 (802.11ac) and Bluetooth 4.1. Whether you are listening to music, watching a movie, or playing a game, the dual integrated stereo speakers feature Waves MaxxAudio and offer high quality sound. There is also a built-in 720p webcam and dual-array microphones that allow you to engage in face-to-face conversations using Skype or other software, and a media card reader that supports SD, SDHC, and SDXC cards.The Inspiron 15 5000 Series 5578 includes a 3-cell, 42Wh battery and a 45W AC adapter. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"d31a649e46b8583748b9f4b28e539522-0.jpg","1":"d31a649e46b8583748b9f4b28e539522-1.jpg","2":"d31a649e46b8583748b9f4b28e539522-2.jpg","3":"d31a649e46b8583748b9f4b28e539522-3.jpg","4":"d31a649e46b8583748b9f4b28e539522-4.jpg","5":"d31a649e46b8583748b9f4b28e539522-5.jpg","6":"d31a649e46b8583748b9f4b28e539522-6.jpg","7":"d31a649e46b8583748b9f4b28e539522-7.jpg","8":"d31a649e46b8583748b9f4b28e539522-8.jpg","9":"d31a649e46b8583748b9f4b28e539522-9.jpg","10":"d31a649e46b8583748b9f4b28e539522-10.jpg","11":"d31a649e46b8583748b9f4b28e539522-11.jpg","12":"d31a649e46b8583748b9f4b28e539522-12.jpg","13":"d31a649e46b8583748b9f4b28e539522-13.jpg","14":"d31a649e46b8583748b9f4b28e539522-14.jpg","15":"d31a649e46b8583748b9f4b28e539522-15.jpg","16":"d31a649e46b8583748b9f4b28e539522-16.jpg"}},"configuration":{},"availability":{"1435987":{"aditional_price":0,"availabile":788}}}
