{"viewData":{"url_key":"hp_4hv07ut_aba_255_g6_a6_9225","name":"HP 15.6\" 255 G6 Series Notebook","sku":"1441164","price":"515.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; 255 G6 Series Notebook featuring 2.6 GHz AMD A6-9225 Dual-Core, 8GB DDR4 RAM | 256GB SATA III M.2 SSD 15.6&quot; 1366 x 768 SVA Anti-Glare Display. Review HP ","long_description":"Equipped for business and ready for the road, the 15.6\" 255 G6 Series Notebook from HP is a durable system that allows users to work confidently. This system is powered by a 2.6 GHz AMD A6-9225 Dual-Core processor which allows you to run multiple applications simultaneously and can be boosted up to 3.0 GHz. The 8GB of 1866 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The internal memory cannot be upgraded. The 15.6\" TN SVA Anti-Glare eDP display features an HD 1366 x 768 resolution, a 16:9 aspect ratio, 220 cd/m2 brightness, a 500:1 contrast ratio, a refresh rate of 60 Hz, 100 ppi, and viewing angles of 45/45/20/40°. Integrated AMD Radeon R4 graphics delivers a sharp, clear picture, and you'll be able to output video to an external display the HDMI 1.4b and VGA outputs. For long-term storage of your files, this system is equipped with a 256GB SATA III TLC M.2 SSD, and there is also an empty 2.5\" bay for additional storage that can accept 7 and 9.5mm drives. If you want to add external storage, optical drives, memory card readers, printers, and more, the 255 G6 offers two USB 3.0 Type-A ports and one USB 2.0 Type-A port. Gigabit Ethernet and 802.11ac dual-band Wi-Fi are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals wirelessly. There is also an SD/SDHC/SDXC card reader, an HP TrueVision HD 720p Wide Dynamic Range webcam, a digital microphone, stereo speakers, and a SuperMulti DVD±RW with dual-layer support. The 255 G6 Series Notebook includes a 45W Smart AC adapter that runs using 115-230 VAC at 47-63 Hz and a 4-cell / 41Wh lithium-ion battery that lasts for up to 7.5 hours before recharging is required. The installed operating system is Windows 10 Pro (64-bit).","images":{"0":"b4b5208e33dad2ae83a3c746a88d38fb-0.jpg","1":"b4b5208e33dad2ae83a3c746a88d38fb-1.jpg","2":"b4b5208e33dad2ae83a3c746a88d38fb-2.jpg","3":"b4b5208e33dad2ae83a3c746a88d38fb-3.jpg","4":"b4b5208e33dad2ae83a3c746a88d38fb-4.jpg"}},"configuration":{},"availability":{"1441164":{"aditional_price":0,"availabile":436}}}
