{"viewData":{"url_key":"lenovo_20md0028us_p1_e_2176m_16gb_1tb","name":"Lenovo 15.6\" ThinkPad P1 Multi-Touch Mobile Workstation","sku":"1442759","price":"2,999.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; ThinkPad P1 Multi-Touch Mobile Workstation featuring 2.7 GHz Intel Xeon E-2176M Six-Core, 16GB DDR4 ECC RAM | 1TB PCIe M.2 SSD 15.6&quot; 3840 x 2160 IPS Touchscreen. Review Lenovo P1","long_description":"Thin at 0.74\" and weighing 4.06 pounds, the 15.6\" ThinkPad P1 Multi-Touch Mobile Workstation from Lenovo delivers power and mobility. It is driven by a 2.7 GHz Intel Xeon E-2176M Six-Core processor which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 4.4 GHz using Intel Turbo Boost technology. The 16GB of 2400 MHz DDR4 ECC RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The 15.6\" IPS display features an Ultra HD 3840 x 2160 screen resolution, 100% Adobe RGB gamut coverage, an anti-glare finish, LED-backlighting, a 16:9 aspect ratio, a contrast ratio of 1200, a brightness of 400 cd/m2, and viewing angles of 170°. The dedicated NVIDIA Quadro P2000 graphics card has 4GB of discrete GDDR5 RAM and delivers a sharp, clear picture. To increase productivity with a multi-monitor setup, you'll be able to output video to an external display at resolutions up to 5120 x 2880. The display also features 10-point multi-touch functionality, allowing you to utilize the touch gestures and functions in Windows 10 Pro to further improve accessibility and productivity. For storage of your files, this ThinkPad P1 is equipped with a 1TB NVMe PCIe M.2 SSD. If you'd like to expand your system's internal storage, there is one additional M.2 slot. Add external storage, optical drives, memory card readers, and more with two 40 Gb/s Thunderbolt 3 ports and two 5 Gb/s USB 3.1 Gen 1 Type-A ports, one of which doubles as an always-on charging port. Gigabit Ethernet (via an Ethernet extension cable) and Wi-Fi 5 (802.11ac) are built-in for wired and wireless networking, and Bluetooth 5.0 technology will allow you to connect additional compatible peripherals. Memory cards may be accessed via a built-in SD/SDHC/SDXC/MMC card reader that supports UHS-II flash media. Other integrated features include 720p & IR webcams, dual-array microphones, and 2W stereo speakers with Dolby Audio Premium. The ThinkPad P1 Mobile Workstation includes a 135W AC adapter, a power cord, and an 80Wh lithium-ion battery that lasts for up to 13.87 hours in hybrid mode and 7.36 hours in discrete before recharging is required. The battery also supports Rapid Charge, allowing it to charge up to 80% in one hour. The installed operating system is Windows 10 Professional for Workstations (64-bit).","images":{"0":"66e9fda2a38b99127ec8b828a3e03974-0.jpg","1":"66e9fda2a38b99127ec8b828a3e03974-1.jpg","2":"66e9fda2a38b99127ec8b828a3e03974-2.jpg","3":"66e9fda2a38b99127ec8b828a3e03974-3.jpg","4":"66e9fda2a38b99127ec8b828a3e03974-4.jpg","5":"66e9fda2a38b99127ec8b828a3e03974-5.jpg","6":"66e9fda2a38b99127ec8b828a3e03974-6.jpg","7":"66e9fda2a38b99127ec8b828a3e03974-7.jpg","8":"66e9fda2a38b99127ec8b828a3e03974-8.jpg","9":"66e9fda2a38b99127ec8b828a3e03974-9.jpg"}},"configuration":{},"availability":{"1442759":{"aditional_price":0,"availabile":616}}}
