{"viewData":{"url_key":"dell_i5570_7337slv_inspiron_15_i7_8550u_8gb","name":"Dell 15.6\" Inspiron 15 5000 Series 5570 Laptop","sku":"1443700","price":"719.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 15.6&quot; Inspiron 15 5000 Series 5570 Laptop featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB DDR4 | 16GB Intel Optane | 1TB HDD 15.6&quot; 1920 x 1080 FHD Display. Review Dell 15 5000","long_description":"Designed to entertain the entire family, the 15.6\" Inspiron 15 5000 Series 5570 Laptop from Dell is powered by a 1.8 GHz Intel Core i7-8550U quad-core processor that allows you to run multiple applications simultaneously. The processor also features a boost speed of up to 4.0 GHz and the system's 8GB of 2400 MHz DDR4 RAM, which may be upgraded to 32, allows the computer to quickly access frequently used files and programs, as well as help to ensure efficient multitasking. The 15.6\" display features a Full HD 1920 x 1080 resolution, a 16:9 aspect ratio, LED backlighting, and viewing angles of 40/40/10/30°. The integrated Intel UHD Graphics 620 chipset delivers a sharp, clear picture, and you'll also be able to output video to an external display using the built-in HDMI 1.4b output. For connecting to the Internet this laptop is equipped with a 10/100 Fast Ethernet port and dual-band Wi-Fi 5 (802.11ac). External peripherals, such as additional storage, printers, and more may be connected using the two 5 Gb/s USB 3.1 Gen 1 Type-A ports and one 480 Mb/s USB 2.0 port. Additional compatible peripherals, such as keyboards, mice, and headsets may be paired using Bluetooth technology.  For long-term storage of your files, the Inspiron 15 5000 features a 16GB Intel Optane module and a 1TB HDD. Whether you are listening to music, watching a movie, or playing a game, the dual integrated stereo speakers feature Waves MaxxAudio Pro and offer high quality sound. There is also a SuperMulti DVD Burner, a built-in 720p webcam and dual-array microphones that allow you to engage in face-to-face conversations using Skype or other software, and a media card reader that supports SD, SDHC, and SDXC cards. The 15.6\" Inspiron 15 5000 Series Laptop includes a 3-cell / 42Wh lithium-ion battery and a 45W AC adapter that operates using 100-240 VAC at 50-60 Hz. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"2e4f31df162266a5c1864925289d0ded-0.jpg","1":"2e4f31df162266a5c1864925289d0ded-1.jpg","2":"2e4f31df162266a5c1864925289d0ded-2.jpg","3":"2e4f31df162266a5c1864925289d0ded-3.jpg","4":"2e4f31df162266a5c1864925289d0ded-4.jpg","5":"2e4f31df162266a5c1864925289d0ded-5.jpg","6":"2e4f31df162266a5c1864925289d0ded-6.jpg","7":"2e4f31df162266a5c1864925289d0ded-7.jpg","8":"2e4f31df162266a5c1864925289d0ded-8.jpg"}},"configuration":{},"availability":{"1443700":{"aditional_price":0,"availabile":661}}}
