{"viewData":{"url_key":"hp_5mp92ua_aba_stream_laptop_11_ah010nr_celeron","name":"HP 11.6\" Stream Laptop 11-ah010nr","sku":"1445373","price":"199.99","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 11.6&quot; Stream Laptop 11-ah010nr featuring 1.6 GHz Intel Celeron N3060 Dual-Core, 4GB DDR3L RAM | 32GB eMMC Storage 11.6&quot; 1366 x 768 SVA Anti-Glare Display. Review HP ","long_description":"Thin at 0.71\" and weighing 2.57 pounds, the 11.6\" Stream Laptop 11-ah010nr from HP delivers productivity and lets you shift from doing homework to marathoning your favorite shows. The system is powered by a 1.6 GHz Intel Celeron N3060 Dual-Core processor, which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 2.48 GHz. The 4GB of 1600 MHz DDR3L RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs. The memory slot is not accessible or upgradable.The 11.6\" SVA anti-glare display features an HD 1366 x 768 native resolution, WLED-backlighting, and a 16:9 aspect ratio. The integrated Intel HD Graphics 400 chipset delivers a sharp, clear picture, and you'll be able to output video to an external display at resolutions using the system's HDMI 1.4b output.For storage of your files, the 11-ah010nr is equipped with 32GB of eMMC storage. If you want to add external storage, optical drives, memory card readers, and more, there is one USB 3.1 Gen 1 Type-A port and one USB 2.0 Type-A port. Wi-Fi 5 (802.11ac) is built-in wireless networking and Bluetooth 4.2 technology will also allow you to connect additional compatible wireless peripherals. A built-in microSD card reader lets users download content from their digital camera and other integrated features include a 720p TrueVision webcam, an integrated digital microphone, and DTS Studio Sound with stereo speakers.HP's 11.6\" Stream Laptop 11-ah010nr includes a 45W AC adapter, and its 2-cell / 37.69Wh lithium-ion polymer battery kicks in when the system isn't plugged in. The installed operating system is Windows 10 Home, which comes with S Mode activated. Protection is provided by a limited 1-year hardware warranty with 90 days of limited technical support for software and setup from the date of purchase.Windows 10 S works exclusively with apps from the Microsoft Store within Windows. Certain default settings, features, and apps cannot be changed. Some accessories and apps compatible with Windows 10 may not work, including some anti-virus, PDF writers, driver utilities, and accessibility apps. Performance may vary, even if you switch to a Windows 10 Home configuration (fee may apply). Once you switch to Windows 10 Home, you can't switch back to Windows 10 S.","images":{"0":"500f7d55ceb47c1c53a189350bccbd7a-0.jpg","1":"500f7d55ceb47c1c53a189350bccbd7a-1.jpg","2":"500f7d55ceb47c1c53a189350bccbd7a-2.jpg","3":"500f7d55ceb47c1c53a189350bccbd7a-3.jpg","4":"500f7d55ceb47c1c53a189350bccbd7a-4.jpg"}},"configuration":{},"availability":{"1445373":{"aditional_price":0,"availabile":131}}}
