{"viewData":{"url_key":"acer_nx_gr7aa_001_sp513_i7_8550u_8gb_256ssd","name":"Acer 13.3\" Spin 5 Multi-Touch 2-in-1 Laptop","sku":"1445352","price":"699.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Acer 13.3&quot; Spin 5 Multi-Touch 2-in-1 Laptop featuring 1.8 GHz Intel Core i7-8550U Quad-Core, 8GB of DDR4 SDRAM 256GB SATA SSD. Review Acer ","long_description":"The 13.3\" Spin 5 Multi-Touch 2-in-1 Laptop from Acer features a 360° hinge, which lets you adjust it into four different viewing modes to best suit your needs. The notebook is equipped with a 1.8 GHz Intel Core i7-8550U quad-core processor and 8GB of DDR4 SDRAM memory for efficient multitasking and everyday tasks. In terms of storing your files, the Spin 5 has a 256GB SATA solid-state drive. If you find yourself needing more room, you can attach an external storage solution using either its two USB 3.0 Type-A, or single USB 2.0 Type-A ports. There's also an SD card slot reader built-in, so you can review your captured photos and videos or transfer files across systems.  The Spin 5 sports a 13.3\" display that's driven by an integrated Intel UHD Graphics 620 chipset and a 1920 x 1080 resolution IPS display that provides wide viewing angles and vivid colors. Moreover, the screen supports multi-touch inputs, so you can utilize touch gestures and commands to enhance your usage. If you wish to extend the Spin 5's display onto an external monitor, you can do so with its built-in HDMI port. Other integrated features include Wi-Fi 5 (802.11ac), a microphone, dual stereo speakers, and a 3.5mm combo audio jack. The operating system installed is Windows 10 Home.","images":{"0":"834225f0cec655ddd06fecde6ed932a0-0.jpg","1":"834225f0cec655ddd06fecde6ed932a0-1.jpg","2":"834225f0cec655ddd06fecde6ed932a0-2.jpg","3":"834225f0cec655ddd06fecde6ed932a0-3.jpg","4":"834225f0cec655ddd06fecde6ed932a0-4.jpg","5":"834225f0cec655ddd06fecde6ed932a0-5.jpg","6":"834225f0cec655ddd06fecde6ed932a0-6.jpg","7":"834225f0cec655ddd06fecde6ed932a0-7.jpg","8":"834225f0cec655ddd06fecde6ed932a0-8.jpg","9":"834225f0cec655ddd06fecde6ed932a0-9.jpg","10":"834225f0cec655ddd06fecde6ed932a0-10.jpg","11":"834225f0cec655ddd06fecde6ed932a0-11.jpg","12":"834225f0cec655ddd06fecde6ed932a0-12.jpg"}},"configuration":{},"availability":{"1445352":{"aditional_price":0,"availabile":575}}}
