{"viewData":{"url_key":"lenovo_81de01m2us_core_i5_8250u_8gb_1tb","name":"Lenovo 15.6\" IdeaPad 330 Notebook","sku":"1445377","price":"429.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Lenovo 15.6&quot; IdeaPad 330 Notebook featuring 1.6 GHz Intel Core i5-8250U Quad-Core, 8GB DDR4 | 16GB Intel Optane | 1TB HDD 15.6&quot; 1366 x 768 Display. Review Lenovo 330","long_description":"The 15.6\" IdeaPad 330 Notebook from Lenovo is a well-rounded system capable of handling everyday tasks such as browsing the internet, streaming TV shows and movies, and video chatting with friends and family. Powered by a 1.6 GHz Intel Core i5-8250U quad-core processor and 8GB of DDR4 RAM, it can efficiently multitask and quickly access frequently used files and programs. For storing your documents, movies, and data, it has a 1TB hard drive and 16GB of Intel Optane memory. Should you need more space, you can connect external storage solutions using its multiple USB ports, as well as its 4-in-1 media card reader, which can also be used to quickly transfer files from mobile devices.  Its 15.6\" display, driven by integrated Intel HD graphics, has a 1366 x 768 display capable of delivering crisp, clear HD content. An HDMI port lets you connect an additional monitor for better multitasking or larger viewing. Connect to the internet via 802.11ac Wi-Fi or the Gigabit Ethernet jack. Pair compatible wireless peripherals using Bluetooth 4.1 technology to free up its USB ports for more important devices. Other integrated features include a webcam, speakers, a microphone, a DVD-RW drive for reading and writing optical media, and a 3.5 mm mic and headphone combo jack. The operating system installed is Windows 10 Home.","images":{"0":"d791fbb10744a18d768d3bc195b574f0-0.jpg","1":"d791fbb10744a18d768d3bc195b574f0-1.jpg","2":"d791fbb10744a18d768d3bc195b574f0-2.jpg","3":"d791fbb10744a18d768d3bc195b574f0-3.jpg","4":"d791fbb10744a18d768d3bc195b574f0-4.jpg","5":"d791fbb10744a18d768d3bc195b574f0-5.jpg","6":"d791fbb10744a18d768d3bc195b574f0-6.jpg","7":"d791fbb10744a18d768d3bc195b574f0-7.jpg","8":"d791fbb10744a18d768d3bc195b574f0-8.jpg","9":"d791fbb10744a18d768d3bc195b574f0-9.jpg","10":"d791fbb10744a18d768d3bc195b574f0-10.jpg","11":"d791fbb10744a18d768d3bc195b574f0-11.jpg","12":"d791fbb10744a18d768d3bc195b574f0-12.jpg"}},"configuration":{},"availability":{"1445377":{"aditional_price":0,"availabile":338}}}
