{"viewData":{"url_key":"hp_5jw43ua_aba_i5_8250u_8gb_1tb_5400","name":"HP 15.6\" Pavilion 15-cs0010ds Multi-Touch Laptop","sku":"1453808","price":"679.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy HP 15.6&quot; Pavilion 15-cs0010ds Multi-Touch Laptop featuring 1.6 GHz Intel Core i5-8250U Quad-Core, 8GB DDR4 RAM | 1TB 5400 rpm SATA HDD 15.6&quot; 1920 x 1080 BrightView Touchscreen. Review HP ","long_description":"Thin at 0.7\" and weighing 4.18 pounds, the 15.6\" Pavilion 15-cs0010ds Multi-Touch Laptop from HP powerful performance that can deliver throughout long workdays. The system is powered by a 1.6 GHz Intel Core i5-8250U Quad-Core processor, which allows you to run multiple applications simultaneously. If you need more power, the system can be overclocked to 3.4 GHz. The 8GB of 2400 MHz DDR4 RAM helps to ensure smooth multitasking and also allows the computer to quickly access frequently used files and programs.The 15.6\" BrightView IPS display features a Full HD 1920 x 1080 native resolution, WLED-backlighting, a 16:9 aspect ratio, viewing angles of 178°, and a micro-edge bezel. The display also features capacitive multi-touch functionality, allowing you to utilize the touch gestures and functions in Windows 10 to further improve accessibility and productivity. The integrated Intel UHD Graphics 620 chipset delivers a sharp, clear picture, and you'll also be able to output video to an external display using the system's HDMI 1.4 port.For storage of your files, the Pavilion 15-cs0010ds is equipped with a 1TB 5400 rpm SATA 2.5\" hard drive. If you want to add external storage, optical drives, memory card readers, and more, there is one USB 3.1 Gen 1 Type-C port and two USB 3.1 Gen 1 Type-A ports, all of which only support data transfers of up to 5 Gb/s. One of the USB Type-A ports also supports HP Sleep and Charge, which allows for device charging when is system is asleep or turned off. Gigabit Ethernet and Wi-Fi 5 (802.11ac) are built-in for wired and wireless networking, and Bluetooth 4.2 technology will also allow you to connect additional compatible peripherals. A built-in multi-format SD card reader lets users download content from their digital camera and other integrated features include a webcam, a digital mic, and B&O PLAY speakers.HP's 15.6\" Pavilion 15-cs0010ds Notebook includes a 45W AC adapter for use when plugged in, or 3-cell / 41Wh lithium-ion battery for when you're on the go. The installed operating system is Windows 10 Home (64-bit).","images":{"0":"a5f5865b621ee895b16a989db9cbd03b-0.jpg","1":"a5f5865b621ee895b16a989db9cbd03b-1.jpg","2":"a5f5865b621ee895b16a989db9cbd03b-2.jpg","3":"a5f5865b621ee895b16a989db9cbd03b-3.jpg","4":"a5f5865b621ee895b16a989db9cbd03b-4.jpg","5":"a5f5865b621ee895b16a989db9cbd03b-5.jpg"}},"configuration":{},"availability":{"1453808":{"aditional_price":0,"availabile":178}}}
