{"viewData":{"url_key":"dell_i5482_7175slv_pus_inspiron_5000_i7_8565u_8gb","name":"Dell 14\" Inspiron 14 5000 Series Multi-Touch 2-in-1 Laptop","sku":"1456572","price":"679.00","categories":{"0":{"categoryName":"Notebooks","urlKey":"notebooks"}},"short_description":"Buy Dell 14&quot; Inspiron 14 5000 Series Multi-Touch 2-in-1 Laptop featuring 1.8 GHz Intel Core i7-8565U Quad-Core, 8GB DDR4 | 256GB SSD 14&quot; 1920 x 1080 IPS Touchscreen. Review Dell 14 5000","long_description":"With a convertible design, the 14\" Inspiron 14 5000 Series Multi-Touch 2-in-1 Laptop from Dell allows you to switch between four different modes, including Tent, Stand, Laptop, and Tablet Mode. Furthermore, the Inspiron 14 5000 is designed to be ultraportable at 0.8\" thin and 3.8 lb. Moreover, this system is powered by a 1.8 GHz Intel Core i7-8565U quad-core processor. It also has 8GB of 2666 MHz DDR4 RAM and a 256GB M.2 PCIe solid-state drive for all your multitasking and storage needs.  In term of visuals, Dell has equipped the Inspiron 14 5000 with a Full HD 1920 x 1080 resolution display. The display also features touch support, so you'll be able to utilize the multi-touch gestures incorporated into Windows 10. You can swipe, tap, and resize apps at your preference. If you need to extend or mirror your display, the Inspiron 14 5000 has a single HDMI port. Additionally, this laptop has integrated Intel UHD Graphics 620 chipset for crisp imagery.  For connectivity, the Inspiron 14 5000 houses two USB 3.1 Gen 1 Type-A ports (one with PowerShare), a single USB 3.1 Gen 1 Type-C port with Power Delivery, a built-in SD/SDHC/SDXC card reader, Wi-Fi 5 (802.11ac), Bluetooth 5.0, an integrated 720p webcam, dual integrated microphones, and stereo speakers that are driven by MaxxAudio. Included with this system are a power cord and 45W AC adapter that operates using a 3-cell, 42Wh battery.  Windows 10 Home is the installed operating system. Windows 10 Home improves the user experience of Windows with several additions and changes. Cortana, Microsoft's digital assistant, is integrated into Windows 10 and is available to answer questions with information gathered from both your system and the internet. Microsoft Edge replaces Internet Explorer, and the Windows Store is now unified to include apps for PCs, tablets, and phones, which can now take advantage of the Windows Continuum feature. Xbox One streaming and integration for supported games are also included.","images":{"0":"a6ac9c46b4fcbd5e74af42a65f4f3b40-0.jpg","1":"a6ac9c46b4fcbd5e74af42a65f4f3b40-1.jpg","2":"a6ac9c46b4fcbd5e74af42a65f4f3b40-2.jpg","3":"a6ac9c46b4fcbd5e74af42a65f4f3b40-3.jpg","4":"a6ac9c46b4fcbd5e74af42a65f4f3b40-4.jpg","5":"a6ac9c46b4fcbd5e74af42a65f4f3b40-5.jpg","6":"a6ac9c46b4fcbd5e74af42a65f4f3b40-6.jpg","7":"a6ac9c46b4fcbd5e74af42a65f4f3b40-7.jpg","8":"a6ac9c46b4fcbd5e74af42a65f4f3b40-8.jpg","9":"a6ac9c46b4fcbd5e74af42a65f4f3b40-9.jpg","10":"a6ac9c46b4fcbd5e74af42a65f4f3b40-10.jpg","11":"a6ac9c46b4fcbd5e74af42a65f4f3b40-11.jpg","12":"a6ac9c46b4fcbd5e74af42a65f4f3b40-12.jpg","13":"a6ac9c46b4fcbd5e74af42a65f4f3b40-13.jpg","14":"a6ac9c46b4fcbd5e74af42a65f4f3b40-14.jpg"}},"configuration":{},"availability":{"1456572":{"aditional_price":0,"availabile":196}}}
