{"shop_name":"PhiShop","name":"Phi Foam","price":"16,67 €","quantity":318,"description":"        Die Formulierung wurde speziell entwickelt, um nach der Behandlung leicht Farbe von der Haut zu entfernen, wie zum Beispiel: Microblading, PMU und Tätowierung. Nicht-aggressive Bestandteile organischen Ursprungs wurden verwendet, um den Schaum zu erzeugen.\rCitrus-abgeleitete Sekundärmetaboliten, einschließlich Flavonoide, Alkaloide, Limonoide, Cumarine, Carotinoide, Phenolsäuren und ätherische Öle, die aufgrund ihrer aktiven Eigenschaften für die menschliche Gesundheit lebenswichtig sind. Zitrusfrüchte sind eine gute Quelle der Ernährung mit einer großen Menge an Vitamin C, die reichlich Bioaktivitäten einschließlich antioxidative, entzündungshemmende, krebshemmende, antimikrobielle und antiallergische Aktivitäten aufweisen.\rBisabolol ist eine farblose ölige Flüssigkeit, die der Hauptbestandteil des ätherischen Kamillenöls ist. Es wird seit Jahrhunderten in Kosmetika wegen seiner wahrgenommenen hautheilenden Eigenschaften verwendet. Bisabolol hat bekanntermaßen anti-irritative, entzündungshemmende und antimikrobielle Eigenschaften.\rPinus Pinaster Rindenextrakt (PBE) hat eine lange Geschichte der ethnomedizinischen Nutzung. Als Gemisch einer großen Vielzahl von Substanzen wird berichtet, dass PEBs eine breite Palette von biologischen Aktivitäten aufweisen, einschließlich antioxidativ, antiinflamatorisch, antitumor, antiviral usw.\rAllantoin wirkt antioxidativ, feuchtigkeitsspendend und beruhigend auf die Haut. Es eignet sich zur Behandlung von sehr empfindlicher und gereizter Haut.\rAnwendung: Tragen Sie nach der Pigmentierung PhiFoam auf die behandelte Haut auf und entfernen Sie dann sanft den Schaum und die Farbe mit Phi Wipes, ohne die Haut zu strecken.\r\rAktive Inhaltsstoffe: CITRUS NOBILIS FRUIT, BISABOLOL, PINUS PINASTER BARK EXTRACT\rAndere Inhaltsstoffe: AQUA, SODIUM LAUROYL GLUTAMATE, BABASSU OIL GLYCERETH-8 ESTERS, SODIUM COCOABUTTERAMPHOACETATE, DIGLYCERIN, MENTHYL PCA, LACTAMIDE MEA, MENTHANE CARBOXAMIDE ETHYLPYRIDINE, COCO-GLUCOSIDE, GLYCERYL OLEATE, LACTIC ACID, MYRISTYL LACTATE, PHENOXYETHANOL, ETHYL LINOLEATE, POTASSIUM SORBATE, SODIUM BENZOATE, ETHYLHEXYLGLYCERIN.","img":"/img/Phi Foam.jpg"}
