{"shop_name":"PhiShop","name":"Skin Expert Online Course","price":"400,00 €","quantity":105,"description":"        Dieser Kurs behandelt ausschließlich die Haut, ihre Probleme sowie alle äußeren und inneren Faktoren, die die Haut betreffen. In 11 verschiedenen Bereichen können Sie alles über:\r• Hautstruktur und ihre Funktionen• Hauttypen• Pigmentbildung und Hautveränderungen• Hautkrankheiten, Infektionen und verschiedene Zustände, ...\rAufgrund der großen Menge an Hauttheorie weisen wir besonders auf die einzigartige Kombination von PhiSkin-Skalen und verschiedenen 3D-Animationen hin, die das Verständnis für die Haut und alle damit verbundenen Veränderungen weiter verbessern werden. Sie lernen, wie Sie die Haut \"lesen\" und wissen im Voraus, welche Ergebnisse nach der Durchführung verschiedener Behandlungen zu erwarten sind. Da der Kurs laufend aktualisiert wird, werden alle Schüler rechtzeitig über die neuesten Updates informiert (Animationen, Videomaterial, Texte, Fotos ...).\rIm Gegensatz zu unseren bestehenden Kursen haben die Studenten unbegrenzten Zugang zu diesem Kurs. Die Frist für die Übergabe und den Erwerb des Zertifikats und des Skin Expert Titels wird jedoch 6 Monate betragen, mit Unterstützung von unserem Team der besten Experten, die jederzeit verfügbar sind und Antworten auf Ihre Fragen geben. Aktuelle Craft Master Benutzer werden nach dem Kauf zum Skin Expert Kurs in der Craft Master App hinzugefügt. Wenn Sie noch kein Craft Master Benutzer sind, können Sie Craft Master App kostenlos im Google Play Store oder im Apple App Store herunterladen. Danach kannst du deinen Benutzernamen in der App erstellen, hier in PhiShop kaufen und du wirst zum Skin Expert Kurs in der Craft Master App hinzugefügt.\rErfahren Sie, wie Sie den Hauttyp und -tonus Ihres Kunden erkennen, um entscheiden zu können, welche Verfahren die besten Ergebnisse bringen, und wie Sie Akne, Narben, ungleichmäßige Hautfarbe, oberflächliche Falten und vieles mehr erkennen können.\rFür alle Fragen zum Kurs kontaktieren Sie uns bitte unter: skinexpert@phi-academy.com","img":"/img/Skin Expert Online Course.jpg"}
