{"viewData":{"url_key":"apple_mk9n2ll_a_128gb_ipad_mini_4","name":"Apple 128GB iPad mini 4 (Wi-Fi Only, Space Gray)","sku":"1185478","price":"379.00","categories":{"0":{"categoryName":"Tablets","urlKey":"tablets"},"1":{"categoryName":"Apple","urlKey":"apple"}},"short_description":"Buy Apple 128GB iPad mini 4 (Wi-Fi Only, Space Gray) featuring 7.9&quot; Multi-Touch Retina Display, 2048 x 1536 Native Resolution Apple A8 64-bit SoC with M8 Coprocessor. Review Apple iPad mini","long_description":"The 128GB iPad mini 4 from Apple has a smaller form factor than its big brother, the iPad Air 2. The iPad mini 4 is just 6.1mm thin and weighs 0.65 lb. Its smaller form factor makes it easier to hold in one hand. This iPad mini comes in a space gray finish. The tablet's 7.9\" Retina Display features a native resolution of 2048 x 1536, showing up to 3.1 million pixels at 326 ppi. The Retina Display's capacitive touchscreen lets you utilize all the multi-touch gestures of iOS 11. The mini 4 features Apple's A8 processor with their 2nd Generation 64-bit architecture, allowing for more robust and powerful apps such as video editing, 3D modeling and CAD, and 3D gaming. Also, the A8 chip supports Metal, a more efficient technology that enables the iPad mini to render detailed graphics and visual effects. Accompanied by the A8 chip is the M8 motion coprocessor, which measures the motion of the iPad mini via the accelerometer, gyroscope, compass, and barometer, lightening the load of the A8 chip. This frees up the A8 chip to process multiple tasks while enabling it to maintain fast performance. The iPad mini may have the Retina Display, but it still manages to maintain its 10-hour battery life. That's because the A8 chip isn't just more powerful; it's also more efficient. The iPad mini comes with iOS and Touch ID. Designed for the iPad, iOS features News, enhanced multitasking, a shortcut bar, editing tools, updated multi-touch gestures, and more. Touch ID uses your fingerprint to unlock your device as well as make secure purchases in iTunes, iBooks, the App Store, and via Apple Pay. With iCloud, you can sync your iPad mini to your other iOS devices and Mac computers. Push photos, download apps, and continue from where you left off in iBooks with iCloud. iCloud also offers cloud storage so you can back up your contacts, photos, and important documents to Apple's cloud servers. You can also restore your iPad mini to a previous state using iCloud.","images":{"0":"6a636513a54610ae2e8552320baf51e0-0.jpg","1":"6a636513a54610ae2e8552320baf51e0-1.jpg","2":"6a636513a54610ae2e8552320baf51e0-2.jpg"}},"configuration":{},"availability":{"1185478":{"aditional_price":0,"availabile":285}}}
