{"viewData":{"url_key":"samsung_sm_t580nzkaxar_10_1_galaxy_tab_a","name":"Samsung 10.1\" Galaxy Tab A T580 16GB Tablet (Wi-Fi Only, Black)","sku":"1250335","price":"199.99","categories":{"0":{"categoryName":"Tablets","urlKey":"tablets"},"1":{"categoryName":"Samsung","urlKey":"samsung"}},"short_description":"Buy Samsung 10.1&quot; Galaxy Tab A T580 16GB Tablet (Wi-Fi Only, Black) featuring 1.6 GHz Exynos 7870 Octa-Core Processor, 2GB of RAM 10.1&quot; WUXGA Display. Review Samsung Tab A","long_description":"Enjoy powerful performance and a vibrant display with the black 10.1\" Galaxy Tab A from Samsung. This tablet features a Samsung Exynos 7870 chipset, which utilizes an octa-core processor clocked at speeds up to 1.6 GHz. It comes with 2GB of RAM and 16GB of built-in storage. It's also equipped with a microSD slot that supports microSDXC cards for additional storage space. For high-speed Internet connectivity, 802.11a/b/g/n/ac Wi-Fi is built-in. Bluetooth 4.2 connectivity is also integrated for pairing with Bluetooth-enabled devices, such as select headphones and accessories.  This Samsung Galaxy Tab A houses a 10.1\" capacitive touchscreen display with a WUXGA 1920 x 1200 screen resolution for viewing detailed high-definition content. The onboard front facing 2-megapixel and rear 8-megapixel cameras allow you take pictures of yourself and the world around you as well as making video calls over your Wi-Fi network.  A micro-USB 2.0 interface is available for mass storage connections and charging the device; a USB cable and charger are included. The internal 7300mAh battery is designed to offer hours of enjoyment before recharging is needed. The Galaxy Tab A comes with the Android 6.0 Marshmallow operating system, which delivers fluid and intuitive multi-touch navigation. The Tab A also supports multitasking tools, such as side-by-side application use.","images":{"0":"dc5f44b4861f51815bc2877764752aa8-0.jpg","1":"dc5f44b4861f51815bc2877764752aa8-1.jpg","2":"dc5f44b4861f51815bc2877764752aa8-2.jpg","3":"dc5f44b4861f51815bc2877764752aa8-3.jpg","4":"dc5f44b4861f51815bc2877764752aa8-4.jpg","5":"dc5f44b4861f51815bc2877764752aa8-5.jpg","6":"dc5f44b4861f51815bc2877764752aa8-6.jpg","7":"dc5f44b4861f51815bc2877764752aa8-7.jpg","8":"dc5f44b4861f51815bc2877764752aa8-8.jpg","9":"dc5f44b4861f51815bc2877764752aa8-9.jpg","10":"dc5f44b4861f51815bc2877764752aa8-10.jpg","11":"dc5f44b4861f51815bc2877764752aa8-11.jpg"}},"configuration":{},"availability":{"1250335":{"aditional_price":0,"availabile":381}}}
