{"viewData":{"url_key":"apple_mphj2ll_a_10_5_ipad_pro_256gb","name":"Apple 10.5\" iPad Pro (256GB, Wi-Fi + 4G LTE, Gold)","sku":"1342203","price":"779.00","categories":{"0":{"categoryName":"Tablets","urlKey":"tablets"},"1":{"categoryName":"Apple","urlKey":"apple"}},"short_description":"Buy Apple 10.5&quot; iPad Pro (256GB, Wi-Fi + 4G LTE, Gold) featuring 10.5&quot; Multi-Touch Retina Display, 2224 x 1668 Screen Resolution (264 ppi) Apple A10X SoC with M10 Coprocessor. Review Apple iPad Pro","long_description":"With the introduction of the gold 10.5\" iPad Pro, Apple provides users with 256GB of storage and a 10.5\" IPS Retina display that is 20% larger than their 9.7\" model, while reducing its border size by nearly 40%. The result is a tablet that weighs just over 1 lb and also features a 12-core GPU, a screen resolution of 2224 x 1668, 264 pixels per inch (ppi), a refresh rate of 120 Hz, a brightness of 600 cd/m2, support for the P3 color gamut, 20 ms latency, and an anti-reflective coating with 1.8% reflectivity. All of this helps to deliver high resolution videos and photos with vivid colors, deep blacks, greater contrast, and more uniform brightness. Powering the large Retina display is the Apple A10X Six-Core chip with a M10 motion coprocessor. This 64-bit chip can pump out desktop-class CPU performance and console-class graphics. The faster performance allows you to multitask with ease using iOS features such as Picture in Picture, Slide Over, and Split View. Also, the iPad Pro is capable of editing 4K video, rendering 3D models/images, creating/editing complex documents and presentations, and playing games. The iPad Pro comes with iOS installed, which features proactive assistance as well as powerful search and improved Siri features, all while protecting your privacy. There are multitasking features designed specifically for iPad which allow you to use multiple apps simultaneously, and built-in apps become more powerful with Notes, detailed transit information in Maps, and the News app. The foundation of iOS is even stronger with software updates that require less space to install and advanced security features to further protect your device. While the Retina Display of the iPad Pro features multi-touch capabilities, Apple does offer alternative ways of interacting with the iPad Pro. The Apple Pencil is an optional accessory that can capture twice as many data points as your finger for greater precision. Force and tilt sensors transmit precise information to the iPad Pro so you can intuitively lay down lines of varying thickness and opacity. The Smart Keyboard is another optional accessory that connects to the Smart Connector on the iPad Pro, which means you don't have to use Bluetooth. The Smart Keyboard has Apple's dome switches for precision typing. The Apple 10.5\" iPad Pro includes a Lightning to USB cable and a USB power adapter. Protection is provided by a limited 1-year warranty, which can be extended using AppleCare. This iPad comes preloaded with iOS. Please check your device settings for the latest available update.","images":{"0":"5fc10983792fd553420f7821b503f358-0.jpg","1":"5fc10983792fd553420f7821b503f358-1.jpg"}},"configuration":{},"availability":{"1342203":{"aditional_price":0,"availabile":912}}}
