{"viewData":{"url_key":"apple_muxm2ll_a_7_9_ipad_mini_early","name":"Apple 7.9\" iPad mini (Early 2019, 256GB, Wi-Fi + 4G LTE, Space Gray)","sku":"1468026","price":"674.00","categories":{"0":{"categoryName":"Tablets","urlKey":"tablets"},"1":{"categoryName":"Apple","urlKey":"apple"}},"short_description":"Buy Apple 7.9&quot; iPad mini (Early 2019, 256GB, Wi-Fi + 4G LTE, Space Gray) featuring 7.9&quot; Multi-Touch Retina Display, 2048 x 1536 Screen Resolution (326 ppi) Apple A12 64-Bit SoC + M12 Coprocessor. Review Apple iPad Mini","long_description":"Built with the same form factor as the iPad mini 4, but up to three time more processing power, the 7.9\" iPad mini from Apple has been upgraded with the A12 Bionic chip with Neural Engine, a 7.9\" Retina display with True Tone, and Apple Pencil support, so you can sketch and jot down ideas as they come to you. This iPad mini is just 0.24\" thin, weighs 0.68 pounds, can store up to 256GB of data, and comes in a space gray finish. The tablet's 7.9\" Retina Display features a native resolution of 2048 x 1536, showing over 3 million pixels at 326 ppi. It also features support for the P3 wide color gamut, an anti-reflective coating with 1.8% reflectivity, 500 cd/m2 brightness, and True Tone, which dynamically adjusts white balance for more natural looking images. The Retina Display's capacitive touchscreen lets you utilize all the multi-touch gestures of iOS. The mini is driven by Apple's 64-bit A12 Bionic processor with Neural Engine, which allows it to use real-time machine learning to recognize patterns, make predictions, and learn from experience. All of this lets you run apps like Adobe Photoshop CC, experience augmented reality, or play games with immersive graphics. Accompanied by the A12 chip is the M12 motion coprocessor, which measures the motion of the iPad via the accelerometer, three-axis gyroscope, and compass, lightening the load of the A12 Bionic chip and freeing it up to process multiple tasks while enabling it to maintain fast performance. The iPad mini may have the Retina Display, but it still manages to maintain its 10-hour battery life. That's because the A12 chip isn't just more powerful; it's also more efficient. The iPad mini comes with iOS and Touch ID. Designed for the iPad, iOS features News, enhanced multitasking, a shortcut bar, editing tools, updated multi-touch gestures, and more. Touch ID uses your fingerprint to unlock your device as well as make secure purchases in iTunes, iBooks, the App Store, and more via Apple Pay. Thanks to Wi-Fi 5 (802.11ac) and Bluetooth 5.0, the iPad mini can connect to your network and integrate with iCloud, so you can sync your iPad mini to your other iOS devices and Mac computers. Push photos, download apps, and continue from where you left off in iBooks with iCloud. iCloud also offers cloud storage so you can back up your contacts, photos, and important documents to Apple's cloud servers. You can also restore your iPad mini to a previous state using iCloud. If you don't have access to Wi-Fi, this iPad can also achieve network connectivity using integrated 4G LTE technology. This iPad comes preloaded with iOS. Please check your device settings for the latest available update.","images":{"0":"056266653f008d753fc5bd0e933bed3a-0.jpg","1":"056266653f008d753fc5bd0e933bed3a-1.jpg"}},"configuration":{},"availability":{"1468026":{"aditional_price":0,"availabile":325}}}
