{"viewData":{"url_key":"dr-phi-dermaform-30-1-capsules","name":"DR. PHI DERMAFORM 301 capsules","sku":"2110000037529","price":"10.00","categories":{"0":{"categoryName":"Dr-phi","urlKey":"dr-phi"},"1":{"categoryName":"Supplements","urlKey":"supplements"}},"short_description":"Dermaform capsules are intended as a supplement to healthy nutrition after antiage treatments such as Microneedling, PhiLings and all abrasive facial treatments that stimulate skin regeneration and renewal. Enriched with vitamin complex, Dermaform capsules contribute to the maintenance of normal skin, hair, nails and protection against oxidative stress. How to use:┬áOral use, 1 capsules daily. No chewing, with enough water.","long_description":"Enriched with vitamin B complex, which fully meets the daily requirements for these vitamins, Dermaform capsules contribute to the preservation of the skin, making hair and nails healthy, beautiful and powerful. Vitamin E, as a powerful antioxidant, has a major effect on cell regeneration, relieves oxidative stress, leading to a slowdown in the aging process. Methylsulphonylmethane is also called mineral of beauty. It is important for maintaining healthy skin and essential for collagen production. It acts as a source of sulfur and contributes to the quality of the skin, hair and nails. Hyaluronic acid makes it possible to maintain the youthful appearance of the skin. It is extremely important in performing basic metabolic and physiological functions and in preserving skin elasticity, hydration and firmness. Dietary supplements are not a substitute for balanced and varied nutrition. The capsules are of plant origin and are suitable for vegetarians and vegans. ┬á How to use: Oral use, 1 capsules daily. No chewing, with enough water. ┬á Active ingredients: METHANESULFONYLMETHANE, HYALURONIC ACID, B-VITAMIN COMPLEX - NIACIN (NICOTINAMIDE), PANTOTHENIC ACID (CALCIUM-D-PANTOTHENATE), VITAMIN B2 (RIBOFLAVIN), VITAMIN B6 (PRIDOXIN HYDROCHLORIDE), VITAMIN B1 (THIAMINE HYDROCHLORIDE), FOLIC ACID (PTEROYLMONOGLUTAMIC ACID), BIOTIN (D-BIOTIN), VITAMIN B12 (CYANOCOBALAMIN), VITAMIN E (DL-╬æ-TOCOPHERYL ACETATE) Other ingredients: MALTODEXTRIN, CORN STARCH, ANTI-CAKING AGENTS - MAGNESIUM STEARATE (E 470B), TALC (E 553B), CAPSULE - HYDROXYPROPYLMETHYLCELLULOSE (E 464), CAPSULE COLORS - YELLOW IRON OXIDE (E172) AND TITANIUM DIOXIDE (E171).","images":{"0":"00a6eb30b7b94c5b8b1ed9c2da23d956-0.jpg","1":"00a6eb30b7b94c5b8b1ed9c2da23d956-1.jpg","2":"00a6eb30b7b94c5b8b1ed9c2da23d956-2.jpg"}},"configuration":{},"availability":{"2110000037529":{"aditional_price":0,"availabile":872}}}