{"shop_name":"PhiShop","url_key":"phi-spots-microneedling-gel","name":"Phi Spots Microneedling Gel","sku":"2110000019365","price":"25.00","quantity":935,"categories":{"0":"philings","1":"gels-creams"},"short_description":"Special gel designed to be used during the microneedling treatment for treating skin areas with age spots and strains which are the result of sunlight exposure, as well as those that may occur after inflammatory processes on the skin (acne and pimples).\rUse: Apply the product to the skin areas with spots and stains during the microneedling tratment.\r\r\rHigh content of hyaluronic acid for intense treatment\r\r\rImmediatly moisturizes and softens the skin\r\r\rEvens the skin tone\r\r\rIncreases the effect of skin tone\r\r\rReduces the colour intensity of hyperpigmented areas","long_description":"Special gel designed to be used during the microneedling treatment for treating skin areas with age spots and strains which are the result of sunlight exposure, as well as those that may occur after inflammatory processes on the skin (acne and pimples). It is applied to the skin areas with such changes during the microneedling treatment. The solution contains a novel active component based on amino acid that is very effective in the removal of spots and stains and in smoothing the complexion. Undecylenoyl phenylalanine is an amphiphilic molecule that consists of lipophylic part, made from undecyl acid and hydrophilic part, phenylalanine (essential amino acid). Undecylenoyl phenylalanine has a binding affinity for MC1R receptors on melanocytes tha bind hormone melanotropin antagonist, equalization of skin tone, increase in skin brightening effects, reduction of colour intensity of hyperpigmented areas (spots, stains) which usually occur as the result of sun exposure. Formulation with high content of hyaluronic acid provides intense immediate and long- term skin hydration. Its ability to penetrate deep into the skin and hydrate it, as well as its highly elastic propeties make the skin softer, restoring its suppleness, elasticity and vitality.\rUse: Apply the product to the skin areas with spots and stains during the microneedling tratment.\rIngredients: Aqua, Pentylene Glycol, Fructose, Urea, Citric Acid, Sodium Hydroxide, Maltose, Sodium Chloride, Sodium Lactate, Trehalose, Allantoin, Sodium Hyaluronate, Glucose, Undecylenoyl Phenylalanine, Phenoxyethanol, Ethylhexylglycerin.\r\r\rHigh content of hyaluronic acid for intense treatment\r\r\rImmediatly moisturizes and softens the skin\r\r\rEvens the skin tone\r\r\rIncreases the effect of skin tone\r\r\rReduces the colour intensity of hyperpigmented areas\r\r\rCountry of origin: Serbia","images":{"0":"ffee43430ef663bc3862e25dc0432fe5-0.jpg"}}
