{"viewData":{"url_key":"skin-expert-online-course","name":"Skin Expert Online Course","sku":"2110000038410","price":"400.00","categories":{"0":{"categoryName":"Phibrows","urlKey":"phibrows"},"1":{"categoryName":"Lectures","urlKey":"lectures"}},"short_description":"Skin Expert is the first theoretical skin course by the PhiAcademy. It is intended for beauty Artists and beauty Techinicans who want to improve their skills and bring them to the next level, and for the students as a starting point in beauty industry, by providing all necessary education and knowledge applicable in their further work and improvement. Skin Expert course will provide very detailed and in-depth information, in order to acquire better prior knowledge which will later be necessary to master the other skills more easily. It is also adapted to everyone regardless of previous familiarity with medical terminology.","long_description":"This course deals solely with the skin, its problems, as well as with all external and internal factors that affect the skin. Through 11 different sections you will be able to learn all about:  ΓÇó Skin structure and its functions  ΓÇó Skin types  ΓÇó ┬áPigment forming and skin changes ΓÇó ┬áSkin diseases, infections and various conditions,...  Due to the large amount of skin theory, we're especially pointing out the unique combination of PhiSkin Scales and various 3D animations that will further improve understanding of the skin and all the changes that happen on it. You will learn how to ΓÇ£readΓÇ£ the skin and know in advance what results to expect after performing different treatments. Due to the fact that the course will be continually updated, all students will be notified in the timely manner about the latest updates (animations, video materials, texts, photos...). Unlike our existing courses, students will have unlimited access to this course. However, the deadline for passing it and obtaining the certificate and the Skin Expert title will be 6 months with support from our team of the best experts who be available any time and give responses to your questions. Current Craft Master users will be added to the Skin Expert course in the Craft Master app after purchasing. If you are not Craft Master user yet, you can download for free Craft Master app from the Google Play Store or Apple App Store. After that, you can create your username in the app, make purchase here in PhiShop, and you will be added to the Skin Expert course in the Craft Master app. Learn how to recognize your clientΓÇÖs skin type and tone to be able to decide which procedures will bring the best results, as well as how to identify acne, scarring, uneven skin color, superficial wrinkles and much more.  For all questions related to the course, please contact us via: skinexpert@phi-academy.com/","images":{"0":"6de28f17b8038310cc2e8421e55cbc2e-0.jpg"}},"configuration":{},"availability":{"2110000038410":{"aditional_price":0,"availabile":927}}}