{"shop_name":"PhiShop","url_key":"phi-scars-microneedling-gel","name":"Phi Scars Microneedling Gel","sku":"2110000019358","price":"25.00","quantity":552,"categories":{"0":"philings","1":"gels-creams"},"short_description":"Special gel designed to be used during the microneedling treatment of stretch marks and scars in synergy with positive effects of microneedling provides the best results. It is applied to skin areas with stretch marks and scars during the microneedling treatment.\r\rSupports and additionally stimulates collagen synthesis and skin regeneration\rImmediately moisturizes and softens the skin\rSoothes, deeply moisturizes the skin and accelerates epithelization\r\rUse: Apply the product to the skin areas with stretch marks and scars during the treatment.","long_description":"Special gel designed to be used during the microneedling treatment of stretch marks and scars in synergy with positive effects of microneedling provides the best results. It is applied to skin areas with stretch marks and scars during the microneedling treatment. Formulation with high content of hyaluronic acid is highly effective in the fight aganist such changes in the skin. Hyaluronic acid molecules penetrate deep into the skin where they start very specific physiological mechanisms, such as the epithelial and dermal healing and stimulation of synthesis of its own hyaluronic acid. Its ability to penetrate into the skin as well as its highly elastic propeties make the skin softer and restore its suppleness and elasticity. Snail secretion filtrate acts as an activator of biological elimination of dead and damaged skin cells and restoration of healthy cells. It helps in the recovery and skin appearance and it makes if firmer by restoring glycosaminoglycans in the skin. Allantoin stimulates ephithelization and regeneration of the skin. Centella extract stimulates collagen biosynthesis and contributes to better nutrition of connective tissue. Regestril is a bioactive complex that preents extracellular matrix degradation wich leads to the appearance of strech marks by inhibiting proteolytic enzymes responsible for matrix degradation and stimulating neosynthesis of matrix macromolecules.\r\rUse: Apply the product to the skin areas with stretch marks and scars during the treatment.\r\rIngredients: Aqua, Butylene Glycol, Cetyl Hydroxyethylcellulose, Rutin, Palmitoyl Tripetide-1, Palmitoyl Tetrapeptide-7, Phaseolus Lunatus (Green Bean) Seed Extract, Snail Secretion Filtrate (Helix Aspersa Muller), Centella Asiatica Leaf Extract, Sodium Hyaluronate, Phenoxyethanol, Ethylhexylglycerin, Allantoin.\r\rSupports and additionally stimulates collagen synthesis and skin regeneration\rImmediately moisturizes and softens the skin\rSoothes, deeply moisturizes the skin and accelerates epithelization\r\r\rCountry of origin: Serbia","images":{"0":"930fbc8228f6d2b3f3d54703151d88a2-0.jpg"}}
