{"viewData":{"url_key":"dr-phi-no-stress-30-1-capsules","name":"DR. PHI NO STRESS 301 capsules","sku":"2110000037512","price":"7.00","categories":{"0":{"categoryName":"Dr-phi","urlKey":"dr-phi"},"1":{"categoryName":"Supplements","urlKey":"supplements"}},"short_description":"No stress capsules contribute to the improvement of the overall state of the body exposed to mental stress. All the ingredients of this preparation are equally important and lead to the same goal ΓÇô organism relaxation. Doctor formulated, it supports calm, concentration, focus, mental energy and positive mood.  How to use:┬áOral use, 2 capsules daily. No chewing, with enough water.","long_description":"Hops acorns are traditionally used and are known for their soothing effect, as well as lemon balm, and together they help relieve the symptoms of mental stress and provide a healthy sleep. L-theanine is an amino acid and one of the important ingredients of green tea that helps to achieve optimal relaxation without causing drowsiness. Magnesium is a mineral associated with stress. Stress reduces the level of magnesium in the body, and the lack of magnesium in the body leads to stress. It is therefore necessary to maintain an optimum level of magnesium in the body, as it reduces the sense of fatigue and contributes to the normal functioning of the nervous system. Dietary supplements are not a substitute for balanced and varied nutrition. The capsules are of plant origin and are suitable for vegetarians and vegans.  How to use: Oral use, 2 capsules daily. No chewing, with enough water. ┬á Active ingredients: DRY HOP CONES EXTRACT (HUMULUS LUPULUS) (6: 1), MELISSA OFFICINALIS, L-TEANIN, MAGNESIUM (MAGNESIUM CARBONATE). Other ingredients: MALTODEXTRIN, CORN STARCH, MAGNESIUM STEARATE (E 470B), TALC (E 553B), CAPSULE - HYDROXYPROPYLMETHYLCELLULOSE (E 464), CAPSULES - CHLOROPHYLL COPPER COMPLEX (E 141II) AND TITANIUM DIOXIDE (E171).","images":{"0":"6c6500a7f5ea76fed950b1bc6385fab4-0.jpg","1":"6c6500a7f5ea76fed950b1bc6385fab4-1.jpg","2":"6c6500a7f5ea76fed950b1bc6385fab4-2.jpg"}},"configuration":{},"availability":{"2110000037512":{"aditional_price":0,"availabile":225}}}