{"shop_name":"PhiShop","url_key":"skin-candy-after-care-balm","name":"Skin Candy After Care Balm","sku":"2110000019297","price":"10.00","quantity":766,"categories":{"0":"wholesale","1":"aftercare"},"short_description":"Regenerative balm for skin care immediately after the treatment is a natural product that contains carefully selected components which promote healing process and enable the best pigment retention in the skin. Due to its liquid structure, it is easy to  apply and it forms a protective film that prevents dust particles and other harmful outside materials from penetrating into the skin.","long_description":"Regenerative balm for skin care immediately after the treatment is a natural product that contains carefully selected components which promote healing process and enable the best pigment retention in the skin. Due to its liquid structure, it is easy to  apply and it forms a protective film that prevents dust particles and other harmful outside materials from penetrating into the skin. The formulation is water free and it contains lanolin, bee wax and natural oils that intensively nourish and regenerate the skin. Lanoline is natural ointment that nourishes, softens and hydrates the skin, supports its maintenance and moisture restoring. It improves the degradation of sebum clogs created by pigment particles, thus preventing clogging the pores and providing even colour appearance. Coconut oil contains fatty acids of the middle chain of molecules that maintain the skin moisture by preventing the drying of the skin. It contains caprine, caprile and lauric fatty acids and they are natural disinfectants that prevent tattooed area from being infected. It contains E vitamin that makes the skin soft, prevents cracking due to drying and blocks free radicals from the body, giving the skin a younger appearance. It contains proteins that recover damaged cells and restore the skin after tattooing. Calendula oil is rich in essential oils, tannins, sugars, lycopene, proteins and carotenoids and it soothes irritated skin. It accelerates wound healing and damaged tissue epithelization, repairs skin structure, nourishes and protects it. Jojoba oil penetrates into the skin easier than other oils. It is rich in vitamin E, it is an excellent emollient and moisturizer, it increases skin elasticity. It moisturizes and softens the skin exceptionally well, by first creating a non-fat lipid layer and preventing moisture loss and then softening the tissue by diffusion in stratum corneum. It is quickly absorbed into the skin and the skin is velvety after the application. Bee wax creates a protective layer on the skin surface that does not prevent the skin from breathing. This protective layer slows down dehydration and skin ageing, so it becomes soft, elastic and smooth. It improves tissue regeneration process, thus accelerating wound healing process. Emollient based on coconut oil moisturizes and softens the skin, making it velvety smooth and soft. Lavender essential oil is one of the mildest and most efficient essential oils. It soothes the skin, accelerates epithelization and prevents scarring.","images":{"0":"50f0ab075887260941094119230fb5fa-0.jpg","1":"50f0ab075887260941094119230fb5fa-1.jpg"}}
