{"shop_name":"PhiShop","url_key":"skin-candy-sun-sweat-protection","name":"Skin Candy Sun&Sweat Protection","sku":"2110000019334","price":"10.00","quantity":915,"categories":{"0":"wholesale","1":"aftercare"},"short_description":"This is an aftercare cream designed to prevent extreme conditions from affecting the quality\rand intensity of colour after PhiBrows and Phicontour treatments. It is intended for people who\r\rsweat extensively due to different body factors of trainings\rplan to be exposed to sun immediately after the treatment","long_description":"This is an aftercare cream designed to prevent extreme conditions from affecting the quality\rand intensity of colour after PhiBrows and Phicontour treatments. It is intended for people who\r\rsweat extensively due to different body factors of trainings\rplan to be exposed to sun immediately after the treatment\r\rOptionally balanced combination of UVA and UVB filters provides tattooed skin with exceptionally\rhigh protection from harmful effects of sun rays. Also provide absorbtion of moisture (sweat),\rexcess sebum, thus provide pigments from degradation. It preserves tattoo colour intensity\rand reduces the risk of allergies and irritations. It nourishes the skin intensely, provides it\rwith exceptional moisture and softness and prevents skin drying and ageing. It is easy to spread\rand it leaves no greasy as well as white traces on the skin.\r\rPanthenol *Vitamin E *Allantoin * Calendula extract *Jojoba oil\r\rUse: Apply the cream 3 to 5 times a day, 7 days after the treatment.\rAfter 7 days, it can be applied only when necessary, 15 minutes\rbefore sun exposure or workout.\r\r\rProvides double protection of pigments from degradation and fading\rProvides very high protection from harmful effects of sun rays\rPreserves colour intensity\rNourishes the skin, providing it with exceptional moisture and softness\rRestores hydrolipid proactive skin layer\rEasy to spread, without greasy and white traces on the skin\rDoes not contain allergens and harmful ingredients\rWaterproof\r\r\rIngredients: Aqua, Homosalate, Octocrylene, C12-15 Alkyl Benzoate, Ethylhexyl\rMethoxycinnamate, Ethylhexyl Salicylate, Butyl Methoxydibenzoylmethane, Archidyl Alcohol,\rBehenyl Alcohol, Arachidyl Glucoside, TrimethylpentanediolAdipic AcidGlycerin Crosspolymer,\rGlyceryl Stearate, PEG-100 Stearate, Titanium Dioxide, Silica, DCetyl Alcohol, Panthenol,\rTocophery Acetate, Calendula Officinalis Flower Extract, Allantoin, Simmondsia Chinensis\r(Jojoba) Seed Oil, Phenoxyethanol, Methylparaben, Butylparaben, Ethylparaben, Propylparaben,\rParfum, Xanthan Gum, Sodium Polyacrylate, Tetrasodium EDTA.","images":{"0":"ddba150c8522e54458c679f1fe075d03-0.jpg","1":"ddba150c8522e54458c679f1fe075d03-1.jpg"}}
