{"shop_name":"PhiShop","url_key":"phi-body-microneedling-gel","name":"Phi Body Microneedling Gel","sku":"2110000019372","price":"25.00","quantity":965,"categories":{"0":"philings","1":"gels-creams"},"short_description":"Special gel intended for use during microneedling treatments on the skin of hands, neck and neckline with visible wrinkle reduction effects. It is applied to the skin of these body parts during the microneedling treatment. \r\r\rHigh content of hyaluronic acid for intense treatment\r\r\rInstantly moisturizes and softens the skin\r\r\rIncreases skin volume and elasticity\r\r\rReduces existing wrinkles and prevents formation of new ones","long_description":"Special gel intended for use during microneedling treatments on the skin of hands, neck and neckline with visible wrinkle reduction effects. It is applied to the skin of these body parts during the microneedling treatment. Formulation with high content of hyaluronic acid is highly efficient in the fight against wrinkles, since it reduces the existing ones and prevents formation of new wrinkles. Due to its specific structure, hyaluronic acid provides intense immediate and constant skin hydration.  Its ability to penetrate the skin and hydrate it, as well as its highly-elastic properties, make the skin softer, restore its elasticity and thus have excellent anti-age effect. The solution acts very fast and after the first application the quality of the skin of hands, neck and neckline is visibly improved and the skin becomes firmer and more elastic. Light, fast-absorbing base contains carefully selected herbal extracts.\rExtracts of ginseng, mango, green tea and ginkgo are rich in vitamins and minerals and act as natural anti-oxidants that protect the skin from harmful effects of free radicals. They promote circulation and cell metabolism, improve hydration and nutrition of the skin. They accelerate the process of cell regeneration and help the skin to look brighter and healthier.\rUse: Apply the product during the treatment to the skin of hands, neck and neckline.\rIngredients: Aqua, Panax Ginseng Root Extract, Mangifera Indica (Mango) Fruit Extract, Sodium Hyaluronate, Phenoxyethanol, Ethylhexylglycerin, Camellia Sinensis Leaf Extract, Ginkgo Biloba Leaf Extract.\r\rHigh content of hyaluronic acid for intense treatment\rInstantly moisturizes and softens the skin\rIncreases skin volume and elasticity\rReduces existing wrinkles and prevents formation of new ones\r\rCountry of origin: Serbia","images":{"0":"7ef9078592b2395b268f7cc7297013a0-0.jpg"}}
