{"shop_name":"PhiShop","url_key":"tattoo-sun-protection","name":"Tattoo Sun Protection","sku":"2110000017897","price":"8.33","quantity":462,"categories":{"0":"wholesale","1":"aftercare"},"short_description":"PhiAcademy created this photo-stable, hypoallergenic cream tattoo guard in order to satisfy the needs of people who frequent sunny spots. Anyone who works outside can understand why easy application goes a long way towards your quality of life. Creamy tattoo sun protection helps you apply quickly and frequently, and this unique photo-stable formula allows it to last throughout different light intensities without degrading. That means you don’t need to worry about applying it more frequently if it’s sunny out! If you can’t seem to keep a schedule with regular sunscreen or find yourself forgetting it too often, this is the exactly what you need since it 50ml compactible package makes it fit even in a pocket! Guarding your tattoo or permanent makeup from the sunlight is crucial if you want to keep it bright and vivid throughout the years!The amount of protection it offers as a sunscreen is phenomenal when you think about it—a whole SPF50! It protects against both UVA and UVB, so you don’t have to worry about any of your skin getting damaged while you enjoy yourself outside.The benefits of this product are many – among them, avoiding irritation and infection. More importantly this tattoo aftercare products help with healing and preserve the design and colors of the pigments. Specially designed formula that revives and protects the pigment from sweat and will extend duration of pigment for all clients who are exposed to strong sunlight and heavy sweating. Does not contain allergens and harmful or harsh ingredients, waterproof product, hypoallergenic. Cream leaves no white traces. Can be used 7 days after tattoo, pemanent make up or microblading treatment.","long_description":"The benefits of this product are many – among them, avoiding irritation and infection. More importantly this tattoo aftercare products help with healing and preserve the design and colors of the pigments. Specially designed formula that revives and protects the pigment from sweat and will extend duration of pigment for all clients who are exposed to strong sunlight and heavy sweating. Does not contain allergens and harmful or harsh ingredients, waterproof product, hypoallergenic. Provides extra high UVA + UVB PROTECTION. Cream leaves no white traces Can be used 7 days after tattoo ,pemanent make up or microblading treatment.\r\rIngredients: Aqua, Homsalat, Octocrylen, C12-15-Alkylbenzoat, Ethylhexylmethoxycinnamat, Ethylhexylsalicylat, Butylmethoxydibenzoylmethan, Arachidylalcohol, Behenylalcohol, Arachidylglucoside, Trimethylpentandiol  Adipiumstearat, Titanium Dioxide, Silica, Cetylalcohol, Phenoxyethanol, Methylparaben, Butylparaben, Ethylparaben, Propylparaben, Tocopherylacetat, Perfume, Panthenol, xanthan gum, sodium polyacrylate, tetrantrium EDTA","images":{"0":"d6479ad789ece5a4aec4460c22612983-0.jpg"}}
