{"viewData":{"url_key":"phifoam.html","name":"Phi Foam","sku":"2110000037840","price":"16.67","catagories":{"0":{"categoryName":"Phiremoval","urlKey":"phiremoval.html"},"1":{"categoryName":"Treatment","urlKey":"treatment.html"}},"short_description":"PhiFoam is a universal skin cleanser that can be used before and after treatments such as: permanent make-up, microblading, tattoo, microneedling, lashlifting, lash extension and other cosmetic treatment which require skin to be oil-free and clean.","long_description":"The formulation has been specially designed so as to easily remove color from the skin after treatment, such as: microblading, PMU and tattooing. Non-aggressive ingredients of organic origin were used to create the foam. Citrus-derived secondary metabolites, including flavonoids, alkaloids, limonoids, coumarins, carotenoids, phenolic acids and essential oils which are of vital importance to human health due to their active properties. Citrus fruits are good sources of nutrition with an ample amount of vitamin C which exhibit plentiful bioactivities including anti-oxidant, anti-inflammatory, anti-cancer, anti-microbial and anti-allergy activities. Bisabolol is a colorless oily liquid that is the main component of chamomile essential oil. It has been used for hundreds of years in cosmetics because of its perceived skin healing properties. Bisabolol is known to have anti-irritant, anti-inflammatory, and anti-microbial properties. Pinus Pinaster Bark Extract (PBEs) have a long history of ethnomedicial use. As a mixture of a large variety of substances, PBEs are reported to exhibit a wide range of biological activities, including antioxidative, antiinflamatory, antitumor, antiviral etc. Allantoin has an antioxidant, moisturizing and soothing effect on the skin. It is suitable for the treatment of very sensitive and irritated skin. How to use: After pigmentation, apply PhiFoam on the treated skin and then gently remove foam and color by using Phi Wipes without stretching the skin.  Active ingredients: CITRUS NOBILIS FRUIT, BISABOLOL, PINUS PINASTER BARK EXTRACT Other ingredients: AQUA, SODIUM LAUROYL GLUTAMATE, BABASSU OIL GLYCERETH-8 ESTERS, SODIUM COCOABUTTERAMPHOACETATE, DIGLYCERIN, MENTHYL PCA, LACTAMIDE MEA, MENTHANE CARBOXAMIDE ETHYLPYRIDINE, COCO-GLUCOSIDE, GLYCERYL OLEATE, LACTIC ACID, MYRISTYL LACTATE, PHENOXYETHANOL, ETHYL LINOLEATE, POTASSIUM SORBATE, SODIUM BENZOATE, ETHYLHEXYLGLYCERIN.","images":{"0":"b573ff3c4dc80dcfafec03fff95cfac6-0.jpg"}},"configuration":{},"availability":{"2110000037840":{"aditional_price":0,"availabile":329}}}