{"viewData":{"url_key":"phi-spots-microneedling-gel.html","name":"Phi Spots Microneedling Gel","sku":"2110000019365","price":"25.00","catagories":{"0":{"categoryName":"Philings","urlKey":"philings.html"},"1":{"categoryName":"Gels-creams","urlKey":"gels-creams.html"}},"short_description":"Special gel designed to be used during the microneedling treatment for treating skin areas┬áwith age spots and strains which are the result of sunlight exposure, as well as those that may┬áoccur after inflammatory processes on the skin (acne and pimples). Use: Apply the product to the skin areas with spots and stains during the microneedling┬átratment.   High content of hyaluronic acid for intense treatment   Immediatly moisturizes and softens the skin   Evens the skin tone   Increases the effect of skin tone   Reduces the colour intensity of hyperpigmented areas","long_description":"Special gel designed to be used during the microneedling treatment for treating skin areas┬áwith age spots and strains which are the result of sunlight exposure, as well as those that may┬áoccur after inflammatory processes on the skin (acne and pimples). It is applied to the skin┬áareas with such changes during the microneedling treatment. The solution contains a novel┬áactive component based on amino acid that is very effective in the removal of spots and stains┬áand in smoothing the complexion. Undecylenoyl phenylalanine is an amphiphilic┬ámolecule that consists of lipophylic part, made from undecyl acid and hydrophilic part,┬áphenylalanine (essential amino acid). Undecylenoyl phenylalanine has a binding affinity for┬áMC1R receptors on melanocytes tha bind hormone melanotropin antagonist, equalization of┬áskin tone, increase in skin brightening effects, reduction of colour intensity of┬áhyperpigmented areas (spots, stains) which usually occur as the result of sun exposure.┬áFormulation with high content of hyaluronic acid provides intense immediate and long-┬áterm skin hydration. Its ability to penetrate deep into the skin and hydrate it, as well as its┬áhighly elastic propeties make the skin softer, restoring its suppleness, elasticity and vitality. Use: Apply the product to the skin areas with spots and stains during the microneedling┬átratment. Ingredients: Aqua, Pentylene Glycol, Fructose, Urea, Citric Acid, Sodium Hydroxide,┬áMaltose, Sodium Chloride, Sodium Lactate, Trehalose, Allantoin, Sodium┬áHyaluronate, Glucose, Undecylenoyl Phenylalanine, Phenoxyethanol, Ethylhexylglycerin.   High content of hyaluronic acid for intense treatment   Immediatly moisturizes and softens the skin   Evens the skin tone   Increases the effect of skin tone   Reduces the colour intensity of hyperpigmented areas   Country of origin: Serbia","images":{"0":"ffee43430ef663bc3862e25dc0432fe5-0.jpg"}},"configuration":{},"availability":{"2110000019365":{"aditional_price":0,"availabile":935}}}