{"viewData":{"url_key":"phi-scars-microneedling-gel","name":"Phi Scars Microneedling Gel","sku":"2110000019358","price":"25.00","categories":{"0":{"categoryName":"Philings","urlKey":"philings"},"1":{"categoryName":"Gels-creams","urlKey":"gels-creams"}},"short_description":"Special gel designed to be used during the┬ámicroneedling┬átreatment of stretch marks┬áand scars in synergy with positive effects of microneedling provides the best results. It is applied┬áto skin areas with stretch marks and scars during the microneedling treatment.  Supports and additionally stimulates collagen synthesis and skin regeneration Immediately moisturizes and softens the skin Soothes, deeply moisturizes the skin and accelerates epithelization  Use:┬áApply the product to the skin areas with stretch marks and scars during the treatment.","long_description":"Special gel designed to be used during the microneedling treatment of stretch marks┬áand scars in synergy with positive effects of microneedling provides the best results. It is applied┬áto skin areas with stretch marks and scars during the microneedling treatment. Formulation┬áwith high content of hyaluronic acid is highly effective in the fight aganist such changes in the┬áskin. Hyaluronic acid molecules penetrate deep into the skin where they start very specific┬áphysiological mechanisms, such as the epithelial and dermal healing and stimulation of┬ásynthesis of its own hyaluronic acid. Its ability to penetrate into the skin as well as its highly┬áelastic propeties make the skin softer and restore its suppleness and elasticity. Snail┬ásecretion filtrate┬áacts as an activator of biological elimination of dead and damaged skin┬ácells and restoration of healthy cells. It helps in the recovery and skin appearance and it makes┬áif firmer by restoring glycosaminoglycans in the skin. Allantoin stimulates ephithelization┬áand regeneration of the skin. Centella extract┬ástimulates collagen biosynthesis and┬ácontributes to better nutrition of connective tissue. Regestril is a bioactive complex that┬ápreents extracellular matrix degradation wich leads to the appearance of strech marks by┬áinhibiting proteolytic enzymes responsible for matrix degradation and stimulating┬áneosynthesis of matrix macromolecules.  Use:┬áApply the product to the skin areas with stretch marks and scars during the treatment.  Ingredients:┬áAqua, Butylene Glycol, Cetyl Hydroxyethylcellulose, Rutin, Palmitoyl┬áTripetide-1, Palmitoyl Tetrapeptide-7, Phaseolus Lunatus (Green Bean) Seed Extract, Snail┬áSecretion Filtrate (Helix Aspersa Muller), Centella Asiatica Leaf Extract, Sodium Hyaluronate,┬áPhenoxyethanol, Ethylhexylglycerin, Allantoin.  Supports and additionally stimulates collagen synthesis and skin regeneration Immediately moisturizes and softens the skin Soothes, deeply moisturizes the skin and accelerates epithelization   Country of origin: Serbia","images":{"0":"930fbc8228f6d2b3f3d54703151d88a2-0.jpg"}},"configuration":{},"availability":{"2110000019358":{"aditional_price":0,"availabile":552}}}