{"viewData":{"url_key":"bodycare-royal-oil-100ml","name":"BodyCare Royal oil 100ml","sku":"2110000018184","price":"18.00","categories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale"},"1":{"categoryName":"Creams","urlKey":"creams"}},"short_description":"Natures restores your energy when you sincerely present yourself to itΓÇª PhiAcademy is proud to present, as a part of its portfolio, a unique product Body Care, with essential oil as its main component. By its composition, Body Care is a hundred percent natural product; it does not contain water or any chemical or synthetic components. In addition to daily use after shower, Body Care is highly recommended during massages. Ingredients: Calendula, Avocado, Argan, Jojoba, Hazelnut, St JohnΓÇÖs wort, Olive, Carrot, Almond, Apricot pits, Chestnut, Lavender, Mint. The product is intended for all skin types and can be used equally by men and women.","long_description":"Natures restores your energy when you sincerely present yourself to itΓÇª PhiAcademy is proud to present, as a part of its portfolio, a unique product Body Care, with essential oil as its main component. By its composition, Body Care is a hundred percent natural product; it does not contain water or any chemical or synthetic components. In addition to daily use after shower, Body Care is highly recommended during massages. Ingredients: Calendula, Avocado, Argan, Jojoba, Hazelnut, St JohnΓÇÖs wort, Olive, Carrot, Almond, Apricot pits, Chestnut, Lavender, Mint. The product is intended for all skin types and can be used equally by men and women. The scent of essential oils can affect the state of mind. This happens through the fragrance tract. It has not been exactly explained how odours differ, but we do know that tiny molecules of fragrances affect nervous system centres, thus causing a mental and psychological reaction. An important general feature is that essential oils help strengthen the immune system and fight against all types of germs, viruses and microbes. Unlike many other medicines, essential oils, provided that they are properly stored, always remain active and their power does not diminish over time. Essential oils do not leave greasy marks, they are very volatile and are usually lighter than water. When using Body Care, you can be absolutely carefree and sure that there will be no marks on your clothes. About 80% of composition of commercial cosmetic products (lotions, body milks) is demineralised water. Such water is considered to be unsaturated and it, as any other substance in nature, tends to the optimal concentration of mineral substances (120 to 180 mgl), so it binds molecules from the body, i.e. it ΓÇ£steals themΓÇ¥ and washes them outΓÇª 20% of the composition are usually various chemically obtained ingredients that are necessary if a product contains water ΓÇô preservatives, emulsifiers, and, as a rule, synthetic fragrances, artificial colours, bleaches. As an example, if a person applies such body milk on daily basis and uses 250ml of it per week, in 20 yearsΓÇÖ time heshe will intake 200 litres of demineralised water in hisher body (that ΓÇ£stealsΓÇ¥ about 30,000 mg of valuable minerals) and 50 kg of various non-natural ingredients. The body casts a good portion of those toxic substances, but a part of them remains permanently deposited (it is estimated to be between 3 and 6%), which means that a person using body milk for 20 years has between 1,5 and 3 kg of toxins from that product only. The consequences of their actions may be extremely serious, ranging from mild and imperceptible disorders to significant weakening of immune system and occurrence of sever illnesses.  Use : Apply to wet skin by gentle rubing. ┬á Ingredients (INCI): Calendula Officinalis (Marigold) Oil,PerseaGratissima (Avocado) Oil,SimmondsiaChinensis (Jojoba) Seed Oil,ArganiaSpinosa (Argan) Oil, CorylusAvellana (Hazelnut) Oil,HypericumPerforatum (St. John's Wort) Oil, Olea Europaea (Olive) Oil, DaucusCarota Sativa (Carrot) Oil, PrunusDulcis (Almond) Oil, PrunusArmeniaca (Apricot) Kernel Oil, AesculusHippocastanum (Horse Chestnut) Oil, LavandulaAngustifolia (Lavender) Oil, MenthaPiperita (Peppermint) Oil.","images":{"0":"4ec04280331c57a105c193604006059e-0.jpg"}},"configuration":{},"availability":{"2110000018184":{"aditional_price":0,"availabile":285}}}