{"viewData":{"url_key":"skin-candy-anti-shock-2.html","name":"Skin Candy Anti Shock 2","sku":"2110000019327","price":"10.00","catagories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale.html"},"1":{"categoryName":"Aftercare","urlKey":"aftercare.html"}},"short_description":"anti shock is an aftercare cream designed to reduce unwanted side effects of PhiBrows, PhiContour, PhiLings and Microneedling treatments.ΓÇ⌐ΓÇ⌐This cream instantly reduces the effect of dark eyebrows or lips colour and it can be applied immediately after the treatment.","long_description":"anti shock is an aftercare cream designed to reduce unwanted side effects of PhiBrows, PhiContour, PhiLings and Microneedling treatments.ΓÇ⌐ΓÇ⌐This cream instantly reduces the effect of dark eyebrows or lips colour and it can be applied immediately after the treatment.ΓÇ⌐ΓÇ⌐Formula 2 is suitable for medium-dark to dark complexion.ΓÇ⌐ΓÇ⌐Besides camouflaging dark colour, redness and bruises, it also soothes the skin after the treatment. Due to mineral pigments of a specific structure and additional active components, the cream perfectly fits in with skin complexion and provides it with naturally healthy, even and restful appearance. Pigments have high covering ability and they stay on the skin for a long period of time. Due to their unique structure, they absorb excess sebum and adjust to the natural complexion. High-quality base contains carefully selected active components necessary for sensitive skin. ΓÇ⌐ΓÇ⌐Panthenol *Vitamin E * Witch hazel extract *Hyaluronic acid * Allantoin ┬á* Vitamin B3ΓÇ⌐ΓÇ⌐ ΓÇ⌐ΓÇ⌐Use: Apply SKIN CANDY ANTI SHOCK 2 cream after the treatment to treated, as well as other, areas of face, neck and neckline.ΓÇ⌐ΓÇ⌐  ΓÇ⌐ΓÇ⌐Ingredients: Aqua, CaprylicCapric Triglycerides, Propylene Glycol, Glycerin, Polyglyceryl-3 Methylglucose Distearate,Dicaprylyl Ether, Stearyl Alcohol, Lanolin, Glyceryl Stearate, Panthenol, Hamamelis Virginiana (Witch Hazel) Extract, Mica, Talc,Pentylene Glycol, Fructose, Urea, Citric Acid, Sodium Hydroxide, Maltose, Sodium PCA, Sodium Chloride, Sodium Lactate, Trehalose, Allantoin, Sodium Hyaluronate, Glucose, Phenoxyethanol, Ethylhexylglycerin, Tocopherol, Dimethicone, Sodium Polyacrylate, Parfum, Xanthan Gum, CI 77891, CI 77492, CI 77491, CI 77499.ΓÇ⌐ΓÇ⌐ΓÇ⌐","images":{"0":"4dabbd5f245bcd96c71cfc8ae359fa5f-0.jpg","1":"4dabbd5f245bcd96c71cfc8ae359fa5f-1.jpg"}},"configuration":{},"availability":{"2110000019327":{"aditional_price":0,"availabile":998}}}