{"viewData":{"url_key":"philuminate","name":"PhiLuminate","sku":"2110000018450","price":"12.50","categories":{"0":{"categoryName":"Phicontour","urlKey":"phicontour"},"1":{"categoryName":"Accessories","urlKey":"accessories"}},"short_description":"High quality led ringlight with 36 led beads-this ring light is made from High Quality Plastic, Durable and shockproof. 36 highlight LED beads,provide supplemental or side lighting for creative photography and videography. Dimmable ring light with three light settings-There are three light settings, Low, Medium, and High, this selfie light is perfect to use especially with the easy on and off button to adjust the brightness, the light will change significantly at each setting. It makes images much crisper and more detailed.","long_description":"High quality led ringlight with 36 led beads-this ring light is made from High Quality Plastic, Durable and shockproof. 36 highlight LED beads,provide supplemental or side lighting for creative photography and videography. Dimmable ring light with three light settings-There are three light settings, Low, Medium, and High, this selfie light is perfect to use especially with the easy on and off button to adjust the brightness, the light will change significantly at each setting. It makes images much crisper and more detailed. A clip ring light, easy to cooperate-This clip on ring light works with 2*AAA batteries(which are not included). Simply clip this the Piluminate ring onto your device, support front and back camera shooting, reaching natural light effect. Post high quality pictures or videos via social media, such as Facebook, Instagram, Snapchat, Pinterest, etc. It also can be a flashlight in a dark place or at night. Light and mini circle light with gift package-It's so lightweight and small enough to take with you anywhere you go, it can be easily carried in pocket or bag and shoot in wherever you want. Universal ring flash light-Compatible with most Smart PhonesTablets- iPhone 6s  6s Plus  6 6 Plus  5s  5c  5  4s  4, Samsung Galaxy Series like Galaxy S6, S6 Edge Plus, Note 5, LG Phones, Moto, Blackberry, HTC, Sony and iPad even MacBooks. Note: It may not clip onto a phone with one of those huge otterbox cases.┬á","images":{"0":"faf213a68c72af69aa7447a047f09f6b-0.jpg"}},"configuration":{},"availability":{"2110000018450":{"aditional_price":0,"availabile":620}}}