{"shop_name":"PhiShop","url_key":"microneedling-body-serum","name":"Microneedling Body Serum","sku":"2110000019280","price":"5.00","quantity":813,"categories":{"0":"wholesale","1":"serums"},"short_description":"Serum used for microneedling treatment of the skin of the hands, neck and neckline, performed at home. MICRONEEDLING BODY SERUM is designed for people with older skin and visible signs of ageing. It contains an effective combination of hyaluronic acid and natural components which restores the surface layer, alleviates skin changes caused by ageing, sun rays exposure, etc.","long_description":"MICRONEEDLING BODY SERUM is used with MICRONEEDLING APPLICATOR, specially designed to achieve maximum possible effects at home conditions. Special design with MICRONEEDLING SERUM reservoir provides ideal serum dosing and its complete absorption. Absorption active substances contained in the serum is up to 500% higher compared to regular application of the cosmetic product.\rHyaluronic acid is the key molecule in the skin ageing process. It has exceptional water binding ability which maintains optimum moisture and elasticity of the skin.\rGreen tea extract, due to antioxidative action of catechin compounds, neutralizes harmful effects of free radicals and harmful environmental influences, especially UV radiation, thus slowing down the process of skin ageing and the appearance of wrinkles.\rMango extract nourishes, softens and revitalizes the skin. It neutralizes free radicals in the skin and acts to improve skin microcirculation, which improves the exchange of nutrients in the skin cells, so that it becomes smooth, soft and elastic.\rMarine chamomile extract establishes natural balance and, at the same time, moisturizes, nourishes and slows down skin ageing process. Due to active substances such as alpha bisabolol, chamazulene and flavonoids, marine chamomile extract acts anti-inflammatory and antimicrobial, soothes irritated skin and stimulates its regeneration.","images":{"0":"f68ffa0817e2f28211da5442520015cf-0.jpg"}}
