{"shop_name":"PhiShop","url_key":"skin-candy-after-laser-treatment-gel-10ml-9pcs","name":"Skin Candy After PhiLaser Treatment Gel 10ml 9pcs","sku":"2113000038664","price":"45.00","quantity":660,"categories":{"0":"wholesale","1":"aftercare"},"short_description":"Skin Candy After Laser Treatment Gel is highly recommended for additional skin care after PhiLaser treatment. This gel has a cooling effect and the ingredients of this rich complex are known for their stimulation of regenerative processes.","long_description":"This complex composition stimulates regenerative processes that result in faster repair of skin barrier, stimulation of collagen synthesis and hyaluronic acid stimulation. Skin Candy After Laser Gel contains active cosmetic ingredients that are essential for the recovery and vitality of the skin.\rWith refreshing and cooling effect, Witch hazel makes an ideal ingredient for after-laser treatments, as it reduces swelling and calms signs of irritation and redness.\rSea chamomile, well known for its calming aroma, has anti-inflammatory, anti-bacterial and anti-fungal properties. It soothes and heals burns, increasing the penetration and effectiveness of other skincare topicals.\rAloe vera has been known for its healing properties. Aloe vera will help to remove the heat from the skin and reduce any lasting irritation. Also, it provides a protective layer to the skin which helps retain moisture. Because of its nutritional qualities and antioxidant properties, the skin heals more quickly.\rPanthenol helps in nourishing and adds vital moisture to skin, by sealing in hydration and by boosting the skin barrier. Panthenol is also effective as a skin nutrient with its ability to manage the healthy levels of fibroblasts – the most prolific cells in our skin’s connective tissue – which in turn boosts collagen and elastin, the proteins that help keep skin luminous, elastic and toned.The anti-bacterial properties of Tea tree oil make it an effective wound healer. The anti-inflammatory effect of Tea tree oil helps to soothe and relieve painful and irritated skin. It may also help in reducing redness and swelling.","images":{"0":"c0c5f867091a574c61f7fbffa5b6d9d5-0.jpg","1":"c0c5f867091a574c61f7fbffa5b6d9d5-1.jpg"}}
