{"viewData":{"url_key":"royal-care-cream-30ml-9pcs","name":"Royal Care Cream 30ml 9pcs","sku":"2113000018659","price":"675.00","categories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale"},"1":{"categoryName":"Creams","urlKey":"creams"}},"short_description":"There is nothing as sublime as its flower, classy as its attitude; it smells wonderful and its touch is the most sensitive in the worldΓÇª PhiAcademy, as a part of its portfolio, proudly presents a unique product Phi Royal Care, whose main active component is rose oil. Rose is a great ally in the fight against wrinkles. Essential rose oilis obtained by steam distillation of fresh petals, picked manually in dawn, before sunrise. Rose oil is a very expensive essential oil and 4 to 5 tons of rose petals are necessary to get 1kg of it. Rose is ideal for sensitive and mature skin care.Its most popular result is the preservation of skin youthfulness, due to the special impact on the upper, i.e. surface parts of the epidermis. Rose oil is rich in vitamins C, B and E, unsaturated fatty acids, including rarely present gamma-linolenic acid. It is excellent for all skin types, particularly for extremely dry skin renewal. It nourishes and regenerates the skin, restores its balance, protects it from dehydration, simulates blood circulation, provides perfect tone. It helps the fight against wrinkles and slows down the aging process of the skin.","long_description":"There is nothing as sublime as its flower, classy as its attitude; it smells wonderful and its touch is the most sensitive in the worldΓÇª PhiAcademy, as a part of its portfolio, proudly presents a unique product Phi Royal Care, whose main active component is rose oil. Rose is a great ally in the fight against wrinkles. Essential rose oilis obtained by steam distillation of fresh petals, picked manually in dawn, before sunrise. Rose oil is a very expensive essential oil and 4 to 5 tons of rose petals are necessary to get 1kg of it. Rose is ideal for sensitive and mature skin care.Its most popular result is the preservation of skin youthfulness, due to the special impact on the upper, i.e. surface parts of the epidermis. Rose oil is rich in vitamins C, B and E, unsaturated fatty acids, including rarely present gamma-linolenic acid. It is excellent for all skin types, particularly for extremely dry skin renewal. It nourishes and regenerates the skin, restores its balance, protects it from dehydration, simulates blood circulation, provides perfect tone. It helps the fight against wrinkles and slows down the aging process of the skin. Phi Royal Care also contains natural coenzyme Q10, contained by all cells in our body. Our body produces this coenzyme in sufficient quantities until the age of 30. Its production reduces with aging, so it is compensated by food or food supplements. Known as the vitamin of youth ΓÇô it acts as an antioxidant, neutralising the effects of free radicals that damage the cells and cause the aging of the skin. Q10 provides the skin cells with the energy necessary for protection and regeneration. Due to a careful selection of ingredients, in addition to essential rose oil and natural coenzyme Q10, other components of the product are the ΓÇ£championsΓÇ¥ in the fight against the aging of the skin: Bee Wax, Cocoa Butter, Shi Butter, cold pressed plant oils of carrot, avocado, grape seed, olive fruit and leaf, soy, wild marine pomegranate, essential oils of immortelle, artemisia, rosemary, lavender. Phi Royal Care does not contain water, preservatives, emulsifiers, synthetic fragrances, or any other synthetic substances. The cream has a very pleasant scent. Phi Royal Care is intended for both men and women over 30 for all skin types. Use:Apply to wet skin by gentle rubbing. ┬á Ingredients (INCI):CeraAlba, Theobroma Cocoa (Cocoa) Seed Butter, Butyrospermum, PerseaGratissima(Avocado)Oil, VitisVinifera (Grape) Seed Oil, PunicaGranatum (Pomegranate) Seed Oil, Glycine Soja (Soybean) Oil, DaucusCarota Sativa (Carrot) Oil, Olea Europaea (Olive) Fruit Oil, Olea Europaea (Olive) Leaf Oil, Ubiquinone, Rosa Damascena (Rose) Oil, LavandulaAngustifolia (Lavender) Oil, HelichrysumItalicum Oil, Rosmarinus Officinalis (Rosemary) Oil, Artemisia Annua(Artemisiaannua) Oil. ┬á ┬á ┬á Best before: date printed on the packaging Country of origin: Serbia ┬á Produced by: PhiAcademy GmbH, Gartengasse 88, 1050 Vienna, Austria ┬á Volume: 5 ml, 30 ml ┬á  Bar code:8606108563137 (5ml) 8606108563144 (30ml) ┬á ┬á","images":{"0":"eb50567878617b5699e35e5c6c90c4ae-0.jpg"}},"configuration":{},"availability":{"2113000018659":{"aditional_price":0,"availabile":675}}}