{"shop_name":"PhiShop","url_key":"phicare-cream-5ml-9pcs","name":"PhiCare Cream 5ml 9pcs","sku":"2113000018611","price":"31.50","quantity":965,"categories":{"0":"wholesale","1":"creams"},"short_description":"Everything that your skin needs on daily basis throughout the year – the ultimate care that preserves your beauty…\rPhiAcademy, as a part of its portfolio, presents a unique product PhiCare consisting of one hundred percent natural active components. The product does not contain chemical or synthetic ingredients and it is based on bee wax. It has been scientifically proven that bee products may slow down the aging process of the skin and contribute to regeneration of its structure.Bee wax contains vitamins A and F that play an important role in the preservation of skin vitality","long_description":"Everything that your skin needs on daily basis throughout the year – the ultimate care that preserves your beauty…\rPhiAcademy, as a part of its portfolio, presents a unique product PhiCare consisting of one hundred percent natural active components. The product does not contain chemical or synthetic ingredients and it is based on bee wax. It has been scientifically proven that bee products may slow down the aging process of the skin and contribute to regeneration of its structure.Bee wax contains vitamins A and F that play an important role in the preservation of skin vitality.\rThis product is particularly suitable for use after the exposure of the face and body parts skin to extreme external influences of cold or hot air (winter sports, sun exposure or swimming). Bee wax protects the skin from dehydration and helps its regeneration after micro damages caused by shaving, waxing, irritations, chapped skin or various abrasive treatments.\rIngredients: Jojoba Oil, Almond Oil, Cocoa Butter, Shi Butter, Honey, Propolis, Bee Wax, Pollen, Royal Jelly, Calendula Oil, Carnauba Wax, Tochopherol (Vitamin E) of plant origin, Carrot Oil, Avocado Oil, Lavender Oil, Mint Oil, Rosemary Oil. \rPhiCare is intended for women, men and children, with no age restrictions.\rUse: Apply to wet skin by gentle rubbing.\r \rIngredients (INCI):Simmondsia Chinensis (Jojoba) Seed Oil, Prunus Dulcis (Almond) Oil, Theobroma Cocoa (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Cera Alba, Mel, Copernicia Cerifera (Carnauba) Wax, Daucus Carota Sativa (Carrot) Oil, Persea Gratissima (Avocado) Oil, Tocopherol, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Oil, Mentha Piperita (Peppermint) Oil, Propolis, Pollen, Royal Jelly.\r \r \r \rBest before: date printed on the packaging\rCountry of origin: Serbia\r \rProduced by: PhiAcademy GmbH, Gartengasse 88, 1050 Vienna, Austria\r \rVolume: 5 ml, 30 ml\r  \rBar code:8606108563113 (5ml) 8606108563120 (30ml)\r \r ","images":{"0":"5bb4e35b88d84a92dbf7188cc200f7fa-0.jpg"}}
