{"viewData":{"url_key":"tango-cream-30ml-9pcs","name":"Tango Cream 30ml - 9pcs","sku":"2113000018154","price":"75.00","categories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale"},"1":{"categoryName":"Creams","urlKey":"creams"}},"short_description":"Phi Tango cream is a cream for daily facial care intended for mature and dry skin. Its composition is a fusion of natural and synthetic ingredients in golden proportion (1:1.618). This ideal proportion makes it effective for all skin types of different levels of sensitivity. Use: Apply the cream to cleansed facial skin in the morning and in the evening.","long_description":"Phi Tango cream is a cream for daily facial care intended for mature and dry skin. Its composition is a fusion of natural and synthetic ingredients in golden proportion (1:1.618). This ideal proportion makes it effective for all skin types of different levels of sensitivity. It deeply nourishes the skin and increases its strength, elasticity and resistance. It represents intense care with visible effects of reducing wrinkles. Formulation with high content of hyaluronic acid demonstrates its effectiveness in the fight against wrinkles by reducing the existing wrinkles and slowing down the appearance of new ones. Gentle, fast absorbing base is enriched with active components with multiple effects. Hydrating complex acts as a molecular sponge that binds water, proteins and mucopolysaccharides, thus increasing the volume by filling the skin from inside outwards. Hydroxyproline amino acid tightens the skin and restores its original tone. Avocado oilsignificantly increases the amount of collagen which helps creating natural barrier against wrinkles and other signs of skin ageing. Soybean oil acts as an antioxidant, compensates for lipids and makes the skin soft and smooth. It revitalizes the cells completely due to its easy penetration into the skin. Jojoba oil is chemically very similar to skin sebum. It prevents the formation of wrinkles as it regulates sebum secretion and also nourishes the skin deeply. Cereal germ oil is a rich natural source of vitamins E, A and D, minerals and essential fatty acids. It stimulates metabolism and protects skin cells from damage. Vitamin E is a powerful antioxidant which prevents degradation of collagen under the influence of free radicals.  Use: Apply the cream to cleansed facial skin in the morning and in the evening.  Ingredients: Aqua, CaprylicCapric Triglyceride, Cetearyl Octanoate, Glycerin, Polyglyceryl-3 Methylglucose Distearate, Cetyl Alcohol, Glyceryl Stearate SE, Cera Alba, Hydroxyethyl AcrylateSodium Acryloyldimethyl Taurate Copolymer, Squalane, Polysorbate 60, Pentylene Glycol, Fructose, Urea, Citric Acid, Sodium Hydroxide, Maltose, Sodium PCA, Sodium Chloride, Sodium Lactate, Trehalose, Allantoin, Sodium Hyaluronate, Glucose, Phenoxyethanol, Ethylhexylglycerin, Dipalmitoyl Hydroxyprolin, Persea Gratissima (Avocado) Oil, Triticum Vulgare (Wheat) Germ Oil Glycine Soja (Soybean) Oil Simmondsia Chinensis (Jojoba) Seed Oil, Tocopherol, Lavandula Angustifolia (Lavender) Oil, Xantan Gum, Propylene Glycol, BHT, Ascorbyl Palmitate, Glyceryl Stearate, Glyceryl Distearate.","images":{"0":"35e7d7ae60e4b8fe8609cc74002b0552-0.jpg","1":"35e7d7ae60e4b8fe8609cc74002b0552-1.jpg","2":"35e7d7ae60e4b8fe8609cc74002b0552-2.jpg","3":"35e7d7ae60e4b8fe8609cc74002b0552-3.jpg"}},"configuration":{},"availability":{"2113000018154":{"aditional_price":0,"availabile":898}}}