{"viewData":{"url_key":"tango-face-mask-9pcs","name":"Tango Face Mask 9pcs","sku":"2113000031719","price":"80.00","categories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale"},"1":{"categoryName":"Aftercare","urlKey":"aftercare"}},"short_description":"This mask instantly hydrates and soothes tired and dull skin upon contact. It is intended for mature skin and dry skin trying to remain healthy and nourished balance.┬áContains 5pcs in Box","long_description":"This mask instantly hydrates and soothes tired and dull skin upon contact. It is intended for mature skin and dry skin trying to remain healthy and nourished balance. With high concentration of hyaluronic acid, the skin is revitalized and renewed immediately, resulting in a noticeably smoother complexion. The mask formula contains special antioxidant blend to boost skinΓÇÖs natural levels of hyaluronic acid, providing regeneration and boosting skinΓÇÖs moisture preventing wrinkles and acting on the existing ones. One of the key ingredients in this mask is colagen. Also known as a youth protein for the skin, colagen is essential to maintaining skinΓÇÖs strength and healthy balance. It accelerates the turnover of skin cells and revitalizes the skin with an instant lifting effect. Contains 5pcs in Box Use: After cleansing your skin, remove the mask from packaging and place carefully around eyes, lips and nose and than adjust it on the neck, tightening it lightly and attach it to the ears. Leave the mask around 15-20 minutes so the active components can get absorbed in the skin. After removing the mask leaves an essential film of ingredients to massage the skin and boost circulation. Massage it into the skin with gentle upward motions. This will help it increase the blood flow to the affected areas, helping you get a natural glow and healthier complexion. For getting the best results, use the mask 3 days in a row. To maintain the effects, can be used on a weekly basis.","images":{"0":"7807b792dee94570b8678d725a0dd271-0.jpg","1":"7807b792dee94570b8678d725a0dd271-1.jpg","2":"7807b792dee94570b8678d725a0dd271-2.jpg"}},"configuration":{},"availability":{"2113000031719":{"aditional_price":0,"availabile":886}}}