{"shop_name":"PhiShop","url_key":"phitopic-cream-10ml-9pcs","name":"PhiTopic Cream 10ml 9pcs","sku":"2113000018581","price":"45.00","quantity":223,"categories":{"0":"wholesale","1":"aftercare"},"short_description":"Designed for care and recovery of damaged and sensitive skin before treatments such as PhiBrows, PhiLashes, PhiContour, PhiLings, etc. High-quality base contains an effective combination of active ingredients that preserve the protective barrier, prevent skin drying and stimulate its regeneration.","long_description":"Designed for care and recovery of damaged and sensitive skin before treatments such as PhiBrows, PhiLashes, PhiContour, PhiLings, etc. High-quality base contains an effective combination of active ingredients that preserve the protective barrier, prevent skin drying and stimulate its regeneration. The velvety, non-greasy formula provides long-lasting hydration to very dry skin by sealing in moisture and helping to restore the skin barrier. Cream hydrates, soothes and reduces roughness while relieving itchy and tight skin. Skin feels soft and noticeably smoothed. The high quality base with skin specific phospholipides, rich in natural emollients (Shea butter and Almond oil), easily applied and absorbed onto the skin. Shea butter restores the hydro-lipid protective layer of the skin and inhibits the transepidermal water loss. Itdeeply penetrates into the skin, nourishing it intensively and improving circulation, making it smooth and soft. Very high in Vitamin E, almond oil is an excellent emollient and lubricator for dry skin. This oil has also been proven to have a calming effect on dry, iritated skin. Hydrating complex provides an immediate supply of hydration bringing back to normal the natural moisture balance of skin and boosting its own capacity to retain water for longer.  It provides nutrition and stimulation for long term healthy look and  feel, even for dry and sensitive skin. Niacinamide increases free fatty acid ceramide levels in the skin, stimulates micro-circulation in the dermis, and prevents the skin from losing water. Panthenol has excellent regenerative properties, establishes and maintains the natural moisture, softness and elasticity of the skin. Vitamin E  protects the cells and cell membranes from free-radical and environmental oxidative stress. It is required for healthy collagen in the skin – which is the support system in the skin and helps the skin to remain firm and healthy. The cream strengthens the natural defenses of skin, making it smooth, protected and healthy since the first application. Paraben and colorants free.\rUse: Apply the cream in the morning and in the evening on clean skin. Suitable for face and body.\rIngredients (INCI): Aqua, CaprylicCapric Triglycerides, Glycerin, Panthenol, Butyrospermum Parkii (Shea) Butter, Lanolin, Polyglyceryl-3 Methylglucose Distearate, Cetearyl Ethylhexanoate, Stearyl Alcohol, Glyceryl Stearate SE, Niacinamide, Pentylene Glycol, Fructose, Urea, Citric Acid, Sodium Hydroxide, Maltose, Sodium PCA, Sodium Chloride, Sodium Lactate, Trehalose, Allantoin, Sodium Hyaluronate, Glucose, Prunus Amygdalus Dulcis (Sweet Almond)Oil, Phenoxyethanol, Ethylhexylglycerin, Tocopherol, Dimethicone, Parfum, Xanthan Gum.","images":{"0":"78126ec2c4b6a66da97b27e9de72b77b-0.jpg","1":"78126ec2c4b6a66da97b27e9de72b77b-1.jpg"}}
