{"viewData":{"url_key":"skin-candy-sun-sweat-protection-9pcs","name":"Skin Candy Sun&Sweat Protection 9pcs","sku":"2113000019458","price":"45.00","categories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale"},"1":{"categoryName":"Aftercare","urlKey":"aftercare"}},"short_description":"This is an aftercare cream designed to prevent extreme conditions from affecting the quality and intensity of colour after PhiBrows and Phicontour treatments. It is intended for people who  sweat extensively due to different body factors of trainings plan to be exposed to sun immediately after the treatment","long_description":"This is an aftercare cream designed to prevent extreme conditions from affecting the quality and intensity of colour after PhiBrows and Phicontour treatments. It is intended for people who  sweat extensively due to different body factors of trainings plan to be exposed to sun immediately after the treatment  Optionally balanced combination of UVA and UVB filters provides tattooed skin with exceptionally high protection from harmful effects of sun rays. Also provide absorbtion of moisture (sweat), excess sebum, thus provide pigments from degradation. It preserves tattoo colour intensity and reduces the risk of allergies and irritations. It nourishes the skin intensely, provides it with exceptional moisture and softness and prevents skin drying and ageing. It is easy to spread and it leaves no greasy as well as white traces on the skin.  Panthenol *Vitamin E *Allantoin * Calendula extract *Jojoba oil  Use: Apply the cream 3 to 5 times a day, 7 days after the treatment. After 7 days, it can be applied only when necessary, 15 minutes before sun exposure or workout.   Provides double protection of pigments from degradation and fading Provides very high protection from harmful effects of sun rays Preserves colour intensity Nourishes the skin, providing it with exceptional moisture and softness Restores hydrolipid proactive skin layer Easy to spread, without greasy and white traces on the skin Does not contain allergens and harmful ingredients Waterproof   Ingredients: Aqua, Homosalate, Octocrylene, C12-15 Alkyl Benzoate, Ethylhexyl Methoxycinnamate, Ethylhexyl Salicylate, Butyl Methoxydibenzoylmethane, Archidyl Alcohol, Behenyl Alcohol, Arachidyl Glucoside, TrimethylpentanediolAdipic AcidGlycerin Crosspolymer, Glyceryl Stearate, PEG-100 Stearate, Titanium Dioxide, Silica, DCetyl Alcohol, Panthenol, Tocophery Acetate, Calendula Officinalis Flower Extract, Allantoin, Simmondsia Chinensis (Jojoba) Seed Oil, Phenoxyethanol, Methylparaben, Butylparaben, Ethylparaben, Propylparaben, Parfum, Xanthan Gum, Sodium Polyacrylate, Tetrasodium EDTA.","images":{"0":"4cfb41bf8bad4ccf9738b300a91441e5-0.jpg","1":"4cfb41bf8bad4ccf9738b300a91441e5-1.jpg"}},"configuration":{},"availability":{"2113000019458":{"aditional_price":0,"availabile":362}}}