{"shop_name":"PhiShop","url_key":"skin-candy-scar-protecton-9pcs","name":"Skin Candy Scar Protection Gel 9pcs","sku":"2113000019410","price":"45.00","quantity":976,"categories":{"0":"wholesale","1":"aftercare"},"short_description":"Each micro damage on the skin made with a needle, machine or blade leaves a small change in skin structure. It is well-known that such tissue absorbs new pigment with more difficulty. \rIn order to postpone scar tissue build-ups by minimizing fibrous tissue reaction, PhiAcademy has designed Skin Candy Scar Protection  whose special formula at the same time promotes healing and dissolves very excessive fibrous molecule, enabling the skin to maintain its natural healthy structure and elasticity.","long_description":" Each micro damage on the skin made with a needle, machine or blade leaves a small change in skin structure. It is well-known that such tissue absorbs new pigment with more difficulty. In order to postpone scar tissue build-ups by minimizing fibrous tissue reaction, PhiAcademy has designed scar protection cream whose special formula at the same time promotes healing and dissolves very excessive fibrous molecule, enabling the skin to maintain its natural healthy structure and elasticity.The effectiveness of scar protection is based on incredible regenerative abilities of snail secretion extract. Snail secretion filtrate contains peptides which form pores in the microbiological membrane and trigger skin regeneration. In addition to peptides, the filtrate is rich in collagen, vitamins, glycolic acid which efficiently prevents oxidation, provides deep hydration and promotes restoring healthy and elastic skin, allantoin, antioxidants and anti-inflammatory proteins, coenzymes, immunomodulators and substances for cell communication, which makes it suitable for many skin conditions, such as scars, acne, eczema, rosacea, dark spots, wrinkles, dry and oily skin. Snail secretion filtrate acts as an activator of biological elimination of dead and damaged skin cells and healthy cells restoration. It promotes skin recovery and appearance and reduction of wrinkles, it makes the skin firmer by restoring glycosaminoglycans in the skin. Skin Candy scar protection is a mandatory part of post-treatment flow 7 days after the following treatments: PhiBrows- PhiContour- PhiLings- and it can also be used on existing scars.\rUse: Apply 7 days after treatment , 1 to 2 times a day, for 3 weeks continuously.\rIngredients: Aqua, Snail Secretion Filtrate (Helix Aspersa Muller), Panthenol, Glycerin, Pentylene Glycol, Fructose, Urea, Citric Acid, Sodium Hydroxide, Maltose, Sodium PCA, Sodium Chloride, Sodium Lactate, Trehalose, Allantoin, Sodium Hyaluronate, Glucose, PEG-40 Hydrogenated Castor Oil, Phenoxyethanol, Ethylhexylglycerin, AcrylatesC10-30 Alkyl Acrylate Crosspolymer, Lavandula Angustifolia (Lavender) Oil, Tetrasodium EDTA, Sodium Hydroxide.","images":{"0":"2062fc593f3822d640e248d9f35e626b-0.jpg","1":"2062fc593f3822d640e248d9f35e626b-1.jpg"}}
