{"viewData":{"url_key":"jive-cream-30ml-9pcs","name":"Jive Cream 30ml - 9pcs","sku":"2113000018147","price":"75.00","categories":{"0":{"categoryName":"Wholesale","urlKey":"wholesale"},"1":{"categoryName":"Creams","urlKey":"creams"}},"short_description":"Phi Jive cream is a cream for daily care of facial skin intended for young, oily and problematic skin. Its composition is a fusion of natural and synthetic components in golden proportion (1:1.618). This ideal proportion makes it effective for all skin types of different levels of senstivity.┬áUse: Apply the cream to cleansed facial skin in the morning and in the evening.","long_description":"Phi Jive cream is a cream for daily care of facial skin intended for young, oily and problematic skin. Its composition is a fusion of natural and synthetic components in golden proportion (1:1.618). This ideal proportion makes it effective for all skin types of different levels of senstivity. Jive cream represents intensive care for oily and problematic skin with visible effects of skin mattifying and reducing acne and pimples. Formulation with high content of hyaluronic acid has proved its effectiveness in the fight against acne. Due to its specific structure, hyaluronic acid affects skin surface, thus preventing it from drying out, while simultaneously penetrating into deeper layers and achieving hydration, firmness and elasticity. Extremely light cream gel contains mattifying complex which absorbs excess sebum and enables easy and even application of the product. Due to the specific structure of molecules that slide across the skin surface making it extremely soft and velvety. Natural active components instantly calm and soothe hypersensitive skin, providing it with long-term care and protection. Panthenol has exceptional regenerative properties, it establishes and maintains natural moisture, softness and elasticity of the skin. Witch hazel extract, rich in tannins and flavonoids, has good anti-inflammatory, analgesic and astringent action. It tightens the pores and soothes the skin after inflammation. Cucumber extract intensely soothes and refreshes the skin.  Use: Apply the cream to cleansed facial skin in the morning and in the evening.  Ingredients: Aqua, Dicaprylyl Ether, Glycerin, CaprylicCapric Triglyceride, Cetearyl Isononanoate, Methyl Metacrylate Crosspolymer, Hamamelis Virginiana (Witch Hazel) Extract, Cucumis Sativus (Cucumber) Fruit Extract, Cetyl Alcohol, Potassium Cetyl Phosphate, Hydrogenated Palm Glycerides, Glyceryl Stearate, Sodium AcrylateSodium Acryloyldimethyl Taurate Copolymer, Phenoxyethanol, Ethylhexylglycerin Panthenol, Dimethicone, Sodium Hyaluronate, Xanthan Gum, Lavandula Angustifolia (Lavender) Oil.","images":{"0":"2c7a586a814d566559bb0dfed8664868-0.jpg","1":"2c7a586a814d566559bb0dfed8664868-1.jpg","2":"2c7a586a814d566559bb0dfed8664868-2.jpg","3":"2c7a586a814d566559bb0dfed8664868-3.jpg"}},"configuration":{},"availability":{"2113000018147":{"aditional_price":0,"availabile":143}}}