{"shop_name":"PhiShop","name":"DR. PHI ANTIOXIDANT 301 capsules","price":"€7.00","quantity":979,"categories":"dr-phi, supplements","description":"        The ingredients of this preparation contribute to the removal of toxins from the body.Taurine, raspberry ketones and green coffee extracts have detoxifying properties, while vitamin C contributes to the establishment of normal metabolism and the protection of cells from oxidative stress and damage. Combined, they accelerate metabolism, remove toxins from the body and thereby reduce the feeling of fatigue and weakness.Taurine acts as an antioxidant, has the role of stabilizing cell membranes and is of great importance for the functioning of the entire nervous system. It also regulates the level of calcium inside the cells and thus protects the heart muscle from interference and damage and also participates in the regulation of blood pressure. It also participates in the absorption of sodium and magnesium.Raspberry ketones very beneficially affect the human body and affect exclusively the fat cells and prevent weight gain after a diet containing extremely high levels of fat.Green coffee plays an important role in preserving health because it lowers blood sugar levels and fights free radicals in the body, making it healthier. It increases energy and has a beneficial effect on accumulated and excess fat in the body and body kilograms. It helps accelerate metabolism and contributes to maintaining normal body weight.Dietary supplements are not a substitute for balanced and varied nutrition. The capsules are of plant origin and are suitable for vegetarians and vegans.How to use: Oral use, 2 capsules daily. No chewing, with enough water. Active ingredients: TAURINE, RASPBERRY KETONE, VITAMIN C (L-ASCORBIC ACID), GREEN COFFEE BEAN DRY EXTRACT (COFFEA SPP) (CHLOROGENIC ACID ≥ 50%, CAFFEINE ≤ 5%).Other ingredients: MALTODEXTRIN, CORN STARCH, MAGNESIUM STEARATE (E 470B), TALC (E 553B), CAPSULE - HYDROXYPROPYLMETHYLCELLULOSE (E 464), CAPSULES - CHLOROPHYLL COPPER COMPLEX (E 141II)","img":"/img/0bff3d2eb6f16ee1718a760fffd831ac.jpg"}
