{"shop_name":"PhiShop","name":"Master Care Cream 5ml","price":"€36.00","quantity":202,"categories":"wholesale, creams","description":"        Unique and extraordinary combination of natural component, dominated by CBD (from Hemp oil) and Rose essential oil PhiAcademy, as a part of its portfolio, proudly presents a unique product Phi Master Care, whose main active component is hemp oil (Cannabidiol). Hemp seed oil is valued due to its high content of essential fatty acids, which helps the action of hydrolipidic film, reducingtransepidermal water loss. Researches show that CBD is an extremely powerful stimulator of lysyl hydroxylase – enzyme necessary for formation and stabilisation of collagen. Protecting the skin from free radicals, like UV rays, smoke and environmental pollutants, it is crusialin having younger looking skin. Phi Master Care also contains Rose essential oil and natural coenzyme Q10. Rose essential oil nourishes and regenerates the skin, restores balance and protects it from drying out, stimulates blood circulation and helps in the fight against wrinkles and skin aging. Natural coenzyme Q10 provides the skin cells with the energy necessary for protection and regeneration. Phi Master Care does not contain water, preservatives, emulsifiers, synthetic fragrances, or any other synthetic substances. The cream has a very pleasant scent. Phi Master Care is intended for both men and women over 30 for all skin types.Use: Apply the product every evening before going to bed to previously cleansed face and eye zone Ingredients: Ingredients (INCI): Cera Alba, Theobroma Cocoa (Cocoa) Seed Butter, Butyrospermum, Parkii (Shea) Butter, PerseaGratissima (Avocado) Oil, VitisVinifera (Grape) Seed Oil, PunicaGranatum (Pomegranate) Seed Oil, Glycine Soja (Soybean) Oil, DaucusCarota Sativa (Carrot) Oil, Olea Europaea (Olive) Fruit Oil, Olea Europaea (Olive) Leaf Oil, Ubiquinone, Rosa Damascena (Rose) Oil, LavandulaAngustifolia (Lavender) Oil, HelichrysumItalicum Oil, Rosmarinus Officinalis (Rosemary) Oil, Artemisia Annua (Artemisia annua) Oil, Olibanum (Frankincense) Oil, CinnamomumZeylanicum (Ceylon Cinnamon) Oil, Cannabis Sativa Oil. Best before: date printed on the packaging 5 ml  ","img":"/img/78a662d57f2d265d12c924131c5f0613.jpg"}
