{"shop_name":"PhiShop","name":"Skin Candy Sun&Sweat Protection","price":"€10.00","quantity":995,"categories":"wholesale, aftercare","description":"        This is an aftercare cream designed to prevent extreme conditions from affecting the qualityand intensity of colour after PhiBrows and Phicontour treatments. It is intended for people whosweat extensively due to different body factors of trainingsplan to be exposed to sun immediately after the treatmentOptionally balanced combination of UVA and UVB filters provides tattooed skin with exceptionallyhigh protection from harmful effects of sun rays. Also provide absorbtion of moisture (sweat),excess sebum, thus provide pigments from degradation. It preserves tattoo colour intensityand reduces the risk of allergies and irritations. It nourishes the skin intensely, provides itwith exceptional moisture and softness and prevents skin drying and ageing. It is easy to spreadand it leaves no greasy as well as white traces on the skin.Panthenol *Vitamin E *Allantoin * Calendula extract *Jojoba oilUse: Apply the cream 3 to 5 times a day, 7 days after the treatment.After 7 days, it can be applied only when necessary, 15 minutesbefore sun exposure or workout.Provides double protection of pigments from degradation and fadingProvides very high protection from harmful effects of sun raysPreserves colour intensityNourishes the skin, providing it with exceptional moisture and softnessRestores hydrolipid proactive skin layerEasy to spread, without greasy and white traces on the skinDoes not contain allergens and harmful ingredientsWaterproofIngredients: Aqua, Homosalate, Octocrylene, C12-15 Alkyl Benzoate, EthylhexylMethoxycinnamate, Ethylhexyl Salicylate, Butyl Methoxydibenzoylmethane, Archidyl Alcohol,Behenyl Alcohol, Arachidyl Glucoside, TrimethylpentanediolAdipic AcidGlycerin Crosspolymer,Glyceryl Stearate, PEG-100 Stearate, Titanium Dioxide, Silica, DCetyl Alcohol, Panthenol,Tocophery Acetate, Calendula Officinalis Flower Extract, Allantoin, Simmondsia Chinensis(Jojoba) Seed Oil, Phenoxyethanol, Methylparaben, Butylparaben, Ethylparaben, Propylparaben,Parfum, Xanthan Gum, Sodium Polyacrylate, Tetrasodium EDTA.","img":"/img/88aac4de4e14f8f14ab7709cdd9c1b66.jpg"}
