{"viewData":{"url_key":"panasonic_dmc_gh4kbody_lumix_dmc_gh4_mirrorless_micro","name":"Panasonic Lumix DMC-GH4 Mirrorless Micro Four Thirds Digital Camera (Body Only)","sku":"1028453","price":"797.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Panasonic Lumix DMC-GH4 Mirrorless Micro Four Thirds Digital Camera. Panasonic GH4KBODY features 16.05 MP Digital Live MOS Sensor, DCI 4K 4096x2160 at 24p. ","long_description":"The Panasonic Lumix DMC-GH4 Mirrorless Micro Four Thirds Digital Camera is a true hybrid camera designed for both professional photo and video use. It features a 16.05-megapixel Digital Live MOS sensor and a 4-CPU Venus Engine, capable of capturing high-resolution JPEG and RAW stills, as well as UHD 4K 3840x2160 30p/24p and cinematic DCI 4K 4096x2160 video at 24p. Like its predecessor, the GH4 features a weather-sealed magnesium alloy body, while offering increased resolution on both the OLED monitor and electronic viewfinder. It also features built-in Wi-Fi with NFC technology, in-camera creative controls, and a high-speed 49-point autofocus in both photo and video mode.The GH4 delivers video quality surpassing many professional video cameras. Video can be recorded in a variety of formats, from efficient AVCHD and AVCHD Progressive, to 200 Mbps All-Intra and 100 Mbps IPB MOV and MP4 formats. And because the GH4 is a global camera, the system frequency can be switched between 59.94 Hz (23.98 Hz) and 50 Hz, yielding a variety of recording options including 23.98p, 25p, 29.97p, 50p, and 59.94p. The system can also be switched to 24 Hz to capture true 24p in HD and 4K resolutions.Video and photos are recorded to SD/SDHC/SDXC memory cards. For high bit-rate 100 Mbps and 200 Mbps formats, SDHC/SDXC UHS-I Speed Class 3 (U3) cards are supported and recommended. Video recorded to SD cards is 4:2:0 8-bit. Real-time 4:2:2 8-bit and 4:2:2 10-bit video can also be sent to an external monitor or recorder with an optional micro HDMI cable. Additional video features include focus peaking, timecode support, and cine-like gamma options. For unique expressions, VBR (Variable Frame Rate), time-lapse, and stop motion animation videos can be recording internally without the need for additional post-production processing. The GH4 comes with a rechargeable lithium-ion battery pack, battery charger with AC cable, body cap, hot shoe cover, USB cable, shoulder strap, and DVD with supplied software.","images":{"0":"28149c8a15060ba116b2c7ff4572020b-0.jpg","1":"28149c8a15060ba116b2c7ff4572020b-1.jpg","2":"28149c8a15060ba116b2c7ff4572020b-2.jpg","3":"28149c8a15060ba116b2c7ff4572020b-3.jpg"}},"configuration":{},"availability":{"1028453":{"aditional_price":0,"availabile":274}}}
