{"viewData":{"url_key":"sony_dsc_w800_b_cyber_shot_dsc_w800_digital_camera","name":"Sony Cyber-shot DSC-W800 Digital Camera (Black)","sku":"1029529","price":"88.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Cyber-shot DSC-W800 Digital Camera (Black) featuring 20.1 MP 1/2.3&quot; Super HAD CCD Sensor, Optical 5x Zoom Lens &amp; 10x Digital Zoom Equivalent 35mm Focal Length: 26-130mm. Review Sony DSC-W800","long_description":"The lightweight, black Sony DSC-W800 Digital Camera is a compact point and shoot that features 20.1 megapixels inside the 1/2.3\" Super HAD CCD sensor, and has a professional Sony 5x optical zoom lens with a 35mm equivalent focal length of 26-130mm. A bright 2.7\" Clear Photo LCD 230k-dot monitor at the back allows you to clearly view your photos and high-quality 720p HD videos.  For more zoom, a 10x digital zoom function doubles the camera's reach and Sony's SteadyShot Image Stabilization with Active mode compensates for camera shake to help provide clearer images with minimal blur and low noise, even while you stroll around. For shooting at an even wider angle, try the 360˚ Sweep Panorama, which allows you to press the shutter button and sweep your camera around to gather in your entire landscape and take many high-resolution images and automatically combine them into one photograph.  Taking pictures has never been easier. Use the camera's Easy Mode for simplifying your menu and the camera's internal guide to answer all your questions without carrying around the instruction manual. To avoid missing those smiling faces in your shots, simply turn on the Smile Shutter Technology, which takes a picture whenever a smile is detected, based on your preferences. For convenient charging, USB charging is available with the camera allowing you to charge your device right from your computer.","images":{"0":"3a1fd6b5405053107f496ca9eb62db53-0.jpg","1":"3a1fd6b5405053107f496ca9eb62db53-1.jpg","2":"3a1fd6b5405053107f496ca9eb62db53-2.jpg","3":"3a1fd6b5405053107f496ca9eb62db53-3.jpg","4":"3a1fd6b5405053107f496ca9eb62db53-4.jpg","5":"3a1fd6b5405053107f496ca9eb62db53-5.jpg","6":"3a1fd6b5405053107f496ca9eb62db53-6.jpg"}},"configuration":{},"availability":{"1029529":{"aditional_price":0,"availabile":718}}}
