{"viewData":{"url_key":"sony_cyber_shot_dsc_h300_digital_camera","name":"Sony DSC-H300 Digital Camera with Free Accessory Kit (Black)","sku":"1035254","price":"178.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony DSC-H300 Digital Camera with Free Accessory Kit (Black) featuring 16GB SDHC Memory Card, Holster Style Camera Bag. Review Sony DSC-H300","long_description":"The black Sony Cyber-shot DSC-H300 Digital Camera is a point-and-shoot camera featuring a 20.1 MP 1/2.3\" Super HAD CCD image sensor for producing high resolution still imagery and HD 720p video. This sensor is benefited by the inclusion of a long-reaching 35x optical zoom lens, giving a 35mm-equivalent focal length range of 25-875mm. For shooting in low-light conditions and when working at greater zoom magnifications, Optical SteadyShot image stabilization is available to counter the effects of camera shake.For monitoring and playback of images, as well as navigating the menu system, a 3.0\" 461k-dot Clear Photo LCD is available and offers five brightness steps to aid in viewing in bright conditions. There are also a host of camera effects to further refine the appearance of your imagery including Picture Effects, Beauty Effects, Face Detection, 360° Sweep Panorama, and iAuto mode. Additionally, the H300 is powered by 4 AA batteries.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.The Hunter 15 DSLR Holster Bag from Ruggard holds your mirrorless camera with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. ","images":{"0":"dff04cd47ac9adee28a5502123f228a2-0.jpg","1":"dff04cd47ac9adee28a5502123f228a2-1.jpg","2":"dff04cd47ac9adee28a5502123f228a2-2.jpg","3":"dff04cd47ac9adee28a5502123f228a2-3.jpg"}},"configuration":{},"availability":{"1035254":{"aditional_price":0,"availabile":262}}}
