{"viewData":{"url_key":"panasonic_lumix_dmc_fz1000_digital_camera","name":"Panasonic Lumix DMC-FZ1000 Digital Camera with Free Accessory Kit","sku":"1073850","price":"597.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-FZ1000 Digital Camera with Free Accessory Kit featuring Memory Card, Holster-Style Camera Bag. Review Panasonic DMC-FZ1000","long_description":"The Panasonic Lumix DMC-FZ1000 Digital Camera is a bridge-style point-and-shoot camera featuring a large 20.1MP 1\" High Sensitivity MOS sensor and Venus Engine image processor to enable high-resolution 4K QFHD video recording and rich still shooting up to 50 fps. The image sensor affords notable sensitivity, to an expandable ISO 25600, with a high signal-to-noise ratio for a cleaner image quality with reduced image noise. Designed for effective hybrid photo and video recording performance, the 4K output can also be used to permit in-camera 8MP screen grabs from video files for simplified multimedia output.Complementing the imaging performance is a long-reaching 16x Leica DC Vario-Elmarit zoom lens, which provides a 35mm-equivalent focal length range of 25-400mm. Covering wide-angle to telephoto perspectives, this f/2.8-4 lens incorporates aspherical and extra-low dispersion elements within its construction to realize a sharp, clear image quality with minimal chromatic aberration and distortion. HYBRID O.I.S. image stabilization further benefits working in difficult lighting conditions by minimizing the appearance of camera shake across five distinct axes. The lens also utilizes a linear AF motor, that is benefitted by Lumix Depth From Defocus technology to achieve fast focusing performance throughout the zoom range.The bridge-style design of this camera features both an electronic viewfinder and rear LCD monitor for easier viewing in an array of working situations. The 0.39\" 2,359k-dot OLED Live View Finder provides 100% frame coverage with 35mm-equivalent 0.7x magnification while the 3.0\" 921k-dot LCD monitor features a free-angle, articulating design to facilitate working from high and low angles. Additionally, the camera also features built-in Wi-Fi connectivity to support direct image transfer to, as well as remote control and monitoring capabilities from, linked smartphones and tablets.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. ","images":{"0":"a84e7da05bde76e1a136d3d61617f2a4-0.jpg","1":"a84e7da05bde76e1a136d3d61617f2a4-1.jpg","2":"a84e7da05bde76e1a136d3d61617f2a4-2.jpg","3":"a84e7da05bde76e1a136d3d61617f2a4-3.jpg"}},"configuration":{},"availability":{"1073850":{"aditional_price":0,"availabile":328}}}
