{"viewData":{"url_key":"nikon_d750_dslr_camera_body","name":"Nikon D750 DSLR Camera (Body Only)","sku":"1082599","price":"1,496.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Nikon D750 DSLR Camera (Body), Nikon D750 features 24.3MP FX-Format CMOS Sensor, EXPEED 4 Image Processor. Review Nikon DSLR Cameras, Photography","long_description":"Championing a multimedia approach to photography, Nikon's D750 DSLR is an FX-format camera well-suited to both still imaging and video recording. Featuring a 24.3MP CMOS sensor, along with the EXPEED 4 image processor, this camera is capable of producing high-resolution imagery with smooth color gradations, low noise, and sensitivity to an expandable ISO 51200, at a continuous shooting rate of up to 6.5 fps. In regard to video recording, Full HD 1080p/60 is supported, along with the ability to record uncompressed video to an optional external recorder. Working from high and low angles is possible due to the tilting 3.2\" 1,229k-dot LCD monitor or, for remote shooting, the D750 also features built-in Wi-Fi connectivity. Designed for the contemporary image-maker, this DSLR is poised to benefit still photographers and videographers alike with the versatility and performance to match any working situation.Benefitting the imaging capabilities of the D750, an equally apt 51-point AF system, with 15 cross-type points, is available and can be configured to utilize five AF points as a single focusing point in the Group Area AF setting for heightened initial subject recognition. The 3D Color Matrix Metering III system, along with the 91,000-pixel RGB sensor, also benefits the focusing abilities as well as provides accurate exposure metering to suit a vast array of subjects and lighting conditions. Furthermore, benefitting creative applications, the D750 supports in-camera creation of time-lapse movies with automated exposure smoothing, and a range of Picture Control profiles can be applied to refine the color and tonal handling of imagery.","images":{"0":"05fe416edeff2b4dcee8f69c7bd4ebfe-0.jpg","1":"05fe416edeff2b4dcee8f69c7bd4ebfe-1.jpg","2":"05fe416edeff2b4dcee8f69c7bd4ebfe-2.jpg","3":"05fe416edeff2b4dcee8f69c7bd4ebfe-3.jpg","4":"05fe416edeff2b4dcee8f69c7bd4ebfe-4.jpg","5":"05fe416edeff2b4dcee8f69c7bd4ebfe-5.jpg","6":"05fe416edeff2b4dcee8f69c7bd4ebfe-6.jpg","7":"05fe416edeff2b4dcee8f69c7bd4ebfe-7.jpg","8":"05fe416edeff2b4dcee8f69c7bd4ebfe-8.jpg","9":"05fe416edeff2b4dcee8f69c7bd4ebfe-9.jpg"}},"configuration":{},"availability":{"1082599":{"aditional_price":0,"availabile":417}}}
