{"viewData":{"url_key":"panasonic_lumix_dmc_lx100_digital_camera","name":"Panasonic Lumix DMC-LX100 Digital Camera with Accessories Kit (Black)","sku":"1092404","price":"597.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-LX100 Digital Camera with Accessories Kit (Black) featuring Memory Card, 43mm UV Filter Camera Pouch. Review Panasonic DMC-LX100","long_description":"The black Panasonic Lumix DMC-LX100 Digital Camera is an advanced Four Thirds format point-and-shoot with manual controls designed to enable and inspire creativity. It features a large multi-aspect 4/3\" type MOS sensor to produce 12.8MP still images (4:3) and 4K Ultra HD video at 30 and 24 fps. You also have the ability to extract high-resolution 8MP images from the 4K video, letting you capture entire scenes without missing a shot.  The built-in Leica DC Vario-Summilux zoom lens provides a 35mm-equivalent focal length range of 24-75mm, covering wide-angle to portrait-length perspectives. With a fast maximum aperture of f/1.7-2.8, the lens lets you work in lower light situations and provides selective focus control for shallow depth of field imagery, enhanced by a nine-bladed aperture for smooth out-of-focus rendering. When more light is needed, the camera features an integrated hot shoe, letting you use external flash units. A compact flash unit is included with the camera, matching the style and color of the body, and providing a GN of 23' (7m) at ISO 100.  The lightweight, compact body features both an electronic viewfinder and a rear LCD screen. The high-density 2,764k-dot viewfinder lets you confidently frame your shots, even in bright outdoor environments. Delivering approximately 100% of the Adobe RGB color space, the viewfinder accurately reproduces hues, so you know what you see is what you're capturing. The rear 3.0\" screen is also available, with a 921k-dot resolution. Additionally, built-in Wi-Fi connectivity with NFC allows remote camera control and image sharing from linked mobile devices using the Panasonic Image App.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.Store, transport and protect your digital mirrorless or bridge camera from moisture, dirt and dust with the black Lyra 60 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the top grab handle, handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.The Hoya 43mm UV Haze NXT HMC Filter is a general use, clear filter that helps to absorb ultraviolet light and protect the front of your lens. Its clear design allows you to pair this filter with others or leave on lenses at all times as a general protective filter. It can also help to reduce dust and moisture and keep them from reaching your lens element while providing additional protection in case of drops or situations where scratching could occur.  Hoya HMC filters are multi-coated for reducing flare, ghosting, and reflections on the filter surface. As a result, over 97% light transmission is possible in order to maintain contrast and color fidelity. The UV NXT filters are constructed from high quality, heat-resistant, high-transparency optical glass and a precision milled low-profile aluminum frame.","images":{"0":"c6984364c30fbd51481afb06ae4c74d5-0.jpg","1":"c6984364c30fbd51481afb06ae4c74d5-1.jpg","2":"c6984364c30fbd51481afb06ae4c74d5-2.jpg","3":"c6984364c30fbd51481afb06ae4c74d5-3.jpg","4":"c6984364c30fbd51481afb06ae4c74d5-4.jpg"}},"configuration":{},"availability":{"1092404":{"aditional_price":0,"availabile":230}}}
