{"viewData":{"url_key":"panasonic_dmc_zs50_b_lumix_dmc_zs50_digital_camera","name":"Panasonic Lumix DMC-ZS50 Digital Camera (Black)","sku":"1109395","price":"279.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-ZS50 Digital Camera (Black) featuring 12.1MP High Sensitivity MOS Sensor, Venus Engine Image Processor Leica DC Vario-Elmar 30x Zoom Lens. Review Panasonic DMC-ZS50","long_description":"The black Panasonic Lumix DMC-ZS50 Digital Camera is a compact point-and-shoot digital camera featuring a 12.1MP High Sensitivity MOS sensor and Venus Engine image processor to enable high-resolution still imaging and full HD 1080p video recording with noticeable low-light quality and sensitivity to an expandable ISO 6400. Fast performance is also afforded throughout the camera system, including the ability to record full-resolution imagery at up to 10 fps or 6 fps with continuous AF. Complementing the imaging performance of the camera is the built-in Leica DC Vario-Elmar 30x optical zoom lens, which provides a 35mm-equivalent focal length range of 24-720mm to suit working in a wide variety of situations. Aspherical and extra-low dispersion elements help to produce sharp, high contrast imagery and also work to minimize aberrations and distortion throughout the zoom range. Benefitting the extensive zooming capabilities of this lens is HYBRID O.I.S.+ image stabilization, which minimizes the appearance of camera shake to better support working with greater zoom magnifications or longer shutter speeds. For live view monitoring and image review, both a large 3.0\" 1,040k-dot LCD screen and 0.2\" 1,166k-dot electronic viewfinder are available. The screen also provides intuitive menu navigation for applying a host of camera settings, including Creative Control modes and Creative Panorama, as well as accessing the built-in Wi-Fi functionality. This connectivity enables instant transferring of photos or movies to linked mobile devices, and remote shooting and viewing. Further rounding out the versatile design of the camera is a Control Ring, which surrounds the lens to provide intuitive and efficient access and adjustment to some of the most oft-used camera settings and features.","images":{"0":"c3596e6b37ac2910354f973c02213b7a-0.jpg","1":"c3596e6b37ac2910354f973c02213b7a-1.jpg","2":"c3596e6b37ac2910354f973c02213b7a-2.jpg","3":"c3596e6b37ac2910354f973c02213b7a-3.jpg","4":"c3596e6b37ac2910354f973c02213b7a-4.jpg","5":"c3596e6b37ac2910354f973c02213b7a-5.jpg"}},"configuration":{},"availability":{"1109395":{"aditional_price":0,"availabile":523}}}
