{"viewData":{"url_key":"canon_0591c001_eos_rebel_t6i_dslr","name":"Canon EOS Rebel T6i DSLR Camera (Body Only)","sku":"1116100","price":"549.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS Rebel T6i DSLR Camera (Body Only) featuring 24.2MP APS-C CMOS Sensor, DIGIC 6 Image Processor 3.0&quot; 1.04m-dot Vari-Angle Touchscreen. Review Canon Rebel T6i","long_description":"Packing a high resolution 24.2-megapixel CMOS sensor and the DIGIC 6 Image Processor into a compact body is the EOS Rebel T6i DSLR Camera from Canon. This system enables shooting in a wide variety of conditions, from bright sunlight to dim indoor scenarios due to ISO performance of up to 12,800, which can be expanded to 25,600. The APS-C camera also has built-in Wi-Fi connectivity with NFC that allows for wireless transfer of images and video to social networks and cloud storage via the Camera Connect mobile app. Also, NFC enables fast connection to mobile devices as well as the CS100 Connect Station.Full HD video in MP4 format is possible with the T6i in addition to stills and it has Hybrid CMOS AF III for fast, accurate autofocus during movie shooting and during Live View. A vari-angle 3.0\" 1.04M-dot ClearView II touchscreen LCD monitor on the rear of the camera allows for versatile positioning of the camera and clear viewing, even outdoors. Additionally, the EOS scene analysis system can detect near-infrared light and flickering light sources to provide the best information for metering the scene.High speed continuous shooting at up to 5 fps ensures you will not miss a shot during fast action and this is benefited by the use of a 19-point all cross-type autofocus system. Creative filters are also available for preset looks for your photos and videos.Product Advisory: In some units of the EOS Rebel T6i white spots may exist on the optical layer which may result in the appearance of dark circular patterns on the capture image under certain shooting conditions. Potentially affected units include cameras with serials numbers of \"XXnnnnnnnnnn\" in which XX is 01 or 02. These cameras will be inspected and repaired free of charge by Canon USA.","images":{"0":"90996cebe5230335a5b67db1751d8d60-0.jpg","1":"90996cebe5230335a5b67db1751d8d60-1.jpg","2":"90996cebe5230335a5b67db1751d8d60-2.jpg","3":"90996cebe5230335a5b67db1751d8d60-3.jpg","4":"90996cebe5230335a5b67db1751d8d60-4.jpg","5":"90996cebe5230335a5b67db1751d8d60-5.jpg","6":"90996cebe5230335a5b67db1751d8d60-6.jpg","7":"90996cebe5230335a5b67db1751d8d60-7.jpg","8":"90996cebe5230335a5b67db1751d8d60-8.jpg","9":"90996cebe5230335a5b67db1751d8d60-9.jpg","10":"90996cebe5230335a5b67db1751d8d60-10.jpg","11":"90996cebe5230335a5b67db1751d8d60-11.jpg","12":"90996cebe5230335a5b67db1751d8d60-12.jpg","13":"90996cebe5230335a5b67db1751d8d60-13.jpg","14":"90996cebe5230335a5b67db1751d8d60-14.jpg","15":"90996cebe5230335a5b67db1751d8d60-15.jpg","16":"90996cebe5230335a5b67db1751d8d60-16.jpg","17":"90996cebe5230335a5b67db1751d8d60-17.jpg","18":"90996cebe5230335a5b67db1751d8d60-18.jpg","19":"90996cebe5230335a5b67db1751d8d60-19.jpg"}},"configuration":{},"availability":{"1116100":{"aditional_price":0,"availabile":601}}}
