{"viewData":{"url_key":"canon_0582c002_eos_5ds_r_dslr","name":"Canon EOS 5DS R DSLR Camera (Body Only)","sku":"1119027","price":"3,699.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Canon EOS 5DSR DSLR Camera (5DS R Camera Body) features 50.6MP Full-Frame CMOS Sensor, Dual DIGIC 6 Image Processors. ","long_description":"Providing the full resolving power of its new sensor, the EOS 5DS R DSLR Camera from Canon is a variant of the 5DS with the sensor's low-pass filter rendered neutral. By cancelling the effect of the filter, the 50.6MP sensor is enabled to deliver an even higher resolution with more intricate details. The potential downside to this is that the cancellation function brings with it the greater possibility of moiré and other color artifacts. This is a camera for those interested in the utmost resolution from the sensor and the ability to control color artifacts either in-camera or with post-processing software. This long-awaited follow-up to the vaunted 5D Mark III and brings with it new technology and a number of significant upgrades, placing it in very lofty territory for a DSLR. Featuring a full-frame 50.6MP CMOS sensor, the camera captures ultra-high resolution images suitable for large-scale printing and extensive, creative cropping. The Dual DIGIC 6 Image Processors provide the wherewithal to handle this abundance of information, enabling fast performance speeds and top-of-the-line image quality. The 5DS R also features advanced video capability including HD 1080p capture at 30 fps and a Time Lapse movie function which takes still photos at set intervals and combines them into a full HD movie. The EOS Scene Detection System with the 150,000-pixel RGB+IR metering sensor provides precise exposure and color metering and the 61-point High Density Reticular AF sensor with 41 cross-type points enables accurate AF placement and Canon's EOS iTR (Intelligent Tracking and Resolution) enhances AF performance by using information from the metering sensor. Crop shooting at 1.3x and 1.6x allows for flexibility in the size of image files created and the selection of lenses. Also, a built-in intervalometer and bulb timer expand your creative options. An advanced mirror control mechanism and new selectable shutter release lag times control camera vibration for reduced blur and quiet operation. Anti-flicker functionality compensates for flickering light sources, providing consistent exposure metering during continuous shooting. Despite its large file sizes, the 5DS R can still offer up to a 5 fps continuous shooting rate. For stable eye-level composition the 5DS R features the Intelligent Viewfinder II with 100% coverage. In addition to its clear view, a superimposed, transparent LCD is incorporated which displays setting information and offers a customizable view of focus points and grid lines. The 3.2\" ClearView II LCD monitor provides playback and live view composition with 1.04m-dot resolution and a 170º viewing angle. High-transparency materials and multi-coating resist reflections for bright viewing, especially important when shooting video. The 5DS R is a durable and multi-faceted camera for advanced use, yet its dimensions match that of the 5D Mark III. A magnesium-alloy build provides resistance to impact and the elements and inputs include a PC terminal, 3-pin input, an external microphone jack as well as HDMI out and USB 3.0 compatibility. The base plate and tripod socket have also been reinforced to reduce vibrations and ensure a secure attachment to support systems. Dual media slots for Compact Flash and SD format memory cards are supported. A customizable Quick Control System allows you to easily switch between frequently used settings and functions.","images":{"0":"760d531f923de0f7f5b5b36bfe435ce6-0.jpg","1":"760d531f923de0f7f5b5b36bfe435ce6-1.jpg","2":"760d531f923de0f7f5b5b36bfe435ce6-2.jpg","3":"760d531f923de0f7f5b5b36bfe435ce6-3.jpg","4":"760d531f923de0f7f5b5b36bfe435ce6-4.jpg","5":"760d531f923de0f7f5b5b36bfe435ce6-5.jpg","6":"760d531f923de0f7f5b5b36bfe435ce6-6.jpg","7":"760d531f923de0f7f5b5b36bfe435ce6-7.jpg","8":"760d531f923de0f7f5b5b36bfe435ce6-8.jpg","9":"760d531f923de0f7f5b5b36bfe435ce6-9.jpg","10":"760d531f923de0f7f5b5b36bfe435ce6-10.jpg","11":"760d531f923de0f7f5b5b36bfe435ce6-11.jpg","12":"760d531f923de0f7f5b5b36bfe435ce6-12.jpg","13":"760d531f923de0f7f5b5b36bfe435ce6-13.jpg","14":"760d531f923de0f7f5b5b36bfe435ce6-14.jpg"}},"configuration":{},"availability":{"1119027":{"aditional_price":0,"availabile":511}}}
