{"viewData":{"url_key":"nikon_1555_d7200_dslr_camera_with","name":"Nikon D7200 DSLR Camera with 18-140mm Lens","sku":"1127272","price":"996.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D7200 DSLR Camera with 18-140mm Lens featuring 24.2MP DX-Format CMOS Sensor, EXPEED 4 Image Processor No Optical Low-Pass Filter. Review Nikon D7200","long_description":"Poised to deliver in the most challenging of situations, Nikon's D7200 is a versatile DX-format DSLR that caters to both still photography and video users. Featuring a 24.2MP CMOS sensor which lacks an optical low-pass filter, and an EXPEED 4 image processor, the D7200 is able to record up to 6 fps at full-resolution, or 7 fps at a 1.3x crop, with a 100-frame buffer for extended high-speed shooting. This sensor and processor combination also avails a top native sensitivity of ISO 25600, which can further be expanded to black & white-dedicated ISO 51200 and ISO 102400 sensitivities. Full HD 1080p video recording is supported up to 60 fps, and in-camera time lapse shooting with automatic exposure smoothing is possible for up to 9,999 consecutive frames. In addition to the sheer imaging benefits, the D7200 also incorporates a large 3.2\" 1,229k-dot LCD monitor, dual SD card slots, and features built-in snapbridge Wi-Fi connectivity with NFC for simple linking of your mobile device. Capable of performing in both still and video realms, the D7200 is an all-around shooter that blends sophisticated imaging technologies with refined handling and design.Rounding out its feature-set, the D7200 is also characterized by an apt 51-point AF system, with 15 cross-type points, for quick and accurate focusing in a variety of conditions. The 3D Color Matrix Metering II system, which utilizes a 2,016-pixel RGB sensor, also benefits the focusing capabilities in addition to providing precise exposure metering capabilities. Further realizing a complete imaging solution, a series of Picture Control profiles can be applied to refine the color and tonal handling of imagery.Included with the D7200 body is the wide-angle to telephoto zoom AF-S DX NIKKOR 18-140mm f/3.5-5.6G ED VR lens, which features VR image stabilization to minimize camera shake to suit working in dimly-lit conditions and with longer focal lengths. One aspherical element and one extra-low dispersion element are integrated into the lens' design to minimize aberrations and optimize image sharpness and an SWM autofocus mechanism is used to acquire focus quickly, silently, and accurately.","images":{"0":"e6fbb8f47e56d1c2b7b126fb14443dfa-0.jpg","1":"e6fbb8f47e56d1c2b7b126fb14443dfa-1.jpg","2":"e6fbb8f47e56d1c2b7b126fb14443dfa-2.jpg","3":"e6fbb8f47e56d1c2b7b126fb14443dfa-3.jpg","4":"e6fbb8f47e56d1c2b7b126fb14443dfa-4.jpg","5":"e6fbb8f47e56d1c2b7b126fb14443dfa-5.jpg","6":"e6fbb8f47e56d1c2b7b126fb14443dfa-6.jpg","7":"e6fbb8f47e56d1c2b7b126fb14443dfa-7.jpg","8":"e6fbb8f47e56d1c2b7b126fb14443dfa-8.jpg"}},"configuration":{},"availability":{"1127272":{"aditional_price":0,"availabile":199}}}
