{"viewData":{"url_key":"nikon_nikon_d750_dslr_camera","name":"Nikon D750 DSLR Camera Body with Adobe Creative Cloud 12-Month Subscription Kit","sku":"1130961","price":"1,496.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D750 DSLR Camera Body with Adobe Creative Cloud 12-Month Subscription Kit featuring 24.3MP FX-Format CMOS Sensor, EXPEED 4 Image Processor 3.2&quot; 1,229k-Dot RGBW Tilting LCD Monitor. Review Nikon D750","long_description":"Championing a multimedia approach to photography, Nikon's D750 DSLR is an FX-format camera well-suited to both still imaging and video recording. Featuring a 24.3MP CMOS sensor, along with the EXPEED 4 image processor, this camera is capable of producing high-resolution imagery with smooth color gradations, low noise, and sensitivity to an expandable ISO 51200, at a continuous shooting rate of up to 6.5 fps. In regard to video recording, Full HD 1080p/60 is supported, along with the ability to record uncompressed video to an optional external recorder. Working from high and low angles is possible due to the tilting 3.2\" 1,229k-dot LCD monitor or, for remote shooting, the D750 also features built-in Wi-Fi connectivity. Designed for the contemporary image-maker, this DSLR is poised to benefit still photographers and videographers alike with the versatility and performance to match any working situation.Benefitting the imaging capabilities of the D750, an equally apt 51-point AF system, with 15 cross-type points, is available and can be configured to utilize five AF points as a single focusing point in the Group Area AF setting for heightened initial subject recognition. The 3D Color Matrix Metering III system, along with the 91,000-pixel RGB sensor, also benefits the focusing abilities as well as provides accurate exposure metering to suit a vast array of subjects and lighting conditions. Furthermore, benefitting creative applications, the D750 supports in-camera creation of time-lapse movies with automated exposure smoothing, and a range of Picture Control profiles can be applied to refine the color and tonal handling of imagery.Pairing two essential photo editing programs, this Creative Cloud Photography Plan from Adobe includes a 12-month subscription to both Photoshop and Lightroom CC, along with 20GB of online cloud storage. Designed as a comprehensive solution for photographic post-production, these two applications complement the entire range of photo editing needs, including raw image processing, file organization, retouching, and exporting tools. Additionally, this suite also enables you to work with Lightroom Mobile and Photoshop Mix for on-the-go photo editing from your mobile devices, with the ability to sync all of your work simultaneously within Lightroom catalogs across all devices. With both Photoshop and Lightroom functioning within the Creative Cloud, you are also afforded constant feature updates to ensure your programs are running with the most recent feature-set for enhanced editing capabilities. Additionally, the cloud structure also affords access to CC Learn's vast library of online content and video tutorials to help gain new skills, refine old ones, and gain a greater understanding of what both applications can do for you. This item is delivered on a card with a unique serial code for you to retrieve, activate, and validate your Photography Plan subscription.","images":{"0":"3d9388bbe5de9381abc884012dd292c7-0.jpg","1":"3d9388bbe5de9381abc884012dd292c7-1.jpg","2":"3d9388bbe5de9381abc884012dd292c7-2.jpg"}},"configuration":{},"availability":{"1130961":{"aditional_price":0,"availabile":669}}}
