{"viewData":{"url_key":"nikon_coolpix_p900_digital_camera","name":"Nikon COOLPIX P900 Digital Camera with Accessories Kit","sku":"1132320","price":"596.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon COOLPIX P900 Digital Camera with Accessories Kit featuring Memory Card, Camera Bag. Review Nikon P900","long_description":"Shoot the moon with the 83x optical zoom COOLPIX P900 Digital Camera from Nikon. The camera has a 16MP CMOS sensor and a built-in lens with a 35mm equivalent focal length of 24-2000mm. For an even further reach, the camera also has 166x Dynamic Fine Zoom, and 332x digital zoom, effectively quadrupling the optical zoom.The P900 features Dual Detect Optical VR, providing up to five stops of compensation, and reducing the appearance of camera shake in your images. A vari-angle TFT LCD screen and an electronic viewfinder allow you to review and compose images, as well as navigate the menus. The camera also shoots full HD 1080p video, has built-in Wi-Fi, NFC, and GPS, and manual exposure control.Record Full HD 1080p video with this Class 10 compliant 32GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.Store, transport, and protect your DSLR with attached lens, 2-4 extra lenses, flash, and related accessories with the black Kontrast DSLR Shoulder Bag from Case Logic. The padded main compartment has a hammock system that suspends the camera for improved shock protection, and padded, touch-fastening dividers for organizing gear. Water-resistant DuraBase, foam padding, and polyester construction ensures strength and durability. The lid unzips away from wearer for easy access to gear, and has a convenient zip pocket underneath for small items. Dual, zippered side and front pockets provide additional storage capacity. The front pocket features two slip-in pockets. Carry your Kontrast Shoulder Bag with the padded top handle, or wear with the removable, padded shoulder strap. The gray interior lining makes finding gear in low light easier.","images":{"0":"f3a4d9130f605d9d2fe8a4f5fd1e0b80-0.jpg","1":"f3a4d9130f605d9d2fe8a4f5fd1e0b80-1.jpg","2":"f3a4d9130f605d9d2fe8a4f5fd1e0b80-2.jpg","3":"f3a4d9130f605d9d2fe8a4f5fd1e0b80-3.jpg"}},"configuration":{},"availability":{"1132320":{"aditional_price":0,"availabile":865}}}
