{"viewData":{"url_key":"ricoh_175843_gr_ii_digital_camera","name":"Ricoh GR II Digital Camera","sku":"1159252","price":"546.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Ricoh GR II Digital Camera featuring 16.2MP APS-C CMOS Sensor, No Optical Low-Pass Filter GR ENGINE V Image Processor. Review Ricoh ","long_description":"The first GR-series camera to feature built-in Wi-Fi and NFC connectivity, the GR II Digital Camera from Ricoh continues the legacy of its predecessor with a large 16.2MP APS-C CMOS sensor, providing high-resolution images with low noise at up to ISO 25600. By omitting the optical low-pass filter, this sensor is able to squeeze out sharper images with rich colors and when combined with the GR ENGINE V it operates quickly and efficiently in creating images. On top of this is a Ricoh GR 18.3mm f/2.8 lens, equivalent to 28mm in 35mm terms, which will assist in creating sharp images in all lighting conditions.Benefitting from the GR ENGINE V is the High-Speed AF system, locking focus in just 0.2 seconds. The camera will also start up in just 1 second and offers continuous shooting at 4 fps. Full HD 1080p video recording is possible at up to 30 fps with autofocus. And, it has wireless flash control with the built-in flash unit which allows users to remotely operate their AF360FGZII and AF540FGZII flashes as slave units.The GR is designed to be compact with a portable magnesium alloy body. It maintains a classic GR styling with a solid handgrip for comfort and physical control buttons for natural operation. This includes a dedicated AF button and aperture preview button. The camera can also capture in either JPEG or DNG RAW images for full control over post-processing.","images":{"0":"22400a9d59de5079d5d002e4fb72de93-0.jpg","1":"22400a9d59de5079d5d002e4fb72de93-1.jpg","2":"22400a9d59de5079d5d002e4fb72de93-2.jpg","3":"22400a9d59de5079d5d002e4fb72de93-3.jpg","4":"22400a9d59de5079d5d002e4fb72de93-4.jpg","5":"22400a9d59de5079d5d002e4fb72de93-5.jpg","6":"22400a9d59de5079d5d002e4fb72de93-6.jpg","7":"22400a9d59de5079d5d002e4fb72de93-7.jpg","8":"22400a9d59de5079d5d002e4fb72de93-8.jpg","9":"22400a9d59de5079d5d002e4fb72de93-9.jpg","10":"22400a9d59de5079d5d002e4fb72de93-10.jpg","11":"22400a9d59de5079d5d002e4fb72de93-11.jpg","12":"22400a9d59de5079d5d002e4fb72de93-12.jpg","13":"22400a9d59de5079d5d002e4fb72de93-13.jpg","14":"22400a9d59de5079d5d002e4fb72de93-14.jpg","15":"22400a9d59de5079d5d002e4fb72de93-15.jpg","16":"22400a9d59de5079d5d002e4fb72de93-16.jpg","17":"22400a9d59de5079d5d002e4fb72de93-17.jpg"}},"configuration":{},"availability":{"1159252":{"aditional_price":0,"availabile":967}}}
