{"viewData":{"url_key":"sony_ilce7sm2_b_alpha_a7sii_mirrorless_digital","name":"Sony Alpha a7S II Mirrorless Digital Camera (Body Only)","sku":"1186034","price":"1,998.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony a7S II Mirrorless Digital Camera (a7S II Camera Body) featuring 12.2MP Full-Frame Exmor CMOS Sensor, BIONZ X Image Processor.","long_description":"Making strides in the video arena, the a7S II Mirrorless Digital Camera from Sony offers an impressive blend of sensitivity, dynamic range, resolution, and speed to benefit a versatile multimedia workflow. Revolving around a full-frame 12.2MP Exmor CMOS sensor, the a7S II is capable of internal UHD 4K recording at 30 fps with full pixel readout as well as 1080p recording at up to 120 fps, all in the XAVC S format. For both stills and video recording, the BIONZ X image processor also pairs with the sensor to enable expanded sensitivity to ISO 409600, continuous shooting to 5 fps, and fast intelligent autofocus with low-light sensitivity to -4 EV. Further enabling working in difficult lighting conditions, 5-axis SteadyShot INSIDE image stabilization compensates for vertical, horizontal, pitch, yaw, and roll camera movements for sharper, smoother handheld recording.Complementing the 4K recording capabilities is a redeveloped recording setup, including the ability to utilize S-Log3 Gamma and S-Gamut3 in addition to S-Log2, for increasing dynamic range values by up to 1300% to better match high-end post-production workflows. For clearer monitoring potential, an enhanced Zebra function better supports working with S-Log gamma settings and a Gamma Display Assist helps to preview imagery with natural contrast by converting S-Log2 and S-Log3 settings to the ITU709 gamma for easier on-camera viewing.The a7S II is also characterized by a compact, yet robust, magnesium alloy body design that incorporates a high 0.78x-magnification Tru-Finder OLED electronic viewfinder. With a resolution of 2.36-million dots and a Zeiss T* anti-reflective coating, this finder benefits working in a variety of lighting conditions and is capable of previewing exposure and settings adjustments prior to recording. A rear 3.0\" 1,228,800-dot LCD screen is also available, and features a tilting design to support working from high and low angles. Additionally, built-in Wi-Fi connectivity with NFC allows you to pair mobile devices to the camera for wireless sharing and remote camera control.","images":{"0":"d450c7c3c14c07d5ed54f539a862f34a-0.jpg","1":"d450c7c3c14c07d5ed54f539a862f34a-1.jpg","2":"d450c7c3c14c07d5ed54f539a862f34a-2.jpg","3":"d450c7c3c14c07d5ed54f539a862f34a-3.jpg","4":"d450c7c3c14c07d5ed54f539a862f34a-4.jpg","5":"d450c7c3c14c07d5ed54f539a862f34a-5.jpg","6":"d450c7c3c14c07d5ed54f539a862f34a-6.jpg","7":"d450c7c3c14c07d5ed54f539a862f34a-7.jpg","8":"d450c7c3c14c07d5ed54f539a862f34a-8.jpg","9":"d450c7c3c14c07d5ed54f539a862f34a-9.jpg","10":"d450c7c3c14c07d5ed54f539a862f34a-10.jpg","11":"d450c7c3c14c07d5ed54f539a862f34a-11.jpg","12":"d450c7c3c14c07d5ed54f539a862f34a-12.jpg","13":"d450c7c3c14c07d5ed54f539a862f34a-13.jpg","14":"d450c7c3c14c07d5ed54f539a862f34a-14.jpg","15":"d450c7c3c14c07d5ed54f539a862f34a-15.jpg","16":"d450c7c3c14c07d5ed54f539a862f34a-16.jpg","17":"d450c7c3c14c07d5ed54f539a862f34a-17.jpg","18":"d450c7c3c14c07d5ed54f539a862f34a-18.jpg","19":"d450c7c3c14c07d5ed54f539a862f34a-19.jpg","20":"d450c7c3c14c07d5ed54f539a862f34a-20.jpg","21":"d450c7c3c14c07d5ed54f539a862f34a-21.jpg","22":"d450c7c3c14c07d5ed54f539a862f34a-22.jpg","23":"d450c7c3c14c07d5ed54f539a862f34a-23.jpg","24":"d450c7c3c14c07d5ed54f539a862f34a-24.jpg","25":"d450c7c3c14c07d5ed54f539a862f34a-25.jpg","26":"d450c7c3c14c07d5ed54f539a862f34a-26.jpg","27":"d450c7c3c14c07d5ed54f539a862f34a-27.jpg"}},"configuration":{},"availability":{"1186034":{"aditional_price":0,"availabile":745}}}
