{"viewData":{"url_key":"panasonic_lumix_dmc_fz300_digital_camera","name":"Panasonic Lumix DMC-FZ300 Digital Camera with Accessories Kit","sku":"1188237","price":"397.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-FZ300 Digital Camera with Accessories Kit featuring Memory Card, Holster-Style Camera Bag. Review Panasonic DMC-FZ300","long_description":"Blending an all-in-one zoom, 4K video recording, and versatile still shooting capabilities, the Lumix DMC-FZ300 from Panasonic is a multi-faceted point-and-shoot optimized for the multimedia image maker. Featuring a 12.1MP High-Sensitivity MOS sensor and Venus Engine image processor, the FZ300 is capable of recording up to 60 fps with an electronic shutter, 12 fps with a mechanical shutter, or 30 fps using the unique 4K Photo Modes. Working in low-light is benefitted by a top sensitivity of ISO 6400 along with 5-axis HYBRID O.I.S.+ image stabilization to minimize camera shake during HD video recording. The 24x Leica DC Vario-Elmarit lens covers a 25-600mm equivalent focal length range and has a constant f/2.8 maximum aperture for consistent performance from wide-angle to super telephoto. For composing imagery, configuring shooting settings, and reviewing your photos and movies, a large 3.0\" 1.04m-dot free-angle touchscreen LCD is available, as well as a 1.44m-dot OLED Live View Finder for eye-level monitoring. Able to handle nearly any image-related task, the FZ300 is a versatile camera well-suited to advanced photo and movie recording applications.The body design features an ergonomic right-hand grip for added support when working with longer focal lengths, as well as dust and splashproof construction to suit working in inclement conditions. Benefitting both stills and movies, Panasonic's DFD (Depth-From-Defocus) AF system helps to quicken focusing speeds while a Starlight AF feature maintains focusing accuracy in low-light conditions. And benefitting both sharing and shooting control, Wi-Fi connectivity allows for wireless image sharing and remote camera control from smartphones and tablets.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. ","images":{"0":"4cac9920446c694eab0d7ef6ed31736c-0.jpg","1":"4cac9920446c694eab0d7ef6ed31736c-1.jpg","2":"4cac9920446c694eab0d7ef6ed31736c-2.jpg","3":"4cac9920446c694eab0d7ef6ed31736c-3.jpg"}},"configuration":{},"availability":{"1188237":{"aditional_price":0,"availabile":580}}}
