{"viewData":{"url_key":"sony_alpha_a7_ii_mirrorless","name":"Sony Alpha a7 II Mirrorless Digital Camera with 28-70mm Lens Deluxe Kit","sku":"1196392","price":"998.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a7 II Mirrorless Digital Camera with 28-70mm Lens Deluxe Kit featuring FE 28-70mm f/3.5-5.6 OSS Lens, Spare Rechargeable Lithium-Ion Battery Camera Bag. Review Sony A7 II","long_description":"Sony has taken their line of full-frame cameras to the next level with the Alpha a7 II Mirrorless Digital Camera with FE 28-70mm f/3.5-5.6 OSS Lens, which features 5-axis SteadyShot INSIDE image stabilization with 4.5 stops of compensation for pitch, yaw, horizontal shift, vertical shift, and roll. Operation of the 24.3-megapixel series has been streamlined with a redesigned grip, shutter release button, and customizable controls. The a7 II also features a moisture- and dust-resistant design with a magnesium alloy body and a more robust lens mount. And, with refined algorithms and better utilization of the BIONZ X image processor, the a7 II has an enhanced Fast Hybrid AF system that is about 30% faster than the previous model along with a 5 fps burst rate with continuous autofocus as well as a 40% faster start time.The 24.3-megapixel sensor enables high resolution images and low light effectiveness with its standard ISO sensitivity range of 100-25600. The BIONZ X image processor offers fast processing and operation speeds and front-end LSI (large-scale integration) improves the early stages of image processing resulting in more natural details and richer tones. And, 16-bit image processing and 14-bit RAW output preserves the detail provided by the sensor.In addition to highly detailed stills with smooth gradations, the a7 II now has access to the high-bit-rate XAVC S format with 60p, 30p, and 24p recording options, all at 50 Mbps. The look of movies can also be adjusted with picture profiles, including the addition of the S-Log2 gamma setting with a dynamic range approximately 1,300% of the standard sRGB spectrum. Timecode and user bit settings are available as well as clean HDMI output for a variety of recording options.The advanced Sony Multi-Interface shoe expands compatibility options for flash, microphone, and other accessories and, as an E-mount full-frame camera, the a7 II is compatible with all present APS-C E-mount lenses in APS-C crop mode as well as new E-mount full-frame Zeiss and Sony G-series lenses. Lens mount adapters with a tripod mount are also available to use A-mount lenses on E-mount cameras, and an optional dedicated battery grip enables stable extended shooting and vertical orientation stability.Rounding out the a7 II's imaging capabilities, both a 3.0\" 1,228.8k-dot tilting LCD monitor and 2.36 million-dot OLED electronic viewfinder are available for image monitoring and review. Built-in Wi-Fi connectivity, with support for NFC, is available, too, for instant sharing of imagery from the camera as well as remote camera control from a linked mobile device.Bundled with the a7 II in this kit is the FE 28-70mm f/3.5-5.6 OSS E-mount lens. This wide-to-portrait zoom incorporates three aspherical elements and one extra-low dispersion element into its design to minimize chromatic aberrations and enhance overall image clarity. An optical SteadyShot image stabilization system has also been added to minimize the appearance of camera shake to suit working in dim lighting and with low shutter speeds. This stabilization will work with the in-body stabilization found in the camera. It has a minimum focus distance of 11.8\".The Watson NP-FW50 Lithium-Ion Battery Pack works with the same cameras as the Sony NP-FW50. This replacement battery pack features a capacity of 1100mAh, 7.4V of output power and 8.14 watt-hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme PRO UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 170 MB/s and write speeds max out at 90 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s. As with most SanDisk cards, this memory card is shockproof, X-ray proof, waterproof, while also being able to withstand temperatures from -13 to 185°F, allowing you to take this card with you into extreme environments, such as snow, deserts, and pools. Should the card's data become compromised, you also benefit from the option to download RescuePRO Deluxe software as well as a limited lifetime warranty.","images":{"0":"ba1d2ad0980ef623ff99da736fd87a75-0.jpg","1":"ba1d2ad0980ef623ff99da736fd87a75-1.jpg","2":"ba1d2ad0980ef623ff99da736fd87a75-2.jpg","3":"ba1d2ad0980ef623ff99da736fd87a75-3.jpg","4":"ba1d2ad0980ef623ff99da736fd87a75-4.jpg"}},"configuration":{},"availability":{"1196392":{"aditional_price":0,"availabile":275}}}
