{"viewData":{"url_key":"panasonic_lumix_dmc_g7_mirrorless_micro","name":"Panasonic Lumix DMC-G7 Mirrorless Micro Four Thirds Digital Camera with 14-42mm Lens and Accessory Kit (Silver)","sku":"1208932","price":"497.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-G7 Mirrorless Micro Four Thirds Digital Camera with 14-42mm Lens and Accessory Kit (Silver) featuring 14-42mm f/3.5-5.6 II MEGA O.I.S. Lens, Memory Card Camera Bag. Review Panasonic DMC-G7","long_description":"Offering true recording versatility, the silver Panasonic Lumix DMC-G7 is a true hybrid mirrorless camera that blends 4K UHD video with advanced still capture and burst shooting capabilities. Revolving around a 16 MP Live MOS Micro Four Thirds sensor and Venus Engine 9 image processor, the G7 features notable low-light sensitivity to ISO 25600, continuous shooting to 8 fps with single-shot AF, as well as a trio of 30 fps shooting rates based on the 4K UHD video recording. Complementing the fast burst shooting modes is an equally adept DFD autofocus system, which works to quicken focusing speeds and emphasize accurate subject tracking for consistently sharp imagery in fast-paced and trying working conditions. Rounding out the feature-set of the G7 is a contemporary body design accentuated by physical exposure control dials, six customizable function buttons, both a high-resolution EVF and 3.0\" tilting touchscreen LCD, and built-in Wi-Fi for wireless sharing and remote camera control. Bridging the gap between stills and video, the Lumix DMC-G7 pairs these two high-resolution mediums with refined focusing and shooting controls for the utmost in shooting versatility. Included with the camera body is the well-rounded Lumix G Vario 14-42mm f/3.5-5.6 II ASPH. MEGA O.I.S. lens, which provides a 28-84mm equivalent focal length range to cover wide-angle to short telephoto perspectives. An Optical Image Stabilizer compensates for camera shake for sharper handheld shooting while a pair of aspherical elements help to minimize the overall lens size and maintain a high degree of sharpness and clarity throughout the zoom range.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Hunter 15 DSLR Holster Bag from Ruggard holds your mirrorless camera with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. The Watson DMW-BLC12 Lithium-Ion Battery Pack works with the same cameras as the Panasonic DMW-BLC12, Leica BP-DC12, and Sigma BP-51 batteries. This replacement battery pack features a capacity of 1100mAh, 7.2V of output power, and 7.92 watt-hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.","images":{"0":"aa54f14b6606c20420484b09f002c7d7-0.jpg","1":"aa54f14b6606c20420484b09f002c7d7-1.jpg","2":"aa54f14b6606c20420484b09f002c7d7-2.jpg","3":"aa54f14b6606c20420484b09f002c7d7-3.jpg","4":"aa54f14b6606c20420484b09f002c7d7-4.jpg"}},"configuration":{},"availability":{"1208932":{"aditional_price":0,"availabile":638}}}
