{"viewData":{"url_key":"sony_cyber_shot_dsc_rx100_digital_camera","name":"Sony Cyber-shot DSC-RX100 Digital Camera with Accessory Kit","sku":"1209681","price":"448.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Cyber-shot DSC-RX100 Digital Camera with Accessory Kit featuring Memory Card, Protective Camera Case External Battery Charger. Review Sony DSC-RX100","long_description":"Housed in a sophisticated aluminum body, the Sony DSC-RX100 Digital Camera (Black) features a 20.2 megapixel Exmor CMOS image sensor that excels in ultra low-light situations. It's equipped with a brilliant f/1.8 Carl Zeiss Vario-Sonnar T Lens with a focal length of 10.4-37.1mm (35mm equivalent: 28-100mm). It also has an integrated pop up flash. You can record ultra high-definition still images in JPEG format, RAW format, or even both simultaneously. The camera also affords Full HD 1080p video capture at 60 frames per second (fps). Plus, it supports a full range of controls for video and still shooting that range from iAUTO to P/A/S/M (Program, Aperture Priority, Shutter Priority and Manual).Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The HFV-230 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.Charge any Sony NP-BX1 type lithium-ion battery with this dedicated Compact AC/DC Charger from Pawa. It runs on 100-240 VAC power, allowing for worldwide use, and features a folding, 2-prong North American plug. Additionally, the charger includes a European plug adapter and a 12 VDC vehicle adapter that plugs into a cigarette lighter port--making it ideal for use both at home and on the road.","images":{"0":"fbd933a42d0690ee4494cd28192fe2e5-0.jpg","1":"fbd933a42d0690ee4494cd28192fe2e5-1.jpg","2":"fbd933a42d0690ee4494cd28192fe2e5-2.jpg","3":"fbd933a42d0690ee4494cd28192fe2e5-3.jpg","4":"fbd933a42d0690ee4494cd28192fe2e5-4.jpg"}},"configuration":{},"availability":{"1209681":{"aditional_price":0,"availabile":873}}}
