{"viewData":{"url_key":"panasonic_dmc_zs100_digital_camera","name":"Panasonic Lumix DMC-ZS100 Digital Camera (Black)","sku":"1211983","price":"497.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic DMC-ZS100 Lumix Digital Camera (ZS100 Black) features 20.1MP 1\" ; High Sensitivity MOS Sensor, Venus Engine Image Processor. Review Panasonic DMC-ZS100 camera","long_description":"Built with travel in mind, the black Lumix DMC-ZS100 Digital Camera from Panasonic is a versatile point-and-shoot marrying both form and function. Designed to be as sleek as possible, the ZS100 still manages to incorporate a large 1-inch 20.1MP High-Sensitivity MOS sensor and 10x optical zoom lens. The sensor pairs with a Venus Engine image processor to realize clear, clean image quality with low noise and high sensitivity to an expanded ISO 25600. This processor and sensor also permit quick continuous shooting, up to 50 fps with an electronic shutter or 10 fps with a mechanical shutter, as well as 4K UHD video recording at 30p and 24p frame rates. The 4K capabilities are extended to stills applications, too, and allow for 30 fps shooting at 8MP as well as the ability to use Post Focus for choosing your specific point of focus after shooting. Complementing these imaging attributes is a Leica DC Vario-Elmarit lens, which provides a 25-250mm equivalent focal length range, along with 5-axis Hybrid O.I.S. to minimize the appearance of camera shake for sharper handheld shooting. Featuring more than your average pocket-sized point-and-shoot, the ZS100 is a capable camera for photographers and videographers on the move.  Equally as important as the stills and video components, the ZS100 is also characterized by its intuitive physical design and inclusion of both an electronic viewfinder and rear LCD screen. The Live View Finder is a 1166k-dot EVF that affords comfortable eye-level monitoring, and is especially well-suited to working in bright conditions. Contrasting this is the large rear 3.0\" 1.04m-dot LCD touchscreen, which is best-suited for clear image review, menu navigation, and live view shooting. The camera body is also accentuated by a range of manual control dials, such as a lens-surrounding configurable control ring for direct control over zoom, focus, or exposure settings. Additionally, built-in Wi-Fi allows you to pair the ZS100 with a smartphone or tablet for wireless image sharing and remote camera control via the Panasonic Image app.","images":{"0":"76d692609c6ea9b1f5a0d0b73b8bfd73-0.jpg","1":"76d692609c6ea9b1f5a0d0b73b8bfd73-1.jpg","2":"76d692609c6ea9b1f5a0d0b73b8bfd73-2.jpg","3":"76d692609c6ea9b1f5a0d0b73b8bfd73-3.jpg","4":"76d692609c6ea9b1f5a0d0b73b8bfd73-4.jpg","5":"76d692609c6ea9b1f5a0d0b73b8bfd73-5.jpg","6":"76d692609c6ea9b1f5a0d0b73b8bfd73-6.jpg","7":"76d692609c6ea9b1f5a0d0b73b8bfd73-7.jpg","8":"76d692609c6ea9b1f5a0d0b73b8bfd73-8.jpg","9":"76d692609c6ea9b1f5a0d0b73b8bfd73-9.jpg","10":"76d692609c6ea9b1f5a0d0b73b8bfd73-10.jpg","11":"76d692609c6ea9b1f5a0d0b73b8bfd73-11.jpg","12":"76d692609c6ea9b1f5a0d0b73b8bfd73-12.jpg","13":"76d692609c6ea9b1f5a0d0b73b8bfd73-13.jpg","14":"76d692609c6ea9b1f5a0d0b73b8bfd73-14.jpg","15":"76d692609c6ea9b1f5a0d0b73b8bfd73-15.jpg","16":"76d692609c6ea9b1f5a0d0b73b8bfd73-16.jpg","17":"76d692609c6ea9b1f5a0d0b73b8bfd73-17.jpg","18":"76d692609c6ea9b1f5a0d0b73b8bfd73-18.jpg","19":"76d692609c6ea9b1f5a0d0b73b8bfd73-19.jpg","20":"76d692609c6ea9b1f5a0d0b73b8bfd73-20.jpg","21":"76d692609c6ea9b1f5a0d0b73b8bfd73-21.jpg","22":"76d692609c6ea9b1f5a0d0b73b8bfd73-22.jpg"}},"configuration":{},"availability":{"1211983":{"aditional_price":0,"availabile":792}}}
