{"viewData":{"url_key":"nikon_d750_dslr_camera_body","name":"Nikon D750 DSLR Camera Body Basic Kit","sku":"1211920","price":"1,599.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D750 DSLR Camera Body Basic Kit featuring 64GB SDXC Memory Card, Shoulder Bag Spare Rechargeable Lithium-Ion Battery. Review Nikon D750","long_description":"Championing a multimedia approach to photography, Nikon's D750 DSLR is an FX-format camera well-suited to both still imaging and video recording. Featuring a 24.3MP CMOS sensor, along with the EXPEED 4 image processor, this camera is capable of producing high-resolution imagery with smooth color gradations, low noise, and sensitivity to an expandable ISO 51200, at a continuous shooting rate of up to 6.5 fps. In regard to video recording, Full HD 1080p/60 is supported, along with the ability to record uncompressed video to an optional external recorder. Working from high and low angles is possible due to the tilting 3.2\" 1,229k-dot LCD monitor or, for remote shooting, the D750 also features built-in Wi-Fi connectivity. Designed for the contemporary image-maker, this DSLR is poised to benefit still photographers and videographers alike with the versatility and performance to match any working situation.Benefitting the imaging capabilities of the D750, an equally apt 51-point AF system, with 15 cross-type points, is available and can be configured to utilize five AF points as a single focusing point in the Group Area AF setting for heightened initial subject recognition. The 3D Color Matrix Metering III system, along with the 91,000-pixel RGB sensor, also benefits the focusing abilities as well as provides accurate exposure metering to suit a vast array of subjects and lighting conditions. Furthermore, benefitting creative applications, the D750 supports in-camera creation of time-lapse movies with automated exposure smoothing, and a range of Picture Control profiles can be applied to refine the color and tonal handling of imagery.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme PRO UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 170 MB/s and write speeds max out at 90 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s. As with most SanDisk cards, this memory card is shockproof, X-ray proof, waterproof, while also being able to withstand temperatures from -13 to 185°F, allowing you to take this card with you into extreme environments, such as snow, deserts, and pools. Should the card's data become compromised, you also benefit from the option to download RescuePRO Deluxe software as well as a limited lifetime warranty.Store, protect, and transport your compact DSLR or mirrorless camera with an attached lens, flash, related accessories, and up to three extra lenses with the lightweight, black Journey 44 DSLR Shoulder Bag from Ruggard. This handsome bag features a large flap with a quick release buckle, and double-pull zipper closure. The main compartment has four padded, touch-fastening dividers for organizing equipment. A light gray interior lining makes it easier to locate gear in low light. Under the lid is a large, zippered, mesh accessory pocket. Small accessories are easily accommodated in the front exterior zippered pocket. Inside this pocket are two slip-in pockets, two memory card pockets with touch-fastening flaps, and a zippered mesh pocket.  Photographers will appreciate the neoprene water bottle/accessory pocket located on the exterior left side of the bag. On the opposite side is a strap for attaching accessories. Carry the Journey 44 Shoulder Bag by the padded top handle, or wear with the removable, adjustable, padded shoulder strap. The strap has swiveling snap-hooks that attach to metal D-rings on either side of bag. And on the back of the bag is a trolley strap that comes in handy when traveling with rolling luggage. Two strips of plastic feet on the bottom of the bag help protect it against abrasion. This well-made bag is constructed from weather-resistant polyester and ballistic nylon.This second version of the Watson EN-EL15 Lithium-Ion Battery Pack works with all cameras that take the Nikon EN-EL15. This replacement pack features a 1900-2000mAh capacity, 7.0V of output power, and 14 watt-hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.Trigger your camera's shutter wirelessly with the FreeWave Plus Wireless Remote Shutter Release from Vello, a lightweight remote control system that will help you avoid unwanted camera movement. This 2.4 GHz model is compatible with Nikon cameras and will work both wired and wirelessly up to 320', depending on your own needs and setup. This makes it useful for photographing wildlife or for macro and long exposures where it is necessary to eliminate any chance of camera shake.  The FreeWave system also has access to 16 channels for triggering multiple receivers and has an internal antenna that will be protected from any accidental damage. Multiple features are available for shooting, such as a four-second delay as well as multi-exposure and long exposure modes. The device also has a dual function release, enabling focus on half press and triggering the shutter release on a full press. Additionally, it has LED indicators to confirm pre-focus and exposure while in wireless mode and the receiver and transmitter each run on two AAA batteries.This LCD Screen Protector Ultra from Vello is a sheet of ultra-thin (0.02\") optical glass used to safeguard the LCD monitor of the Nikon Df, D4, D4s, D7100, D7200, D500, D600, D610, D750, D800, D810, and D850. It easily adheres to the screen via static, without trapping air bubbles, and if removed, won't leave a sticky residue behind. Multiple layers of protective material shield your display from dirt, scratches, sweat, smears, and light impact. The shatter-proof glass blocks UV rays while allowing visible light in. It can be easily cleaned using the supplied microfiber cloth and wet wipe.Safely clean your glass lenses, television screens, computer monitors, binoculars, and more with this gray Microfiber Lens Cleaning Cloth from Sensei. This handy item is also useful for wiping dust or smudges off CDs, DVDs, or Blu-ray discs. The soft microfiber fabric will not scratch glass or other sensitive surfaces, and allows for streak-free cleaning.One side of the cloth features a covering of textured rubber dots to give you a more secure grip, preventing the cloth from slipping out of your hand. Additionally, the fabric is approximately 18% gray, so it can assist you in setting your camera's white balance. At only 7 x 7.9\" in size, the cloth is small and easily packed in a pocket, pouch, or bag for convenient carrying. It's also machine washable in cold water on a gentle cycle for reuse again and again.","images":{"0":"e529199fb9f9af4a4c6000242a8200ca-0.jpg","1":"e529199fb9f9af4a4c6000242a8200ca-1.jpg","2":"e529199fb9f9af4a4c6000242a8200ca-2.jpg","3":"e529199fb9f9af4a4c6000242a8200ca-3.jpg","4":"e529199fb9f9af4a4c6000242a8200ca-4.jpg","5":"e529199fb9f9af4a4c6000242a8200ca-5.jpg","6":"e529199fb9f9af4a4c6000242a8200ca-6.jpg","7":"e529199fb9f9af4a4c6000242a8200ca-7.jpg"}},"configuration":{},"availability":{"1211920":{"aditional_price":0,"availabile":631}}}
