{"viewData":{"url_key":"canon_eos_1d_x_mark_ii","name":"Canon EOS-1D X Mark II DSLR Camera (Body Only)","sku":"1220852","price":"5,499.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Canon EOS 1D X Mark II DSLR Camera (Body Only) features 20.2MP Full-Frame CMOS Sensor, Dual DIGIC 6+ Image Processors. ","long_description":"Bringing the shooting speed and video capabilities required by professional multimedia image-makers, the EOS-1D X Mark II is the flagship model within Canon's DSLR lineup, and is characterized by its robust processing capabilities and ability to enable a high-end multimedia workflow. At the heart of the imaging system is a full-frame 20.2MP CMOS sensor and dual DIGIC 6+ image processors, which contribute to fast continuous shooting rates up to 16 fps in live view, 14 fps with full-time AF and AE, and an expanded sensitivity range from ISO 50-409600. The sensor and processor combination also avails DCI 4K video recording at 60 fps and Full HD 1080p recording at 120 fps, along with the ability to record on-board to a CFast 2.0 memory card, or uncompressed Full HD video can be saved via HDMI to an optional external recorder. Benefitting stills shooting is an apt 61-point High Density Reticular AF II system, which includes 41 cross-type points for a high degree of precision in varying light conditions, and video shooting is enhanced by Dual Pixel CMOS AF, which makes its first appearance in a full-frame sensor for smooth, quick, and controllable AF in live view. With a versatile set of imaging traits, the Canon EOS-1D X Mark II takes its place as a high-performance tool for professional photographers and videographers alike.Complementing the robust set of imaging specs is an equally robust physical design based on a magnesium alloy body construction that is both dust- and weather-sealed for use in harsh environments. Integrated within the body is a large 3.2\" 1.62m-dot touchscreen LCD for bright, high-resolution live view monitoring and image review, and a large 0.76x Intelligent Viewfinder II is offered for clear eye-level shooting. For versatility in file handling, both CFast and CompactFlash memory card slots are available, and the 1D X Mark II also supports sharing imagery over Wi-Fi, as well as wireless remote camera control, via the optional WFT-E8A Wireless File Transmitter. Additionally, a built-in GPS module permits in-camera geotagging of photos and videos, and also allows for auto time syncing with the Universal Time Code for more efficient file sharing and organization.","images":{"0":"d336564ec89fca167739bc0df90c849b-0.jpg","1":"d336564ec89fca167739bc0df90c849b-1.jpg","2":"d336564ec89fca167739bc0df90c849b-2.jpg","3":"d336564ec89fca167739bc0df90c849b-3.jpg","4":"d336564ec89fca167739bc0df90c849b-4.jpg","5":"d336564ec89fca167739bc0df90c849b-5.jpg","6":"d336564ec89fca167739bc0df90c849b-6.jpg","7":"d336564ec89fca167739bc0df90c849b-7.jpg","8":"d336564ec89fca167739bc0df90c849b-8.jpg","9":"d336564ec89fca167739bc0df90c849b-9.jpg"}},"configuration":{},"availability":{"1220852":{"aditional_price":0,"availabile":282}}}
