{"viewData":{"url_key":"nikon_d750_dslr_camera_with","name":"Nikon D750 DSLR Camera with 24-120mm Lens and Microphone Kit","sku":"1223802","price":"1,996.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D750 DSLR Camera with 24-120mm Lens and Microphone Kit featuring 24.3MP FX-Format CMOS Sensor, EXPEED 4 Image Processor 3.2&quot; 1.229m-Dot RGBW Tilting LCD Monitor. Review Nikon D750","long_description":"Championing a multimedia approach to photography, Nikon's D750 DSLR is an FX-format camera well-suited to both still imaging and video recording. Featuring a 24.3MP CMOS sensor, along with the EXPEED 4 image processor, this camera is capable of producing high-resolution imagery with smooth color gradations, low noise, and sensitivity to an expandable ISO 51200, at a continuous rate of up to 6.5 fps. In regard to video recording, full HD 1080p/60 is supported, along with the ability to record uncompressed video to an optional external recorder. Working from high and low angles is possible due to the tilting 3.2\" 1,229k-dot LCD monitor or, for remote shooting, the D750 also features built-in Wi-Fi connectivity. Designed for the contemporary image-maker, this DSLR is poised to benefit still photographers and videographers alike with the versatility and performance to match any working situation.Benefitting the imaging capabilities of the D750, an equally apt 51-point AF system, with 15 cross-type points, is available and can be configured to utilize five AF points as a single focusing point in the Group Area AF setting for heightened initial subject recognition. The 3D Color Matrix Metering III system, along with the 91,000-pixel RGB sensor, also benefits the focusing abilities as well as provides accurate exposure metering to suit a vast array of subjects and lighting conditions. Furthermore, benefitting creative applications, the D750 supports in-camera creation of time-lapse movies with automated exposure smoothing, and a range of Picture Control profiles can be applied to refine the color and tonal handling of imagery.Included with the D750 body is the Nikon AF-S NIKKOR 24-120mm f/4G ED VR lens; a versatile wide-angle to telephoto zoom that features a constant f/4 maximum aperture. A pair of extra-low dispersion elements and three aspherical elements control chromatic aberrations throughout the zoom range while a Nano Crystal Coating helps to reduce lens flare and ghosting for increased contrast and clarity. A Silent Wave Motor produces fast, quiet autofocus performance and Vibration Reduction image stabilization minimizes the appearance of camera shake to better enable working in difficult lighting conditions and with slower shutter speeds.The VideoMic Pro with Rycote Lyre Shockmount from Rode is a supercardioid condenser shotgun microphone that terminates in a 1/8\" stereo mini-jack (dual mono), includes an integrated shockmount, and an integrated foam windscreen. It can be used to capture audio for camcorders, DSLR, and portable recorders as a source of primary and reference audio.","images":{"0":"e0502347f7b635c93b2909ed492a2821-0.jpg","1":"e0502347f7b635c93b2909ed492a2821-1.jpg","2":"e0502347f7b635c93b2909ed492a2821-2.jpg"}},"configuration":{},"availability":{"1223802":{"aditional_price":0,"availabile":739}}}
