{"viewData":{"url_key":"canon_powershot_elph_180_digital","name":"Canon PowerShot ELPH 180 Digital Camera with Free Accessory Kit (Silver)","sku":"1225961","price":"119.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot ELPH 180 Digital Camera with Free Accessory Kit (Silver) featuring 16GB SDHC Memory Card, Camera Pouch. Review Canon ELPH 180","long_description":"High-resolution shooting in a compact, portable form factor, the silver PowerShot ELPH 180 Digital Camera from Canon is a convenient point-and-shoot featuring a 20.0MP 1/2.3\" CCD sensor and DIGIC 4+ image processor. Together, the sensor and processor offer notable image quality for stills shooting as well as HD 720p video recording at 25 fps. Complementing the imaging capabilities, an 8x optical zoom lens covers wide-angle to telephoto perspectives to suit shooting in a variety of locations. This lens is also benefitted by Digital IS, which helps to minimize the appearance of camera shake for sharper handheld shooting. Additionally, the camera's sleek design is complemented by a 2.7\" 230k-dot LCD for image playback and live view monitoring, and a host of shooting features are available to intelligently select exposure settings, creatively adjust the look of imagery, or to simply learn more about how to use all of the shooting controls of the ELPH 180.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.Store, transport and protect your digital small point & shoot camera from moisture, dirt and dust with the black Lyra 20 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"74d3e66305b235ce5224c758ddac4a88-0.jpg","1":"74d3e66305b235ce5224c758ddac4a88-1.jpg","2":"74d3e66305b235ce5224c758ddac4a88-2.jpg","3":"74d3e66305b235ce5224c758ddac4a88-3.jpg"}},"configuration":{},"availability":{"1225961":{"aditional_price":0,"availabile":947}}}
