{"viewData":{"url_key":"canon_powershot_elph_190_is","name":"Canon PowerShot ELPH 190 IS Digital Camera with Free Accessory Kit (Blue)","sku":"1225966","price":"159.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot ELPH 190 IS Digital Camera with Free Accessory Kit (Blue) featuring 16GB SDHC Memory Card, Camera Pouch. Review Canon ELPH 190 IS","long_description":"A pocketable point-and-shoot with versatile zoom lens, the blue PowerShot ELPH 190 IS Digital Camera from Canon is a sleek, convenient camera featuring a 20.0MP 1/2.3\" CCD sensor and DIGIC 4+ image processor. The sensor and processor combine to afford notable image quality and sensitivity to ISO 1600, as well as the ability to record HD 720p videos at 25 fps. A 10x optical zoom lens permits working with a variety of subjects, ranging from near to far, and an Intelligent IS image stabilization system compensates for the effects of camera shake to produce sharper handheld photos. A 2.7\" 230k-dot LCD monitor is available for composing your shots and reviewing imagery, and built-in Wi-Fi with NFC allows for wireless transferring of photos and movies to mobile devices. Rounding out the ELPH 190 IS' feature-set, the camera also sports a Smart AUTO mode for intelligently selecting exposure settings, Scene Modes to creatively affect the look of images, ECO Mode to save on battery life, and a dedicated Help Button for learning more about the specific camera controls.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.Store, transport and protect your digital small point & shoot camera from moisture, dirt and dust with the black Lyra 20 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"90f76d3447c94bbe73bacbf50d46f6b6-0.jpg","1":"90f76d3447c94bbe73bacbf50d46f6b6-1.jpg","2":"90f76d3447c94bbe73bacbf50d46f6b6-2.jpg","3":"90f76d3447c94bbe73bacbf50d46f6b6-3.jpg"}},"configuration":{},"availability":{"1225966":{"aditional_price":0,"availabile":572}}}
