{"viewData":{"url_key":"canon_1159c008_eos_rebel_t6_dslr","name":"Canon EOS Rebel T6 DSLR Camera with 18-55mm and 75-300mm Lenses Kit","sku":"1238275","price":"449.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS Rebel T6 DSLR Camera with 18-55mm and 75-300mm Lenses Kit featuring 18MP APS-C CMOS Sensor, DIGIC 4+ Image Processor 3.0&quot; 920k-Dot LCD Monitor. Review Canon Rebel T6","long_description":"Comprising a versatile set of imaging capabilities along with support for a connected workflow, the EOS Rebel T6 from Canon is a compact, sleek DSLR featuring an 18MP APS-C CMOS sensor and a DIGIC 4+ image processor. Combined, these two technologies avail rich image quality with reduced noise, along with a native sensitivity range of ISO 100-6400 that can be further expanded to ISO 12800 to suit working in low and difficult lighting conditions. The sensor and processor also enable the ability to shoot continuously at 3 fps for photographing moving subjects, as well as recording Full HD 1080p/30 video. Benefitting shooting with the optical viewfinder, a 9-point AF system incorporates a single center cross-type AF point for increased accuracy and focusing speed, and a contrast-detection focusing system offers refined autofocus precision for shooting movies or working in live view. The rear 3.0\" 920k-dot LCD offers a bright, clear image for playback and review, and built-in Wi-Fi with NFC also offers the ability to wirelessly share imagery from your camera to a linked mobile device for instant online sharing.Included with the camera body is the EF-S 18-55mm f/3.5-5.6 IS II lens, which provides a 28.8-88mm equivalent focal length range that covers wide-angle to short telephoto perspectives. One aspherical element is featured in the optical design, to control spherical aberrations and contribute to higher clarity, and an Optical Image Stabilizer minimizes the appearance of camera shake for sharper handheld shooting. Extending the combined zoom range even further, the EF 75-300 f/4-5.6 III lens is also included, which offers an equivalent focal length range of 120-480mm. Well-suited to use with distant subjects, this lens utilizes a DC autofocus motor to acquire precise focus while the telephoto perspective is especially useful for visually compressing the space between subjects and producing a shallow depth of field. Additionally, an EOS Shoulder Bag 100ES is also featured in this kit, and serves as a convenient means to protect and carry the entire DSLR and two lens kit.","images":{"0":"322ab1dbc3d3da9c83a92a380036159e-0.jpg","1":"322ab1dbc3d3da9c83a92a380036159e-1.jpg","2":"322ab1dbc3d3da9c83a92a380036159e-2.jpg","3":"322ab1dbc3d3da9c83a92a380036159e-3.jpg","4":"322ab1dbc3d3da9c83a92a380036159e-4.jpg","5":"322ab1dbc3d3da9c83a92a380036159e-5.jpg","6":"322ab1dbc3d3da9c83a92a380036159e-6.jpg","7":"322ab1dbc3d3da9c83a92a380036159e-7.jpg","8":"322ab1dbc3d3da9c83a92a380036159e-8.jpg","9":"322ab1dbc3d3da9c83a92a380036159e-9.jpg","10":"322ab1dbc3d3da9c83a92a380036159e-10.jpg","11":"322ab1dbc3d3da9c83a92a380036159e-11.jpg","12":"322ab1dbc3d3da9c83a92a380036159e-12.jpg","13":"322ab1dbc3d3da9c83a92a380036159e-13.jpg","14":"322ab1dbc3d3da9c83a92a380036159e-14.jpg"}},"configuration":{},"availability":{"1238275":{"aditional_price":0,"availabile":768}}}
