{"viewData":{"url_key":"ricoh_gr_ii_digital_camera","name":"Ricoh GR II Digital Camera with Accessory Kit","sku":"1241893","price":"546.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Ricoh GR II Digital Camera with Accessory Kit featuring Memory Card, Camera Case. Review Ricoh ","long_description":"The first GR-series camera to feature built-in Wi-Fi and NFC connectivity, the GR II Digital Camera from Ricoh continues the legacy of its predecessor with a large 16.2MP APS-C CMOS sensor, providing high-resolution images with low noise at up to ISO 25600. By omitting the optical low-pass filter, this sensor is able to squeeze out sharper images with rich colors and when combined with the GR ENGINE V it operates quickly and efficiently in creating images. On top of this is a Ricoh GR 18.3mm f/2.8 lens, equivalent to 28mm in 35mm terms, which will assist in creating sharp images in all lighting conditions.Benefitting from the GR ENGINE V is the High-Speed AF system, locking focus in just 0.2 seconds. The camera will also start up in just 1 second and offers continuous shooting at 4 fps. Full HD 1080p video recording is possible at up to 30 fps with autofocus. And, it has wireless flash control with the built-in flash unit which allows users to remotely operate their AF360FGZII and AF540FGZII flashes as slave units.The GR is designed to be compact with a portable magnesium alloy body. It maintains a classic GR styling with a solid handgrip for comfort and physical control buttons for natural operation. This includes a dedicated AF button and aperture preview button. The camera can also capture in either JPEG or DNG RAW images for full control over post-processing.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The HFV-250 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.","images":{"0":"63d81f090abd89c7226abf77ef3fd28e-0.jpg","1":"63d81f090abd89c7226abf77ef3fd28e-1.jpg","2":"63d81f090abd89c7226abf77ef3fd28e-2.jpg","3":"63d81f090abd89c7226abf77ef3fd28e-3.jpg"}},"configuration":{},"availability":{"1241893":{"aditional_price":0,"availabile":571}}}
