{"viewData":{"url_key":"sony_alpha_a6300_mirrorless_digital","name":"Sony Alpha a6300 Mirrorless Digital Camera Body with Accessory Kit (Black)","sku":"1242001","price":"748.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a6300 Mirrorless Digital Camera Body with Accessory Kit (Black) featuring Memory Card, Spare Rechargeable Lithium-Ion Battery Camera Bag. Review Sony A6300","long_description":"Fast-focusing and 4K-shooting, the black Alpha a6300 from Sony is a versatile APS-C-format mirrorless digital camera designed for multimedia image-makers. Revolving around a redeveloped 24.2MP Exmor CMOS sensor and BIONZ X image processor, clean image quality is provided with a wide expandable sensitivity range to ISO 51200, along with accelerated readout speeds for internal 4K30 and Full HD 1080p120 video recording with full pixel readout. Stills shooters also benefit from the apt processing speed, which enables continuous shooting at 11 fps for up to 21 raw frames in a burst, as well as 14-bit raw file output. Complementing both stills and video, the sensor and processor combination also avails 4D FOCUS, which combines a wide-coverage 425-point phase-detection system with a 169-area contrast detection system for quick and precise focusing performance. This focusing system also enables High-density Tracking AF for more efficient and accurate tracking of moving subjects across the image frame. A well-rounded camera for both photographers and videographers, the a6300 is characterized by its speed and further qualified by its refined image and video quality. Complementing the imaging assets, the a6300 also sports a robust magnesium alloy body that is dust- and moisture-resistant to permit working in harsh environments. The compact profile incorporates a high-resolution XGA Tru-Finder 2.36m-dot OLED electronic viewfinder for bright, clear, eye-level viewing, and this EVF features a 120 fps viewing mode for smooth tracking of fast-moving subjects. A rear 3.0\" 921.6k-dot LCD monitor is also available and has a tilting design to benefit shooting from high and low working angles. Additionally, for wireless remote control over the camera, or for just sharing imagery online, built-in Wi-Fi with NFC permits linking with a mobile device for intuitive wireless control.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.Designed for the photographer and videographer alike, the black with yellow trim Onyx 25 Camera/Camcorder Shoulder Bag from Ruggard is designed to hold a compact camcorder with an attached battery or a mirrorless camera up to 6.75\" in length. A durable, weather-resistant nylon shell protects your gear from unwanted elements while high-density foam padding helps prevent damage from accidental impact. For added protection and organization, an included touch-connect divider securely holds your camera in place.  Small accessories like a spare battery or cleaning cloth can be slipped into either of the two zippered side pockets or the front slip pocket. In addition, three memory card pockets and an another slip pocket are conveniently located under the opening flap of the bag. Carry your gear by way of the top padded grab handle with an integrated mesh underside for added comfort when carrying by hand. Alternatively, a double-touch built-in loop securely wraps around your belt for hands-free carrying. Or, take advantage of the removable 1\" wide shoulder strap that can be adjusted from 28\" at its shortest length to 53\" at its longest length to accommodate a variety of heights and carrying preferences.The Pawa NP-FW50 Lithium-Ion Battery Pack works with the same cameras as the Sony NP-FW50. This rechargeable replacement pack features 7.4V of output power, a capacity of 1030mAh, and a rating of 7.7Wh. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effects.","images":{"0":"ba7b7cf7cef99fb93475a7a4276a8394-0.jpg","1":"ba7b7cf7cef99fb93475a7a4276a8394-1.jpg","2":"ba7b7cf7cef99fb93475a7a4276a8394-2.jpg","3":"ba7b7cf7cef99fb93475a7a4276a8394-3.jpg","4":"ba7b7cf7cef99fb93475a7a4276a8394-4.jpg"}},"configuration":{},"availability":{"1242001":{"aditional_price":0,"availabile":425}}}
