{"viewData":{"url_key":"sony_cyber_shot_dsc_hx80_digital_camera","name":"Sony Cyber-shot DSC-HX80 Digital Camera with Accessory Kit","sku":"1246196","price":"368.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Cyber-shot DSC-HX80 Digital Camera with Accessory Kit featuring 16GB SDHC Memory Card, Camera Pouch. Review Sony DSC-HX80","long_description":"Blending an advanced, low-light optimized image sensor with a long-reaching zoom, the  Cyber-shot DSC-HX80 Digital Camera from Sony is also characterized by its svelte form factor and intuitive handling design. At the heart is an 18.2MP 1/2.3\" Exmor R CMOS sensor, which features a back-illuminated design, along with a BIONZ X image processor to avail smooth image quality, reduced noise, and an expandable sensitivity range up to ISO 12800. The sensor and processor combination also avail fast performance throughout the camera system, including a 10 fps continuous shooting rate and the ability to record Full HD 1080p video at 60 fps in the XAVC S format. Balancing the imaging capabilities is an apt physical design, which incorporates both a pop-up OLED Tru-Finder electronic viewfinder and 180° tilting 3.0\" 921k-dot LCD monitor into its design, along with built-in Wi-Fi with NFC for wireless image sharing and remote camera control via a linked smartphone or tablet. Contrasting the sleek size, the HX80 is also distinguished by its expansive 30x zoom Zeiss Vario-Sonnar T* lens, which provides a 24-720mm equivalent zoom range. Spanning wide-angle to super telephoto perspectives, this lens benefits from its 5-axis Optical SteadyShot image stabilization; minimizing the appearance of camera shake to produce sharper results. A true all-in-one pocketable camera, the HX80 blends both form and function, as well as imaging versatility to handle a wide array of everyday shooting needs.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.Store, transport and protect your digital small point & shoot camera from moisture, dirt and dust with the black Lyra 30 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"92d425cb06a41043a280bac4824e402e-0.jpg","1":"92d425cb06a41043a280bac4824e402e-1.jpg","2":"92d425cb06a41043a280bac4824e402e-2.jpg","3":"92d425cb06a41043a280bac4824e402e-3.jpg"}},"configuration":{},"availability":{"1246196":{"aditional_price":0,"availabile":854}}}
