{"viewData":{"url_key":"nikon_coolpix_b500_digital_camera","name":"Nikon COOLPIX B500 Digital Camera with Free Accessory Kit (Black)","sku":"1252976","price":"256.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon COOLPIX B500 Digital Camera with Free Accessory Kit (Black) featuring 16GB SDHC Memory Card, Shoulder Bag. Review Nikon B500","long_description":"The black COOLPIX B500 Digital Camera from Nikon features a 16MP 1/2.3\" BSI CMOS sensor for high-resolution imagery as well as Full HD 1080p video. This sensor's construction utilizes a stacked backside-illuminated design to improve clarity and image quality when working in dimly-lit conditions. The 40x optical zoom lens provides a 35mm equivalent focal range of 22.5-900mm, covering wide-angle to telephoto perspectives to suit working in a wide variety of environments. Further subject magnification can be achieved using the 80x Dynamic Fine Zoom that effectively doubles the camera's reach. The lens also features Vibration Reduction to help reduce the appearance of camera shake when shooting at the longer zoom lengths or with longer shutter speeds. A 3\" 921k-dot tilting LCD screen allows image composition from unique angles, as well as image review and menu navigation. Built-in Bluetooth low energy (BLE), Wi-Fi, and NFC connectivity allow the B500 to pair with a compatible smart device using the Nikon SnapBridge app. Images can then be easily sent to the connected smartphone or tablet, and from there shared on favorite social media sites. Designed for simple, stress-free operation with point and shoot capability for both still imagery and video, convenience is maximized by selecting from among 18 scene modes or using the Easy Auto Mode, which automatically optimizes the camera's settings even while shooting under challenging lighting conditions.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.Designed for the photographer and videographer alike, the black with yellow trim Onyx 25 Camera/Camcorder Shoulder Bag from Ruggard is designed to hold a compact camcorder with an attached battery or a mirrorless camera up to 6.75\" in length. A durable, weather-resistant nylon shell protects your gear from unwanted elements while high-density foam padding helps prevent damage from accidental impact. For added protection and organization, an included touch-connect divider securely holds your camera in place.  Small accessories like a spare battery or cleaning cloth can be slipped into either of the two zippered side pockets or the front slip pocket. In addition, three memory card pockets and an another slip pocket are conveniently located under the opening flap of the bag. Carry your gear by way of the top padded grab handle with an integrated mesh underside for added comfort when carrying by hand. Alternatively, a double-touch built-in loop securely wraps around your belt for hands-free carrying. Or, take advantage of the removable 1\" wide shoulder strap that can be adjusted from 28\" at its shortest length to 53\" at its longest length to accommodate a variety of heights and carrying preferences.","images":{"0":"058e3a35213ae6bf44752d4b1c4e192f-0.jpg","1":"058e3a35213ae6bf44752d4b1c4e192f-1.jpg","2":"058e3a35213ae6bf44752d4b1c4e192f-2.jpg","3":"058e3a35213ae6bf44752d4b1c4e192f-3.jpg"}},"configuration":{},"availability":{"1252976":{"aditional_price":0,"availabile":727}}}
