{"viewData":{"url_key":"canon_powershot_g7_x_mark","name":"Canon PowerShot G7 X Mark II Digital Camera with Free Accessory Kit","sku":"1259343","price":"649.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot G7 X Mark II Digital Camera with Free Accessory Kit featuring Memory Card, Protective Camera Case. Review Canon G7 X Mark II","long_description":"Blending notable imaging qualities with refined handling, the PowerShot G7 X Mark II Digital Camera from Canon is a compact point-and-shoot characterized by its large feature-set. Utilizing a 20.1MP 1\" CMOS sensor and DIGIC 7 image processor, this camera offers a maximum ISO 12800 in Program mode, and achieves smooth image quality with reduced noise when working in low-light conditions. Additionally, it is also capable of recording stills at up to 8 fps as well as Full HD 1080p60 video. Complementing the sensor and processor combination is a versatile 4.2x zoom lens, which provides a 24-100mm equivalent focal length range, covering wide-angle to short-telephoto perspectives. A fast f/1.8-f/2.8 maximum aperture maintains consistent performance throughout the zoom range and also benefits working in difficult lighting conditions. The lens design is surrounded by a familiar control ring that offers intuitive control over settings, and a large 3.0\" 1.04m-dot tilting touchscreen LCD provides a natural means for composing imagery from a variety of shooting angles. Additionally, the G7 X Mark II also features built-in Wi-Fi with NFC for wireless sharing of imagery to smartphones or tablets, as well as remote camera control from linked mobile devices.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The HFV-260 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.With the Watson NB-13L V2 Lithium-Ion Battery Pack, you can power any camera that runs on the Canon NB-13L. This replacement battery improves on the previous version by adding compatibility with the Powershot G9 X Mark II. It features a 1010mAh capacity, 3.6V of output power, and a 3.636Wh energy consumption rate. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.","images":{"0":"64348bc277b0e647b3a259d1c34d105d-0.jpg","1":"64348bc277b0e647b3a259d1c34d105d-1.jpg","2":"64348bc277b0e647b3a259d1c34d105d-2.jpg","3":"64348bc277b0e647b3a259d1c34d105d-3.jpg","4":"64348bc277b0e647b3a259d1c34d105d-4.jpg"}},"configuration":{},"availability":{"1259343":{"aditional_price":0,"availabile":759}}}
