{"viewData":{"url_key":"canon_1263c103_eos_80d_dslr_camera","name":"Canon EOS 80D DSLR Camera with 18-135mm Lens Video Creator Kit","sku":"1261371","price":"1,499.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS 80D DSLR Camera with 18-135mm Lens Video Creator Kit featuring 24.2MP APS-C CMOS Sensor, DIGIC 6 Image Processor 3.0&quot; 1.04m-Dot Vari-Angle Touchscreen. Review Canon 80D","long_description":"Characterized by versatile imaging specs, the Canon EOS 80D further clarifies itself using a pair of robust focusing systems and an intuitive design. Featuring a 24.2MP APS-C CMOS sensor and DIGIC 6 image processor, this sleek DSLR is capable of capturing high-resolution images at up to 7 fps and Full HD 1080p60 video, both with reduced noise and high sensitivity up to an expanded ISO 25600 for working in difficult lighting conditions. When working with the optical viewfinder, an apt 45-point all cross-type AF system affords fast performance in a range of lighting conditions for tracking moving subjects and working in low light, while the Dual Pixel CMOS AF system benefits live view shooting and movie recording by providing a smooth, natural focusing quality akin to the way a camcorder acquires focus. Touch-to-focus is availed by the large 3.0\" 1.04m-dot touchscreen LCD, which also sports a swiveling vari-angle design for working from high and low angles with ease. Additionally, built-in Wi-Fi with NFC allows you to pair mobile devices with the camera to wirelessly transfer files for sharing your photos and movies online. More than just a well-connected DSLR, the 80D is equally matched in imaging versatility due to its inclusion of multimedia feature-sets for stills shooting and movie recording.Included with the camera body is the EF-S 18-135mm f/3.5-5.6 IS USM lens, which offers a 28.8mm equivalent focal length. One Ultra-Low Dispersion element and one aspherical element control aberrations and distortions throughout the zoom range and an Optical Image Stabilizer minimizes the appearance of camera shake for sharper handheld shooting. The lens also features a unique NANO USM autofocus system, which combines ring-type USM and STM focusing mechanisms to provide the focusing speed and accuracy required by photographers and the smoothness and quietness required by videographers.The VideoMic GO Lightweight On-Camera Microphone from Rode is a lightweight microphone which adds high-quality audio recording to your small camcorder and HDSLR camera. At only 2.6 ounces, the microphone keeps your camera setup lightweight, making it ideal for handheld shooting. It features an integrated Rycote Lyre shock mount for isolation from bumps and vibration, and offers battery-free operation, using instead the plug-in power from your camera's 3.5mm microphone input. Please note that the microphone will not work with cameras that don't supply plug-in power to their 3.5mm audio input jack.The VideoMic GO is a directional microphone. It utilizes a supercardioid polar pattern to attenuate sounds from the sides, resulting in a signal that sounds closer to the camera, even when shooting in noisy environments or at moderate distances. The integrated shoe mount provides a 3/8\" thread for additional mounting options. A foam windshield and 7.9\" dual mono 3.5mm coiled output cable is included.Designed to provide smoother, more natural zoom movements when recording video, the PZ-E1 Power Zoom Adapter is compatible with the Canon EF-S 18-135mm f/3.5-5.6 IS USM lens, and facilitates electronic zoom control. The adapter connects to the lens via an integrated locking mechanism, it features both speed mode and zoom mode switches, and remote-controlled zooming is also possible in conjunction with the EOS 80D using the Canon Camera Connect app or EOS Utility software. Compared to manually rotating the lens' zoom ring, this adapter enables steadier adjustment over zooming speed for repeatable effects.","images":{"0":"ac81408ee24b856061459f136fedf72a-0.jpg","1":"ac81408ee24b856061459f136fedf72a-1.jpg","2":"ac81408ee24b856061459f136fedf72a-2.jpg","3":"ac81408ee24b856061459f136fedf72a-3.jpg","4":"ac81408ee24b856061459f136fedf72a-4.jpg","5":"ac81408ee24b856061459f136fedf72a-5.jpg","6":"ac81408ee24b856061459f136fedf72a-6.jpg","7":"ac81408ee24b856061459f136fedf72a-7.jpg","8":"ac81408ee24b856061459f136fedf72a-8.jpg","9":"ac81408ee24b856061459f136fedf72a-9.jpg","10":"ac81408ee24b856061459f136fedf72a-10.jpg","11":"ac81408ee24b856061459f136fedf72a-11.jpg","12":"ac81408ee24b856061459f136fedf72a-12.jpg","13":"ac81408ee24b856061459f136fedf72a-13.jpg","14":"ac81408ee24b856061459f136fedf72a-14.jpg","15":"ac81408ee24b856061459f136fedf72a-15.jpg","16":"ac81408ee24b856061459f136fedf72a-16.jpg","17":"ac81408ee24b856061459f136fedf72a-17.jpg","18":"ac81408ee24b856061459f136fedf72a-18.jpg","19":"ac81408ee24b856061459f136fedf72a-19.jpg","20":"ac81408ee24b856061459f136fedf72a-20.jpg","21":"ac81408ee24b856061459f136fedf72a-21.jpg","22":"ac81408ee24b856061459f136fedf72a-22.jpg","23":"ac81408ee24b856061459f136fedf72a-23.jpg"}},"configuration":{},"availability":{"1261371":{"aditional_price":0,"availabile":310}}}
