{"viewData":{"url_key":"canon_powershot_sx620_hs_digital","name":"Canon PowerShot SX620 HS Digital Camera with Free Accessory Kit (Black)","sku":"1263878","price":"249.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot SX620 HS Digital Camera with Free Accessory Kit (Black) featuring Protective Camera Case, Memory Card. Review Canon SX620 HS","long_description":"Characterized by its long-reaching zoom, the black PowerShot SX620 HS from Canon is a sleek digital camera featuring a high-resolution 20.2MP CMOS sensor along with a powerful DIGIC 4+ image processor. The sensor and processor combine to form the Canon HS SYSTEM, which produces imagery with notable clarity and quality, as well as reduced noise when working at high sensitivities in low-light conditions. The sensor and processor also permit recording Full HD 1080p video at 30 fps, shooting stills at up to 7.1 fps, and working with sensitivities up to ISO 3200 to suit shooting in difficult lighting conditions. Complementing the imaging capabilities is a 25x optical zoom lens, which covers a wide-angle to super telephoto 25-625mm-equivalent focal length range, and Intelligent IS serves to balance this reach by minimizing the appearance of camera shake for sharper handheld shooting. The sleek form factor of the camera is accented by a large 3.0\" 922k-dot LCD screen for composing imagery and reviewing your shots, and built-in Wi-Fi with NFC enables wireless sharing and remote camera control from a linked smartphone or tablet.Store, transport and protect your digital small point & shoot camera from moisture, dirt and dust with the black Lyra 30 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.","images":{"0":"6e2db2551ac088583555a8f1e3723958-0.jpg","1":"6e2db2551ac088583555a8f1e3723958-1.jpg","2":"6e2db2551ac088583555a8f1e3723958-2.jpg","3":"6e2db2551ac088583555a8f1e3723958-3.jpg"}},"configuration":{},"availability":{"1263878":{"aditional_price":0,"availabile":321}}}
