{"viewData":{"url_key":"canon_eos_5d_mark_iv","name":"Canon EOS 5D Mark IV DSLR Camera with 24-105mm f/4L II Lens","sku":"1274706","price":"3,899.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS 5D Mark IV DSLR Camera with 24-105mm f/4L II Lens featuring 30.4MP Full-Frame CMOS Sensor, DIGIC 6+ Image Processor 3.2&quot; 1.62m-Dot Touchscreen LCD Monitor. Review Canon 5D Mark IV","long_description":"Continuing on in their legacy of powerful workhorse cameras, Canon has released the 5D Mark IV DSLR with 24-105mm f/4L II Lens which is an outstanding still photography option and an able 4K-capable video machine. This multimedia maven offers a newly developed 30.4MP full-frame CMOS sensor paired with the DIGIC 6+ image processor in order to balance fine detail and resolution with low-light performance and sensitivity. It is able to work within a native range of ISO 100-32000, which can then be expanded to an impressive ISO 50-102400, for sharp, low-noise images in a variety of conditions. Along with these improvements to image quality, users will enjoy a performance boost across the board with an enhanced AF system, built-in Wi-Fi, NFC, and GPS, and much more.In order to deliver detailed images quickly and effectively the 5D Mark IV leverages the power of the DIGIC 6+ image processor, which can handle up to 7 frames per second during continuous shooting. It also uses a 150,000-pixel RGB+IR metering sensor to evaluate the scene and subjects for accurate exposures under a variety of different lighting conditions. An improved 61-point High Density Reticular AF furthers the camera's speed by tracking and locking onto subjects quickly and accurately for tack sharp photos. A new AF area select button is now available as well for near immediate access to this setting.Video benefits from the addition of Dual Pixel CMOS AF and Movie Servo AF to smoothly rack focus during a shot. Shooters can even make use of the 3.2\" 1.62m-dot touchscreen LCD to simply tap to adjust the focus point. Furthermore, now that the camera has DCI 4K (4096 x 2160) video recording at up to 30 fps, users can snag 8.8MP stills from the video for an even faster capture option. Tied into the Dual Pixel sensor architecture is a brand new feature for Canon: Dual Pixel RAW, which allows for fine tuning of certain image parameters, including bokeh shift and focus micro adjustment, after the image is taken.The body has been further refined for comfort and ease of access, as well as durability and weather resistance. The Canon N3 remote port has been relocated to the front of the camera body and they have added both GPS and Wi-Fi with NFC to make this model a connected camera. This kit bundles the camera with the EF 24-105mm f/4L IS II USM Lens, an updated version of one of the most popular zoom lenses ever available in Canon's lens lineup. Offering an extremely versatile 24-105mm zoom range as well as a constant f/4 maximum aperture and image stabilizer, users can shoot a variety of subjects with ease. This model also features improved peripheral illumination compared to its predecessor.","images":{"0":"763fc1916c743e47db98a48696ab4b69-0.jpg","1":"763fc1916c743e47db98a48696ab4b69-1.jpg","2":"763fc1916c743e47db98a48696ab4b69-2.jpg","3":"763fc1916c743e47db98a48696ab4b69-3.jpg","4":"763fc1916c743e47db98a48696ab4b69-4.jpg","5":"763fc1916c743e47db98a48696ab4b69-5.jpg","6":"763fc1916c743e47db98a48696ab4b69-6.jpg","7":"763fc1916c743e47db98a48696ab4b69-7.jpg","8":"763fc1916c743e47db98a48696ab4b69-8.jpg","9":"763fc1916c743e47db98a48696ab4b69-9.jpg","10":"763fc1916c743e47db98a48696ab4b69-10.jpg","11":"763fc1916c743e47db98a48696ab4b69-11.jpg","12":"763fc1916c743e47db98a48696ab4b69-12.jpg","13":"763fc1916c743e47db98a48696ab4b69-13.jpg","14":"763fc1916c743e47db98a48696ab4b69-14.jpg","15":"763fc1916c743e47db98a48696ab4b69-15.jpg","16":"763fc1916c743e47db98a48696ab4b69-16.jpg","17":"763fc1916c743e47db98a48696ab4b69-17.jpg","18":"763fc1916c743e47db98a48696ab4b69-18.jpg","19":"763fc1916c743e47db98a48696ab4b69-19.jpg","20":"763fc1916c743e47db98a48696ab4b69-20.jpg","21":"763fc1916c743e47db98a48696ab4b69-21.jpg","22":"763fc1916c743e47db98a48696ab4b69-22.jpg","23":"763fc1916c743e47db98a48696ab4b69-23.jpg","24":"763fc1916c743e47db98a48696ab4b69-24.jpg","25":"763fc1916c743e47db98a48696ab4b69-25.jpg","26":"763fc1916c743e47db98a48696ab4b69-26.jpg","27":"763fc1916c743e47db98a48696ab4b69-27.jpg","28":"763fc1916c743e47db98a48696ab4b69-28.jpg","29":"763fc1916c743e47db98a48696ab4b69-29.jpg","30":"763fc1916c743e47db98a48696ab4b69-30.jpg","31":"763fc1916c743e47db98a48696ab4b69-31.jpg","32":"763fc1916c743e47db98a48696ab4b69-32.jpg"}},"configuration":{},"availability":{"1274706":{"aditional_price":0,"availabile":222}}}
