{"viewData":{"url_key":"canon_9128b126_eos_7d_mark_ii","name":"Canon EOS 7D Mark II DSLR Camera Body with W-E1 Wi-Fi Adapter","sku":"1276208","price":"1,399.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS 7D Mark II DSLR Camera Body with W-E1 Wi-Fi Adapter featuring 20.2MP APS-C CMOS Sensor, Dual DIGIC 6 Image Processors 3.0&quot; 1.04m-Dot Clear View II LCD Monitor. Review Canon 7D Mark II","long_description":"An already very capable imaging machine, the EOS 7D Mark II DSLR Camera Body with W-E1 Wi-Fi Adapter from Canon takes the camera's capabilities up a notch with the inclusion of an SD-card-sized item that adds Wi-Fi connectivity to the camera. Designed with a penchant for speed, the 7D Mark II is characterized by its APS-C-sized 20.2MP CMOS sensor, dual DIGIC 6 image processors, and a top continuous shooting rate of 10 fps. Both a 65-point all cross-type phase-detection AF system and Dual Pixel CMOS AF technology benefit fast, accurate focusing performance for both optical viewfinder and live view shooting. Additionally, the combination of the dual image processors along with the CMOS sensor also contribute to enhanced low-light sensitivity to a native ISO 16000, which is further expandable to ISO 51200. The 7D Mark II comfortably performs in a range of challenging situations, and while ideally situated as a tool for sports and wildlife photographers, it resides equally as well in the hands of contemporary multimedia image-makers.Complementing the 7D Mark II's still imaging assets, support for recording full HD 1080p video is available, in multiple frame rates up to 60 fps. Beyond saving to internal memory cards, uncompressed video can also be recorded to optional external recorders via an HDMI connection. Custom Movie Servo AF, which is aided by the Dual Pixel CMOS AF system, serves to highlight movie recording abilities by enabling controllable speed and sensitivity settings for continuous focusing with moving subjects.Housing the robust set of imaging capabilities is an equally robust dust and weather-sealed magnesium alloy body, which contains a durable shutter mechanism tested for up to 200,000 actuations. A fixed 3.0\" 1.04m-dot Clear View II LCD screen is incorporated into the design, along with a bright Intelligent Viewfinder II optical finder, for versatile monitoring and playback abilities. Customizable buttons are placed about the body for personalized control over different settings and a built-in GPS module automatically embeds location data into files for geotagging images when shooting.","images":{"0":"b66fa535ca34f5167a4d9f46b74351f3-0.jpg","1":"b66fa535ca34f5167a4d9f46b74351f3-1.jpg","2":"b66fa535ca34f5167a4d9f46b74351f3-2.jpg","3":"b66fa535ca34f5167a4d9f46b74351f3-3.jpg","4":"b66fa535ca34f5167a4d9f46b74351f3-4.jpg","5":"b66fa535ca34f5167a4d9f46b74351f3-5.jpg","6":"b66fa535ca34f5167a4d9f46b74351f3-6.jpg","7":"b66fa535ca34f5167a4d9f46b74351f3-7.jpg"}},"configuration":{},"availability":{"1276208":{"aditional_price":0,"availabile":413}}}
