{"viewData":{"url_key":"panasonic_lumix_dmc_lx10_digital_camera","name":"Panasonic Lumix DMC-LX10 Digital Camera with Free Accessory Kit","sku":"1299316","price":"497.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-LX10 Digital Camera with Free Accessory Kit featuring Memory Card, Camera Pouch. Review Panasonic DMC-LX10","long_description":"A pocket-sized powerhouse, Panasonic's Lumix DMC-LX10 Digital Camera offers outstanding performance through the use of a 20.1MP High Sensitivity MOS Sensor that can deliver sharp stills, UHD 4K video, and more. Combine this with a compact design that offers a 3\" LCD touchscreen that tilts up 180° for selfies, and you have an almost ideal camera for everyday carry.In order to provide sharp, richly detailed images, the LX10 features a fast Leica DC Vario-Summilux f/1.4-2.8 lens with a versatile 3x zoom range. This optic features a 35mm equivalent wide-angle to telephoto range of 24-72mm, making it useful in a range of different situations. Also, the 20.1MP sensor furthers the camera's abilities with an extended sensitivity range up to ISO 25600 and continuous shooting at up to 50 fps with an electronic shutter and 10 fps with the mechanical shutter. The LX10 is equipped with a 5-axis HYBRID O.I.S.+ system for shake-free images and a 49-area autofocus system that will make sure your images are tack sharp. Hybrid shooters will appreciate the inclusion of high-quality UHD 4K video recording in the LX10. It can record at 30 or 24 fps at 100 Mbps using the MP4 format. Also, Panasonic leverages the power of this technology to provide advanced 4K PHOTO and 4K Post Focus features.Looking at the svelte metal exterior, users will appreciate an ergonomic grip and design. The LX10 has a physical lens control ring to help provide more tactile control over certain settings. Shooters who are always on the go can charge up their camera through the USB port. The camera is also boosted by the inclusion of numerous other features, such as focus stacking and Wi-Fi connectivity, making this a very capable imaging tool.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.Store, transport and protect your digital small point & shoot camera from moisture, dirt and dust with the black Lyra 40 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"f3c2e81b4c46de0f6f7c115edd86cf4b-0.jpg","1":"f3c2e81b4c46de0f6f7c115edd86cf4b-1.jpg","2":"f3c2e81b4c46de0f6f7c115edd86cf4b-2.jpg","3":"f3c2e81b4c46de0f6f7c115edd86cf4b-3.jpg"}},"configuration":{},"availability":{"1299316":{"aditional_price":0,"availabile":888}}}
