{"viewData":{"url_key":"nikon_1559b_d500_dslr_camera_body","name":"Nikon D500 DSLR Camera (Body Only, Refurbished)","sku":"1311631","price":"1,349.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D500 DSLR Camera (Body Only, Refurbished) featuring 20.9MP DX-Format CMOS Sensor, EXPEED 5 Image Processor 3.2&quot; 2,539K-Dot Tilting Touchscreen LCD. Review Nikon D500","long_description":"As the flagship model within Nikon's DX-format DSLR line, the D500 is characterized by its robust physical construction, apt imaging capabilities, and a more compact, sleek form factor than its FX brethren. Revolving around a 20.9MP CMOS sensor and EXPEED 5 image processor, this camera appeals to both still and video shooters with its fast 10 fps continuous shooting rate and UHD 4K video recording capabilities. The sensor and processor also combine to avail a native sensitivity range up to ISO 51200, which can be further expanded to ISO 1640000 for working in dark and difficult lighting conditions. Benefitting the fast shooting performance, the D500 is also characterized by its expansive Multi-CAM 20K 153-point AF system, which features 99 cross-type points for fast performance and accurate subject tracking capabilities. While sleek in stature, the D500 is by no means slim on functionality and versatility.Besides the imaging assets, this advanced DSLR also features an impressive handling design that incorporates a 3.2\", 2.36M-dot, tilting LCD touchscreen which affords a comfortable means for working from high and low angles. An updated version of SnapBridge is also featured, providing Wi-Fi connectivity with NFC, as well as Bluetooth Low Energy technology for linking your mobile device for wireless image sharing. In addition to the convenience features, the D500 is housed within a durable magnesium alloy chassis that is both dust and weather-sealed for working in inclement conditions and harsh environments.This is a refurbished item and comes with a 90-day warranty.","images":{"0":"eafe13dbe059fbbedae4949ee7cbb5dc-0.jpg","1":"eafe13dbe059fbbedae4949ee7cbb5dc-1.jpg","2":"eafe13dbe059fbbedae4949ee7cbb5dc-2.jpg","3":"eafe13dbe059fbbedae4949ee7cbb5dc-3.jpg","4":"eafe13dbe059fbbedae4949ee7cbb5dc-4.jpg","5":"eafe13dbe059fbbedae4949ee7cbb5dc-5.jpg"}},"configuration":{},"availability":{"1311631":{"aditional_price":0,"availabile":363}}}
