{"viewData":{"url_key":"canon_powershot_g9_x_mark","name":"Canon PowerShot G9 X Mark II Digital Camera with Free Accessory Kit (Silver)","sku":"1321601","price":"429.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot G9 X Mark II Digital Camera with Free Accessory Kit (Silver) featuring Memory Card, Camera Pouch. Review Canon G9 X Mark II","long_description":"A sleek, pocketable, and quite capable camera, the silver PowerShot G9 X Mark II from Canon mixes a compact form factor with advanced imaging capabilities. Pairing a 20.1MP 1\" CMOS sensor with a DIGIC 7 image processor, this combination produces clean, high-resolution image quality well-suited to working in difficult lighting conditions, with extended sensitivity to ISO 12800, and also avails quick shooting performance up to 8.2 fps for working with moving subjects. Full HD 1080p video recording is also supported, as well as in-camera time-lapse movies for producing dynamic moving image content. Complementing the imaging capabilities is a versatile 3x optical zoom lens, which covers a wide-angle to portrait-length 28-84mm equivalent focal length range, and Dynamic IS benefits this reach by minimizing the appearance of camera shake. The slim camera body also features a 3.0\" touchscreen LCD for intuitive control as well as built-in Wi-Fi with NFC and Bluetooth for wirelessly transferring imagery and remotely controlling the camera from a mobile device.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.Store, transport and protect your digital small point & shoot camera from moisture, dirt and dust with the black Lyra 30 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"81a1b703cb1490e7b89a84b3525ba0c3-0.jpg","1":"81a1b703cb1490e7b89a84b3525ba0c3-1.jpg","2":"81a1b703cb1490e7b89a84b3525ba0c3-2.jpg","3":"81a1b703cb1490e7b89a84b3525ba0c3-3.jpg"}},"configuration":{},"availability":{"1321601":{"aditional_price":0,"availabile":558}}}
