{"viewData":{"url_key":"olympus_v207060bu000_kt_e_m1_ii_digital_camera","name":"Olympus OM-D E-M1 Mark II Mirrorless Micro Four Thirds Camera with 12-40mm f/2.8 Lens Kit (Black)","sku":"1322174","price":"1,998.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Olympus OM-D E-M1 Mark II Mirrorless Micro Four Thirds Camera with 12-40mm f/2.8 Lens Kit (Black) features 20.4MP Live MOS Sensor, TruePic VIII Dual Quad Core Processor.","long_description":"Fast, durable, and versatile, the black OM-D E-M1 Mark II from Olympus is a workhorse Micro Four Thirds mirrorless camera, offering a broad range of stills and video-minded functionality. Revolving around a high-resolution 20.4MP Live MOS sensor and TruePic VIII image processor, the E-M1 Mark II sports a truly fast 60 fps continuous shooting rate with an electronic shutter, 18 fps with continuous autofocus, and 15 fps with a mechanical shutter. For video shooters, both DCI and UHD 4K recording modes can be used, along with a Time-lapse Movie mode for producing in-camera 4K time-lapse sequences. The sensor and processor also avail a top expanded sensitivity of ISO 25600 to support shooting in difficult lighting conditions, and sensor-shift-type 5-axis image stabilization also helps to minimize the appearance of camera shake for sharper handheld shooting. Additionally, the sensor's design also incorporates 121 on-chip phase-detection points, all of which are cross-type, along with 121 contrast-detection areas for fast and precise focusing and subject tracking performance. Complementing the imaging capabilities, the E-M1 Mark II also sports a durable magnesium alloy design that is weather-resistant for working in harsh climates. The body also features both a 2.36m-dot electronic viewfinder and 3.0\" 1.04m-dot vari-angle LCD touchscreen for intuitive control and working from a variety of angles. Built-in Wi-Fi further expands sharing and remote shooting capabilities, and dual SD card slots and a USB 3.0 Type C port expand file saving and tethered shooting options.A flexible zoom covering a popular focal length range, the M.Zuiko Digital ED 12-40mm f/2.8 PRO from Olympus is a wide-to-portrait-length 24-80mm equivalent lens for Micro Four Thirds mirrorless cameras. Its sophisticated optical design, which includes a variety of aspherical, low dispersion, and high refractive index elements, reduces both chromatic and spherical aberrations throughout the zoom range for notable clarity, sharpness, and color accuracy. A ZERO lens coating has also been applied to improve contrast when working in strong lighting conditions. Beyond the advanced lens design, this zoom is also characterized by its constant f/2.8 maximum aperture, as well as its durable weather-sealed construction for working in a variety of conditions. Additionally, a Movie & Still Compatible autofocus system achieves fast, smooth, and silent focusing performance, and a manual focus clutch affords instant switching between focusing methods.","images":{"0":"4d6f2228c08c26513574077d0a62d845-0.jpg","1":"4d6f2228c08c26513574077d0a62d845-1.jpg","2":"4d6f2228c08c26513574077d0a62d845-2.jpg"}},"configuration":{},"availability":{"1322174":{"aditional_price":0,"availabile":629}}}
