{"viewData":{"url_key":"sony_alpha_a6500_mirrorless_digital","name":"Sony Alpha a6500 Mirrorless Digital Camera Body with Free Accessory Kit","sku":"1326406","price":"1,198.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a6500 Mirrorless Digital Camera Body with Free Accessory Kit featuring 64GB SDXC Memory Card, Spare Rechargeable Li-Ion Battery Shoulder Bag. Review Sony A6500","long_description":"Stable, fast, and versatile, the Alpha a6500 from Sony is an apt APS-C-format mirrorless camera well-suited for both photo and video applications. Revolving around a 24.2MP Exmor CMOS sensor and BIONZ X image processor, clean image quality is provided with a wide expandable sensitivity range to ISO 51200, along with accelerated readout speeds for internal 4K30 and Full HD 1080p120 video recording with full pixel readout. The processor further benefits videographers with the inclusion of an S&Q (Slow & Quick) Motion setting that permits capturing Full HD video at a variety of frame rates ranging from 1-120 fps. Stills shooters also benefit from the apt processing speed, which enables continuous shooting at 11 fps for up to 301 JPEGs in a burst, as well as 14-bit raw file output. Complementing both stills and video, 5-axis SteadyShot INSIDE image stabilization minimizes the appearance of camera shake with all mounted lenses to support working with slower shutter speeds. The sensor and processor combination also avails 4D FOCUS, which utilizes a wide-coverage 425-point phase-detection system with a 169-area contrast detection system for quick and precise focusing performance. This focusing system also enables High-density Tracking AF for more efficient and accurate tracking of moving subjects across the image frame. Increasingly versatile and fully featured in both photo and video realms, the a6500 is a fast and precise imaging tool for multimedia capture.Complementing the imaging assets, the a6500 also sports a robust magnesium alloy body that is dust- and moisture-resistant to permit working in harsh environments. The compact profile incorporates a high-resolution XGA Tru-Finder 2.36m-dot OLED electronic viewfinder for bright, clear, eye-level viewing, and this EVF features a 120 fps viewing mode for smooth tracking of fast-moving subjects. A rear 3.0\" 921.6k-dot touchscreen LCD monitor is also available and has a tilting design to benefit shooting from high and low working angles, and the touchscreen design allows for intuitive touch-to-focus control. Additionally, for wireless remote control over the camera, or for just sharing imagery online, built-in Wi-Fi with NFC permits linking with a mobile device for intuitive wireless control.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.Designed for the photographer and videographer alike, the black with yellow trim Onyx 25 Camera/Camcorder Shoulder Bag from Ruggard is designed to hold a compact camcorder with an attached battery or a mirrorless camera up to 6.75\" in length. A durable, weather-resistant nylon shell protects your gear from unwanted elements while high-density foam padding helps prevent damage from accidental impact. For added protection and organization, an included touch-connect divider securely holds your camera in place.  Small accessories like a spare battery or cleaning cloth can be slipped into either of the two zippered side pockets or the front slip pocket. In addition, three memory card pockets and an another slip pocket are conveniently located under the opening flap of the bag. Carry your gear by way of the top padded grab handle with an integrated mesh underside for added comfort when carrying by hand. Alternatively, a double-touch built-in loop securely wraps around your belt for hands-free carrying. Or, take advantage of the removable 1\" wide shoulder strap that can be adjusted from 28\" at its shortest length to 53\" at its longest length to accommodate a variety of heights and carrying preferences.The Watson NP-FW50 Lithium-Ion Battery Pack works with the same cameras as the Sony NP-FW50. This replacement battery pack features a capacity of 1100mAh, 7.4V of output power and 8.14 watt-hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.","images":{"0":"a616373c78c136ba44dfaeb34e7ec4c2-0.jpg","1":"a616373c78c136ba44dfaeb34e7ec4c2-1.jpg","2":"a616373c78c136ba44dfaeb34e7ec4c2-2.jpg","3":"a616373c78c136ba44dfaeb34e7ec4c2-3.jpg","4":"a616373c78c136ba44dfaeb34e7ec4c2-4.jpg"}},"configuration":{},"availability":{"1326406":{"aditional_price":0,"availabile":574}}}
