{"viewData":{"url_key":"canon_eos_rebel_t7i_dslr","name":"Canon EOS Rebel T7i DSLR Camera with 18-55mm and 55-250mm Lenses Kit","sku":"1329244","price":"949.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS Rebel T7i DSLR Camera with 18-55mm and 55-250mm Lenses Kit featuring 24.2MP APS-C CMOS Sensor, DIGIC 7 Image Processor 3.0&quot; 1.04m-Dot Vari-Angle Touchscreen. Review Canon Rebel T7i","long_description":"Packing a versatile feature-set in a sleek and portable body, the EOS Rebel T7i DSLR from Canon offers advanced imaging capabilities along with a convenient range of controls and connectivity. Utilizing a 24.2MP APS-C CMOS sensor and DIGIC 7 image processor, the Rebel T7i is able to capture high-resolution stills and video with an expanded sensitivity range of ISO 100-51200 to suit working in a wide variety of lighting conditions. The sensor and processor combination also avails 6 fps continuous shooting for working with moving subjects. Benefitting the imaging attributes, the sensor's design also facilitates Dual Pixel CMOS AF, which uses phase-detection autofocus for quick, accurate, and smooth focusing performance when recording movies or shooting stills in live view. When shooting stills using the optical viewfinder, a 45-point all cross-type phase-detection system is used for quick and accurate focusing in a variety of shooting scenarios.In regard to the physical design, a large 3.0\" 1.04m-dot touchscreen LCD is featured for intuitive settings control and live view monitoring, and it uses a vari-angle design to permit easier viewing from high and low working angles. Additionally, built-in Wi-Fi with NFC is available for quick and convenient pairing with a smartphone or tablet for wireless image sharing, and Bluetooth is also featured for image sharing to and remote camera control from a mobile device.Suitable for distant subject matter, the EF-S 55-250mm f/4-5.6 IS STM is an 88-400mm-equivalent zoom for Canon APS-C DSLRs. This lens's long reach is enhanced by the inclusion of an Ultra-Low Dispersion element, which helps to greatly reduce color fringing and chromatic aberrations for greater clarity and color accuracy throughout the zoom range. A Super Spectra coating is also featured, and minimizes flare and ghosting in order to produce greater contrast when working in bright lighting conditions. Benefitting both photo and video applications, an STM stepping AF motor is used to realize quick and near-silent autofocus performance along with full-time manual focus override. Additionally, a four-stop-effective Image Stabilizer system is also featured and minimizes the appearance of camera shake for sharper handheld shooting.Store and protect your DSLR camera with 1-2 lenses and assorted accessories in this black EOS Shoulder Bag 100ES from Canon. This bag features a main compartment with a touch-fastening, padded divider for organizing your gear, and a large weather flap with a quick-release buckle for protection from the elements. Carry your 100ES with the padded top handle or adjustable shoulder strap. For added comfort, the shoulder strap has a sliding, non-slip pad. A light gray interior is useful for locating gear under low light. The bag is made of water-repellent nylon for strength, protection, and durability.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 16GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 16GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the U3 speed class, which guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 16GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.","images":{"0":"21dba7177fba585b3a5a9073c69aa9bc-0.jpg","1":"21dba7177fba585b3a5a9073c69aa9bc-1.jpg","2":"21dba7177fba585b3a5a9073c69aa9bc-2.jpg","3":"21dba7177fba585b3a5a9073c69aa9bc-3.jpg","4":"21dba7177fba585b3a5a9073c69aa9bc-4.jpg"}},"configuration":{},"availability":{"1329244":{"aditional_price":0,"availabile":977}}}
