{"viewData":{"url_key":"panasonic_lumix_dc_fz80_digital_camera","name":"Panasonic Lumix DC-FZ80 Digital Camera with Free Accessory Kit","sku":"1329682","price":"297.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-FZ80 Digital Camera with Free Accessory Kit featuring Memory Card, Holster-Style Camera Bag. Review Panasonic DC-FZ80","long_description":"Mixing long-zoom capabilities with multimedia recording versatility, the Lumix DC-FZ80 from Panasonic pairs an expansive 60x zoom lens with high-resolution stills and 4K video shooting functionality. Revolving around an 18.1MP High-Sensitivity MOS sensor, the FZ80 has a top sensitivity of ISO 6400 for working in low-light conditions as well as a 10 fps shooting rate and UHD 4K/30p video recording at 100 Mbps. The 4K capabilities are extended to stills applications, too, and allow for 30 fps shooting at 8MP as well as the ability to use Post Focus for choosing your specific point of focus after shooting. Complementing these imaging assets is a Lumix DC Vario lens, which provides a 20-1200mm equivalent focal length range, along with POWER O.I.S. to minimize the appearance of camera shake for sharper handheld shooting.Benefitting these performance attributes is an ergonomic body design that incorporates both a 1.166m-dot electronic viewfinder, for eye-level monitoring, as well as a 3.0\" 1.04m-dot touchscreen LCD for intuitive control of shooting settings. Built-in Wi-Fi is also featured for wireless image sharing and remote camera control from a linked smartphone or tablet.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. ","images":{"0":"663654212e3185cad198026d65d771eb-0.jpg","1":"663654212e3185cad198026d65d771eb-1.jpg","2":"663654212e3185cad198026d65d771eb-2.jpg","3":"663654212e3185cad198026d65d771eb-3.jpg"}},"configuration":{},"availability":{"1329682":{"aditional_price":0,"availabile":197}}}
