{"viewData":{"url_key":"panasonic_lumix_dmc_g85_mirrorless_micro","name":"Panasonic Lumix DMC-G85 Mirrorless Micro Four Thirds Digital Camera with 12-60mm Lens and Accessory Kit","sku":"1333061","price":"697.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-G85 Mirrorless Micro Four Thirds Digital Camera with 12-60mm Lens and Accessory Kit featuring G Vario 12-60mm f/3.5-5.6 ASPH. Lens, Memory Card Spare Rechargeable Lithium-Ion Battery. Review Panasonic DMC-G85","long_description":"Designed for video and stills shooters alike, the Lumix DMC-G85 from Panasonic is a versatile Micro Four Thirds camera characterized by its quick performance, flexible photo capabilities, and UHD 4K video recording. Using a 16MP MOS sensor, this mirrorless camera has a sensitivity range from ISO 200-25600 to suit working in a variety of lighting conditions, and also affords quick shooting speeds up to 10 fps with single-shot autofocus, or 6 fps with continuous autofocus, as well as up to 40 fps when using an electronic shutter function and 30 fps at 8MP with 4K PHOTO Modes. Benefitting working in difficult lighting conditions, 5-axis sensor-shift image stabilization can be used to dramatically reduce the appearance of camera shake, and this IS system pairs with select lens' image stabilization systems for Dual I.S.Complementing the imaging attributes, the camera also incorporates both a 2.36m-dot electronic viewfinder as well as a 3.0\" 1.04m-dot touchscreen LCD, which has a free-angle design to better enable working from high and low angles. Built-in Wi-Fi is also integrated into the design, which facilitates wireless image transferring and remote camera control from linked smartphones or tablets. Additionally, the body construction is weather-sealed to guard against dust and moisture for working in inclement weather conditions.Included with the camera body is the Lumix G Vario 12-60mm f/3.5-5.6 ASPH. POWER O.I.S., which is a standard zoom lens that provides a 24-120mm equivalent focal length range. Its optical design incorporates three aspherical elements and one extra-low dispersion element to reduce both chromatic and spherical aberrations throughout the zoom range. POWER O.I.S. is also featured to minimize the appearance of camera shake, and works in conjunction with the camera's sensor-shift IS for more effective shake correction.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. The Watson DMW-BLC12 Lithium-Ion Battery Pack works with the same cameras as the Panasonic DMW-BLC12, Leica BP-DC12, and Sigma BP-51 batteries. This replacement battery pack features a capacity of 1100mAh, 7.2V of output power, and 7.92 watt-hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.","images":{"0":"ed4d1eb250e9407b2b6ee71aecf1fcfb-0.jpg","1":"ed4d1eb250e9407b2b6ee71aecf1fcfb-1.jpg","2":"ed4d1eb250e9407b2b6ee71aecf1fcfb-2.jpg","3":"ed4d1eb250e9407b2b6ee71aecf1fcfb-3.jpg","4":"ed4d1eb250e9407b2b6ee71aecf1fcfb-4.jpg"}},"configuration":{},"availability":{"1333061":{"aditional_price":0,"availabile":415}}}
