{"viewData":{"url_key":"olympus_v104190ru000_tg_5_digital_camera_red","name":"Olympus Tough TG-5 Digital Camera (Red)","sku":"1335060","price":"399.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Olympus Tough TG-5 Digital Camera (Red) featuring 12MP BSI CMOS Sensor, TruePic VIII Image Processor Olympus 4x Optical Zoom f/2 Lens. Review Olympus TG-5","long_description":"Designed for the adventurous type, the red Tough TG-5 Digital Camera from Olympus is a durable point-and-shoot with a rugged physical construction and apt imaging capabilities. Utilizing a 12MP BSI CMOS sensor and TruePic VIII image processor, the TG-5 offers notable image clarity and low-light performance, to ISO 12800, along with fast 20 fps continuous shooting, 4K/30p video recording, and high-speed Full HD 1080p shooting at 120 fps. Balancing the imaging capabilities is a versatile 4x optical zoom lens, which spans a 25-100mm equivalent range, and has an f/2 maximum aperture to benefit working in low-light conditions. Additionally, the Variable Macro System also positions this lens for close-up shooting with subjects just one centimeter away for true macro photography. Complementing the sensor and optical attributes of the TG-5 is a robust set of features for withstanding the elements, tracking your adventures, and sharing your images. The camera is rated for underwater use, as well as tested to withstand falls and crushing, and is hermetically sealed against dust and moisture for assured use in trying conditions. Making use of these stats, a Field Sensor System incorporates GPS, a manometer, compass, and a thermometer for recording the details of your environment and embedding this data onto your photos and movies. Using built-in Wi-Fi and the OI.Track app, the recording log data and the imagery can be shared to a mobile device for compositing and sharing online.","images":{"0":"6508385f6ed939dd71291f4946596aaa-0.jpg","1":"6508385f6ed939dd71291f4946596aaa-1.jpg","2":"6508385f6ed939dd71291f4946596aaa-2.jpg","3":"6508385f6ed939dd71291f4946596aaa-3.jpg","4":"6508385f6ed939dd71291f4946596aaa-4.jpg","5":"6508385f6ed939dd71291f4946596aaa-5.jpg","6":"6508385f6ed939dd71291f4946596aaa-6.jpg","7":"6508385f6ed939dd71291f4946596aaa-7.jpg","8":"6508385f6ed939dd71291f4946596aaa-8.jpg","9":"6508385f6ed939dd71291f4946596aaa-9.jpg","10":"6508385f6ed939dd71291f4946596aaa-10.jpg","11":"6508385f6ed939dd71291f4946596aaa-11.jpg","12":"6508385f6ed939dd71291f4946596aaa-12.jpg","13":"6508385f6ed939dd71291f4946596aaa-13.jpg","14":"6508385f6ed939dd71291f4946596aaa-14.jpg","15":"6508385f6ed939dd71291f4946596aaa-15.jpg","16":"6508385f6ed939dd71291f4946596aaa-16.jpg","17":"6508385f6ed939dd71291f4946596aaa-17.jpg"}},"configuration":{},"availability":{"1335060":{"aditional_price":0,"availabile":952}}}
