{"viewData":{"url_key":"canon_eos_5d_mark_iv","name":"Canon EOS 5D Mark IV DSLR Camera Body Basic Kit","sku":"1342778","price":"3,071.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS 5D Mark IV DSLR Camera Body Basic Kit featuring 64GB SDXC Memory Card, Shoulder Bag Spare Rechargeable Lithium-Ion Battery. Review Canon 5D Mark IV","long_description":"Continuing on in their legacy of powerful workhorse cameras, Canon has released the 5D Mark IV DSLR which is an outstanding still photography option and an able 4K-capable video machine. This multimedia maven offers a newly developed 30.4MP full-frame CMOS sensor paired with the DIGIC 6+ image processor in order to balance fine detail and resolution with low-light performance and sensitivity. It is able to work within a native range of ISO 100-32000, which can then be expanded to an impressive ISO 50-102400, for sharp, low-noise images in a variety of conditions. Along with these improvements to image quality, users will enjoy a performance boost across the board with an enhanced AF system, built-in Wi-Fi, NFC, and GPS, and much more.In order to deliver detailed images quickly and effectively the 5D Mark IV leverages the power of the DIGIC 6+ image processor, which can handle up to 7 frames per second during continuous shooting. It also uses a 150,000-pixel RGB+IR metering sensor to evaluate the scene and subjects for accurate exposures under a variety of different lighting conditions. An improved 61-point High Density Reticular AF furthers the camera's speed by tracking and locking onto subjects quickly and accurately for tack sharp photos. A new AF area select button is now available as well for near immediate access to this setting.Video benefits from the addition of Dual Pixel CMOS AF and Movie Servo AF to smoothly rack focus during a shot. Shooters can even make use of the 3.2\" 1.62m-dot touchscreen LCD to simply tap to adjust the focus point. Furthermore, now that the camera has DCI 4K (4096 x 2160) video recording at up to 30 fps, users can snag 8.8MP stills from the video for an even faster capture option. Tied into the Dual Pixel sensor architecture is a brand new feature for Canon: Dual Pixel RAW, which allows for fine tuning of certain image parameters, including bokeh shift and focus micro adjustment, after the image is taken.The body has been further refined for comfort and ease of access, as well as durability and weather resistance. The Canon N3 remote port has been relocated to the front of the camera body and they have added both GPS and Wi-Fi with NFC to make this model a connected camera.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme PRO UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 170 MB/s and write speeds max out at 90 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s. As with most SanDisk cards, this memory card is shockproof, X-ray proof, waterproof, while also being able to withstand temperatures from -13 to 185°F, allowing you to take this card with you into extreme environments, such as snow, deserts, and pools. Should the card's data become compromised, you also benefit from the option to download RescuePRO Deluxe software as well as a limited lifetime warranty.Store, protect, and transport your compact DSLR or mirrorless camera with an attached lens, flash, related accessories, and up to three extra lenses with the lightweight, black Journey 44 DSLR Shoulder Bag from Ruggard. This handsome bag features a large flap with a quick release buckle, and double-pull zipper closure. The main compartment has four padded, touch-fastening dividers for organizing equipment. A light gray interior lining makes it easier to locate gear in low light. Under the lid is a large, zippered, mesh accessory pocket. Small accessories are easily accommodated in the front exterior zippered pocket. Inside this pocket are two slip-in pockets, two memory card pockets with touch-fastening flaps, and a zippered mesh pocket.  Photographers will appreciate the neoprene water bottle/accessory pocket located on the exterior left side of the bag. On the opposite side is a strap for attaching accessories. Carry the Journey 44 Shoulder Bag by the padded top handle, or wear with the removable, adjustable, padded shoulder strap. The strap has swiveling snap-hooks that attach to metal D-rings on either side of bag. And on the back of the bag is a trolley strap that comes in handy when traveling with rolling luggage. Two strips of plastic feet on the bottom of the bag help protect it against abrasion. This well-made bag is constructed from weather-resistant polyester and ballistic nylon.The Watson LP-E6N Lithium-Ion Battery Pack works with all cameras and camcorders that take the Canon LP-E6N or LP-E6. This replacement battery pack with a Japanese-made cell features a 2000mAh capacity, 7.2V of output power, and 14.4 watt-hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.Trigger your camera's shutter wirelessly with the FreeWave Plus Wireless Remote Shutter Release from Vello, a lightweight remote control system that will help you avoid unwanted camera movement. This 2.4 GHz model is compatible with Canon cameras and will work both wired and wirelessly up to 320', depending on your own needs and setup. This makes it useful for photographing wildlife or for macro and long exposures where it is necessary to eliminate any chance of camera shake.  The FreeWave system also has access to 16 channels for triggering multiple receivers and has an internal antenna that will be protected from any accidental damage. Multiple features are available for shooting, such as a four-second delay as well as multi-exposure and long exposure modes. The device also has a dual function release, enabling focus on half press and triggering the shutter release on a full press. Additionally, it has LED indicators to confirm pre-focus and exposure while in wireless mode and the receiver and transmitter each run on two AAA batteries.This LCD Screen Protector Ultra from Vello is a sheet of ultra-thin (0.02\") optical glass used to safeguard the LCD monitor of the Canon 5D Mark III, 5D Mark IV, 5DS, and 5DS R. It easily adheres to the screen via static, without trapping air bubbles, and if removed, won't leave a sticky residue behind. Multiple layers of protective material shield your display from dirt, scratches, sweat, smears, and light impact. The shatter-proof glass blocks UV rays while allowing visible light in. It can be easily cleaned using the supplied microfiber cloth and wet wipe.This is a 2 oz Solution Spray Bottle from Field Optics Research. It contains a specially designed cleaning formula that is particularly effective on high-end optics with anti-reflective coatings. The non-alcohol based formula can be used on all lenses to help keep them free from fingerprints, dust, dirt and smudges. The bottle produces a fine mist that is easy to remove.","images":{"0":"c8bccfd656b222e6ba034e25b0328162-0.jpg","1":"c8bccfd656b222e6ba034e25b0328162-1.jpg","2":"c8bccfd656b222e6ba034e25b0328162-2.jpg","3":"c8bccfd656b222e6ba034e25b0328162-3.jpg","4":"c8bccfd656b222e6ba034e25b0328162-4.jpg","5":"c8bccfd656b222e6ba034e25b0328162-5.jpg","6":"c8bccfd656b222e6ba034e25b0328162-6.jpg","7":"c8bccfd656b222e6ba034e25b0328162-7.jpg"}},"configuration":{},"availability":{"1342778":{"aditional_price":0,"availabile":584}}}
