{"viewData":{"url_key":"panasonic_lumix_dc_zs70_digital_camera","name":"Panasonic Lumix DC-ZS70 Digital Camera with Free Accessory Kit (Silver)","sku":"1344037","price":"347.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-ZS70 Digital Camera with Free Accessory Kit (Silver) featuring Memory Card. Review Panasonic DC-ZS70","long_description":"A pocketable multimedia powerhouse, the silver Lumix DC-ZS70 Digital Camera from Panasonic blends a sleek form factor with versatile stills and video capabilities. Revolving around a 20.3MP 1/2.3\" High-Sensitivity Live MOS sensor, the ZS70 realizes rich image quality with low noise and sensitivity to an extended ISO 6400 for working in difficult lighting conditions. The sensor and image processor also enable shooting continuously at up to 10 fps with single-shot AF, 30 fps at 8MP in 4K Photo Modes, and UHD 4K video recording at 30p. The 4K capabilities also permit working with unique Post Focus technology for choosing a specific point of focus after shooting. Beyond the imaging abilities, the ZS70 is also characterized by its impressive 30x Leica DC Vario-Elmar zoom lens, which covers a 24-720mm equivalent focal length range, as well as 5-axis HYBRID O.I.S. to minimize the appearance of camera shake for sharper handheld shooting. Also notable is the camera's compact size and incorporation of both a 1.166m-dot electronic viewfinder and 3.0\" 1.04m-dot tilting touchscreen LCD. Additionally, built-in Wi-Fi allows you to wirelessly share imagery or remotely control the camera from a linked smartphone or tablet.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.","images":{"0":"d3b5338890b61fe880082452d548d16f-0.jpg","1":"d3b5338890b61fe880082452d548d16f-1.jpg","2":"d3b5338890b61fe880082452d548d16f-2.jpg"}},"configuration":{},"availability":{"1344037":{"aditional_price":0,"availabile":533}}}
