{"viewData":{"url_key":"sony_alpha_a7s_ii_mirrorless","name":"Sony Alpha a7S II Mirrorless Digital Camera with Storage Kit","sku":"1345376","price":"1,998.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a7S II Mirrorless Digital Camera with Storage Kit featuring 12.2MP Full-Frame Exmor CMOS Sensor, BIONZ X Image Processor Internal UHD 4K30 &amp; 1080p120 Recording. Review Sony A7S II","long_description":"Making strides in the video arena, the a7S II Mirrorless Digital Camera from Sony offers an impressive blend of sensitivity, dynamic range, resolution, and speed to benefit a versatile multimedia workflow. Revolving around a full-frame 12.2MP Exmor CMOS sensor, the a7S II is capable of internal UHD 4K recording at 30 fps with full pixel readout as well as 1080p recording at up to 120 fps, all in the XAVC S format. For both stills and video recording, the BIONZ X image processor also pairs with the sensor to enable expanded sensitivity to ISO 409600, continuous shooting to 5 fps, and fast intelligent autofocus with low-light sensitivity to -4 EV. Further enabling working in difficult lighting conditions, 5-axis SteadyShot INSIDE image stabilization compensates for vertical, horizontal, pitch, yaw, and roll camera movements for sharper, smoother handheld recording.Complementing the 4K recording capabilities is a redeveloped recording setup, including the ability to utilize S-Log3 Gamma and S-Gamut3 in addition to S-Log2, for increasing dynamic range values by up to 1300% to better match high-end post-production workflows. For clearer monitoring potential, an enhanced Zebra function better supports working with S-Log gamma settings and a Gamma Display Assist helps to preview imagery with natural contrast by converting S-Log2 and S-Log3 settings to the ITU709 gamma for easier on-camera viewing.The a7S II is also characterized by a compact, yet robust, magnesium alloy body design that incorporates a high 0.78x-magnification Tru-Finder OLED electronic viewfinder. With a resolution of 2.36-million dots and a Zeiss T* anti-reflective coating, this finder benefits working in a variety of lighting conditions and is capable of previewing exposure and settings adjustments prior to recording. A rear 3.0\" 1,228,800-dot LCD screen is also available, and features a tilting design to support working from high and low angles. Additionally, built-in Wi-Fi connectivity with NFC allows you to pair mobile devices to the camera for wireless sharing and remote camera control.Start saving your precious memories and critical files with the 4TB My Passport USB 3.0 Secure Portable Hard Drive from WD. The My Passport comes formatted for Windows systems and connects to your notebook or desktop computer via an included USB 3.0 cable. On the inside, it sports a hard drive that delivers 4TB of storage capacity for storing your photos, videos, music, and other content. To power this drive, the My Passport runs off the computer's USB bus-powered port. This edition of the My Passport drive comes with a redesigned black chassis, which complements your other gear. Another notable feature is WD's Backup software, which lets you create scheduled backups, to help preserve your data automatically. In addition to backing up data, WD has armed this drive with hardware encryption and WD Security software to safeguard your sensitive files from unauthorized users.","images":{"0":"09fd591a6e4d633469381bb29dd9b769-0.jpg","1":"09fd591a6e4d633469381bb29dd9b769-1.jpg","2":"09fd591a6e4d633469381bb29dd9b769-2.jpg"}},"configuration":{},"availability":{"1345376":{"aditional_price":0,"availabile":115}}}
