{"viewData":{"url_key":"canon_eos_rebel_sl2_dslr","name":"Canon EOS Rebel SL2 DSLR Camera (Black, Body Only)","sku":"1346737","price":"499.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Canon EOS Rebel SL2 DSLR Camera (Canon SL2 Black Camera Body) features 24.2MP APS-C CMOS Sensor, DIGIC 7 Image Processor. ","long_description":"With a compact and lightweight body, the black Canon EOS Rebel SL2 DSLR Camera provides users with a fully-featured system that won't weigh them down. Packed into the tiny body is a capable 24.2MP APS-C CMOS sensor and a DIGIC 7 Image Processor, both of which work together to create sharp, vivid images at native sensitivities up to ISO 25600 and extended sensitivities up to ISO 51200. Video shooting has received a boost with Full HD 1080p recording possible at up to 60 fps. The SL2 also manages some significant body upgrades, with the main addition being a 3.0\" vari-angle touchscreen LCD for intuitive operation and the ability to work at odd angles with relative ease.  As a DSLR, the SL2 obviously retains the optical viewfinder for fast, natural composition of your images and it can shoot continuously at speeds up to 5 fps. This setup also features a 9-point AF system for capturing tack sharp images. If you are working in Live View or shooting video, the SL2 does offer Dual Pixel CMOS AF technology, providing fast, accurate focusing in these modes and with intuitive control via the touchscreen. Additionally, the SL2 has a microphone input for higher quality audio recording during movie shooting.  For those inclined to share their journeys, the SL2 features built-in Wi-Fi with NFC and Bluetooth, making connecting to a smart device fast and simple. This setup permits wireless control over camera settings as well as the ability to transfer files to your phone. The SL2 also offers a Feature Assistant to help new shooters learn how to use the camera and its functions.","images":{"0":"dde55590eff9c5008ed5d76181fc86ac-0.jpg","1":"dde55590eff9c5008ed5d76181fc86ac-1.jpg","2":"dde55590eff9c5008ed5d76181fc86ac-2.jpg","3":"dde55590eff9c5008ed5d76181fc86ac-3.jpg","4":"dde55590eff9c5008ed5d76181fc86ac-4.jpg","5":"dde55590eff9c5008ed5d76181fc86ac-5.jpg","6":"dde55590eff9c5008ed5d76181fc86ac-6.jpg","7":"dde55590eff9c5008ed5d76181fc86ac-7.jpg","8":"dde55590eff9c5008ed5d76181fc86ac-8.jpg","9":"dde55590eff9c5008ed5d76181fc86ac-9.jpg","10":"dde55590eff9c5008ed5d76181fc86ac-10.jpg","11":"dde55590eff9c5008ed5d76181fc86ac-11.jpg","12":"dde55590eff9c5008ed5d76181fc86ac-12.jpg","13":"dde55590eff9c5008ed5d76181fc86ac-13.jpg","14":"dde55590eff9c5008ed5d76181fc86ac-14.jpg","15":"dde55590eff9c5008ed5d76181fc86ac-15.jpg","16":"dde55590eff9c5008ed5d76181fc86ac-16.jpg","17":"dde55590eff9c5008ed5d76181fc86ac-17.jpg","18":"dde55590eff9c5008ed5d76181fc86ac-18.jpg","19":"dde55590eff9c5008ed5d76181fc86ac-19.jpg"}},"configuration":{},"availability":{"1346737":{"aditional_price":0,"availabile":131}}}
