{"viewData":{"url_key":"canon_eos_6d_mark_ii","name":"Canon EOS 6D Mark II DSLR Camera with 24-105mm f/4L II Lens","sku":"1346735","price":"2,399.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS 6D Mark II DSLR Camera with 24-105mm f/4L II Lens featuring 26.2MP Full-Frame CMOS Sensor, DIGIC 7 Image Processor 45-Point All-Cross Type AF System. Review Canon 6D Mark II","long_description":"Step up into the full-frame game with the EOS 6D Mark II DSLR Camera from Canon, which is made available here with the EF 24-105mm f/4 IS II USM Lens. Making high-performance full-frame imaging more accessible, the 6D Mark II makes numerous advancements over its predecessor to improve upon every aspect of image capture and creation. The main update comes in the form of a 26.2MP CMOS sensor and the use of the DIGIC 7 Image Processor to deliver sharper, more vivid imagery in a variety of shooting situations. This setup offers an improved native sensitivity range of ISO 100-40000, which can then be expanded to ISO 50-102400, as well as speedy shooting rates of up to 6.5 fps.Ensuring your images are tack sharp is a 45-point all-cross type AF system, which is able to track subjects with accuracy. This marks a significant improvement over its predecessor and will result in faster acquisition of your subject. Along with a revamped AF system, the sensor features Dual Pixel CMOS AF technology to provide a boost to focusing in live view and video shooting, which itself has been bumped up to Full HD at 60p. This setup works well with the 3.0\" 1.04m-dot vari-angle touchscreen LCD, which permits use at various angles and with intuitive controls.For hybrid stills/video shooters, you will enjoy the enhanced video quality as well as the ability to plug in an external mic via a 3.5mm input. Users will also have the ability to create 4K time-lapse movies as well as HDR video with dedicated settings and modes. Additionally, the body design has received an upgrade with improved ergonomics and durability, including dust and water resistance. Users will have access to many connectivity options as well, such as Wi-Fi, NFC, and Bluetooth, for connecting to a smart device, and built-in GPS for geotagging your photos.Included with the camera body is the versatile and high-performing EF 24-105mm f/4 IS II USM Lens. This setup provides a wide-angle to telephoto zoom range that will cover most standard subject matter with ease while also offering a constant f/4 maximum aperture for consistent performance. The lens also packs in both image stabilization and a fast, near-silent ring-type USM AF motor for fast, accurate focusing performance.","images":{"0":"28a6ab0565cca27d0dd257aa231f5212-0.jpg","1":"28a6ab0565cca27d0dd257aa231f5212-1.jpg","2":"28a6ab0565cca27d0dd257aa231f5212-2.jpg","3":"28a6ab0565cca27d0dd257aa231f5212-3.jpg","4":"28a6ab0565cca27d0dd257aa231f5212-4.jpg","5":"28a6ab0565cca27d0dd257aa231f5212-5.jpg","6":"28a6ab0565cca27d0dd257aa231f5212-6.jpg","7":"28a6ab0565cca27d0dd257aa231f5212-7.jpg","8":"28a6ab0565cca27d0dd257aa231f5212-8.jpg","9":"28a6ab0565cca27d0dd257aa231f5212-9.jpg","10":"28a6ab0565cca27d0dd257aa231f5212-10.jpg","11":"28a6ab0565cca27d0dd257aa231f5212-11.jpg","12":"28a6ab0565cca27d0dd257aa231f5212-12.jpg"}},"configuration":{},"availability":{"1346735":{"aditional_price":0,"availabile":324}}}
