{"viewData":{"url_key":"nikon_coolpix_w300_digital_camera","name":"Nikon COOLPIX W300 Digital Camera with Accessory Kit (Orange)","sku":"1347848","price":"386.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon COOLPIX W300 Digital Camera with Accessory Kit (Orange) featuring Memory Card, Camera Pouch. Review Nikon W300","long_description":"Characterized by its tough exterior, the orange Nikon COOLPIX W300 is a sleek point-and-shoot featuring a reinforced physical design, along with apt multimedia imaging capabilities. Designed for adventures, and even everyday mishaps, the camera is waterproof-rated for depths up to 100' as well as shockproof for falls from up to 7.9' high and freezeproof for temperatures down to 14°F. In regard to imaging, a high-resolution 16MP BSI CMOS sensor benefits both stills shooting as well as video recording, with the ability to shoot continuously up to 7 fps, record video at UHD 4K/30p, and produce low noise imagery with a sensitivity range of ISO 100-6400. A 5x optical zoom lens spans wide-angle to telephoto focal lengths, and Vibration Reduction helps to minimize the appearance of camera shake for sharper handheld imagery. Additionally, the W300 also incorporates SnapBridge wireless connectivity, which uses Bluetooth and Wi-Fi for seamlessly sharing imagery and remotely controlling the camera from a linked device. Built-in GPS is also available for geotagging your imagery in-camera.Record Full HD 1080p video with this Class 10 compliant 16GB Ultra UHS-I SDHC Memory Card from SanDisk. With enhanced data read speeds of up to 80 MB/s this Ultra SDHC memory card is designed to suit the needs of compact and mid-range point and shoot cameras. You can also save and store a variety of files such as music, movies, documents and more. The writable label found on the card allows you to write down what is saved to the card while the built-in write protect switch helps to prevent accidental data loss. This card, as with most SanDisk cards, comes shock, temperature, x-ray, magnet, and waterproof to take your files with you nearly anywhere you go.The HFV-250 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.","images":{"0":"e4d99741495750a2aec96e89bd6611ee-0.jpg","1":"e4d99741495750a2aec96e89bd6611ee-1.jpg","2":"e4d99741495750a2aec96e89bd6611ee-2.jpg","3":"e4d99741495750a2aec96e89bd6611ee-3.jpg"}},"configuration":{},"availability":{"1347848":{"aditional_price":0,"availabile":758}}}
