{"viewData":{"url_key":"nikon_d850_dslr_camera_body","name":"Nikon D850 DSLR Camera (Body Only)","sku":"1351688","price":"3,296.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Nikon D850 DSLR Camera (D850 Camera Body) features FX-Format Sensor, 8K Time-Lapse Video.","long_description":"Proving that speed and resolution can indeed coexist, the Nikon D850 is a multimedia DSLR that brings together robust stills capabilities along with apt movie and time-lapse recording. Revolving around a newly designed 45.7MP BSI CMOS sensor and proven EXPEED 5 image processor, the D850 is clearly distinguished by its high resolution for recording detailed imagery. The back-illuminated design of the sensor is able to acquire greater detail and clarity when working in low-light conditions, and the sensor also forgoes an optical low-pass filter for improved sharpness. Working in conjunction with the sensor is the EXPEED 5 image processor, which together afford a 7 fps continuous shooting rate for up to 51 consecutive frames, an expandable sensitivity range from ISO 32 to 102400, and 4K UHD video recording using either a DX crop or the entire area of the full-frame sensor. An 8K time-lapse recording mode is also available, as well as additional specialized recording modes for digitizing film negatives and for focus stacking applications. Benefitting the imaging capabilities is an advanced Multi-CAM 20K 153-point AF system, which debuted with the flagship D5 and offers 99 cross-type sensors for refined focusing accuracy in a variety of lighting conditions. Checking off a number of boxes for multimedia image-makers, the D850 positions itself as not only a high-resolution DSLR but also as a camera for speed, movies, and low-light shooting needs.Balancing the versatile imaging features, the D850 is also equally refined in its physical design. A large optical pentaprism offering a wide field of view and 0.75x magnification affords photographers a bright, clear, and realistic view for critical shooting needs. Conversely, a 3.2\" 2.36m-dot LCD touchscreen is also available for live view shooting, playback, and menu navigation, and features a tilting design to suit working from high and low angles. A weather-sealed design is also employed, to suit working in a variety of environmental conditions, and the optional MB-D18 grip can be added to boost overall shooting times and continuous shooting rates. Additionally, built-in SnapBridge allows for wireless sharing of low-resolution imagery and remote live view use on a linked mobile device, and an optional WT-7a Wireless Transmitter can also be used for faster wireless transferring of files.","images":{"0":"f91b5b6752a1df652675ade3f1973642-0.jpg","1":"f91b5b6752a1df652675ade3f1973642-1.jpg","2":"f91b5b6752a1df652675ade3f1973642-2.jpg","3":"f91b5b6752a1df652675ade3f1973642-3.jpg","4":"f91b5b6752a1df652675ade3f1973642-4.jpg","5":"f91b5b6752a1df652675ade3f1973642-5.jpg","6":"f91b5b6752a1df652675ade3f1973642-6.jpg","7":"f91b5b6752a1df652675ade3f1973642-7.jpg","8":"f91b5b6752a1df652675ade3f1973642-8.jpg","9":"f91b5b6752a1df652675ade3f1973642-9.jpg","10":"f91b5b6752a1df652675ade3f1973642-10.jpg","11":"f91b5b6752a1df652675ade3f1973642-11.jpg"}},"configuration":{},"availability":{"1351688":{"aditional_price":0,"availabile":628}}}
