{"viewData":{"url_key":"nikon_13533_d7200_dual_zoom_lens","name":"Nikon D7200 DSLR Camera with 18-55mm and 70-300mm Lenses Kit","sku":"1366792","price":"896.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D7200 DSLR Camera with 18-55mm and 70-300mm Lenses Kit featuring 24.2MP DX-Format CMOS Sensor, EXPEED 4 Image Processor No Optical Low-Pass Filter. Review Nikon D7200","long_description":"Poised to deliver in the most challenging of situations, Nikon's D7200 is a versatile DX-format DSLR that caters to both still photography and video users. Featuring a 24.2MP CMOS sensor which lacks an optical low-pass filter, and an EXPEED 4 image processor, the D7200 is able to record up to 6 fps at full-resolution, or 7 fps at a 1.3x crop, with a 100-frame buffer for extended high-speed shooting. This sensor and processor combination also avails a top native sensitivity of ISO 25600, which can further be expanded to black & white-dedicated ISO 51200 and ISO 102400 sensitivities. Full HD 1080p video recording is supported up to 60 fps, and in-camera time lapse shooting with automatic exposure smoothing is possible for up to 9,999 consecutive frames. In addition to the sheer imaging benefits, the D7200 also incorporates a large 3.2\" 1,229k-dot LCD monitor, dual SD card slots, and features built-in snapbridge Wi-Fi connectivity with NFC for simple linking of your mobile device. Capable of performing in both still and video realms, the D7200 is an all-around shooter that blends sophisticated imaging technologies with refined handling and design.Rounding out its feature-set, the D7200 is also characterized by an apt 51-point AF system, with 15 cross-type points, for quick and accurate focusing in a variety of conditions. The 3D Color Matrix Metering II system, which utilizes a 2,016-pixel RGB sensor, also benefits the focusing capabilities in addition to providing precise exposure metering capabilities. Further realizing a complete imaging solution, a series of Picture Control profiles can be applied to refine the color and tonal handling of imagery.Updating the staple DX-format standard zoom, the AF-P DX NIKKOR 18-55mm f/3.5-5.6G VR from Nikon offers a 27-82.5mm equivalent focal length range as well as an especially sleek form factor. Two aspherical elements are featured in the optical design, which help to control spherical aberrations and distortion in order to realize high sharpness and accurate rendering. A Super Integrated Coating is also used to minimize flare and ghosting for greater contrast and color accuracy. Suiting both photo and video applications, the AF-P designation indicates the use of a pulse stepping motor that offers notably quiet, fast, and precise autofocus performance. Additionally, Vibration Reduction image stabilization compensates for up to four stops of camera shake for sharper handheld shooting.An evolution of the tested DX telephoto zoom, the AF-P DX NIKKOR 70-300mm f/4.5-6.3G ED from Nikon is a 105-400mm-equivalent lens featuring an updated focusing mechanism along with a compact form factor. One extra-low dispersion element is used in the optical design to greatly reduce color fringing and chromatic aberrations throughout the zoom range in order to maintain image clarity. A Super Integrated Coating has also been applied to minimize reflections and flare for greater contrast. Suiting both photo and video applications, the AF-P designation indicates the use of a pulse stepping motor that offers notably quiet, fast, and precise autofocus performance.","images":{"0":"652a3e1ddce8fedf02108101081e589f-0.jpg","1":"652a3e1ddce8fedf02108101081e589f-1.jpg","2":"652a3e1ddce8fedf02108101081e589f-2.jpg","3":"652a3e1ddce8fedf02108101081e589f-3.jpg","4":"652a3e1ddce8fedf02108101081e589f-4.jpg","5":"652a3e1ddce8fedf02108101081e589f-5.jpg","6":"652a3e1ddce8fedf02108101081e589f-6.jpg","7":"652a3e1ddce8fedf02108101081e589f-7.jpg"}},"configuration":{},"availability":{"1366792":{"aditional_price":0,"availabile":876}}}
