{"viewData":{"url_key":"canon_eos_m100_mirrorless_digital","name":"Canon EOS M100 Mirrorless Digital Camera with 15-45mm Lens and Accessories Kit (Black)","sku":"1368608","price":"449.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS M100 Mirrorless Digital Camera with 15-45mm Lens and Accessories Kit (Black) featuring EF-M 15-45mm f/3.5-6.3 IS STM Lens, Memory Card Camera Pouch. Review Canon M100","long_description":"Compact and lightweight, the black Canon EOS M100 Mirrorless Digital Camera makes a suitable everyday companion for those who want both an easy-to-use and highly capable camera system. With built-in Wi-Fi, NFC, and Bluetooth, the 24.2MP APS-C camera makes it easy to share your snaps and videos almost immediately after you take them. For those looking to expand their photography skills this camera is a great stepping off point as it has a Creative Assist feature that can walk you through how certain settings affect your image. Or, if you simply want to capture your grand adventures with your friends, a Self Portrait mode is available for making use of the 180° tilt ability of the 3.0\" 1.04m-dot touchscreen LCD.  Photographers who desire a compact and powerful camera will appreciate the performance of the M100 as it boasts a 24.2MP APS-C CMOS sensor and the DIGIC 7 processor to produce sharp, rich imagery at sensitivities up to ISO 25600. Shooters will also benefit from the Dual Pixel CMOS AF system to provide fast, accurate focusing while shooting both stills and video. Speed is also a highlight with continuous shooting at up to 4 fps with AF or up to 6.1 fps with AF lock. Beyond stills, the M100 has the ability to record high-quality video at up to 60 fps.  Included with the camera body is the standard zoom EF-M 15-45mm f/3.5-6.3 IS STM lens, which provides a 24-72mm equivalent focal length range. The STM stepping motor delivers quick, quiet autofocus performance and the Optical Image Stabilizer compensates for 3.5 stops of camera shake for sharper handheld shooting. The lens' optical design also incorporates a trio of aspherical elements to control chromatic aberrations throughout the zoom range for sharper, clearer image quality.Store, transport and protect your digital mirrorless or bridge camera from moisture, dirt and dust with the black Lyra 60 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the top grab handle, handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Watson LP-E12 Lithium-Ion Battery Pack works with the same cameras as the Canon LP-E12. This replacement battery pack features a capacity of 800mAh and 7.4V of output power. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.","images":{"0":"13029dd55016ce3134ba09600e7be188-0.jpg","1":"13029dd55016ce3134ba09600e7be188-1.jpg","2":"13029dd55016ce3134ba09600e7be188-2.jpg","3":"13029dd55016ce3134ba09600e7be188-3.jpg","4":"13029dd55016ce3134ba09600e7be188-4.jpg"}},"configuration":{},"availability":{"1368608":{"aditional_price":0,"availabile":384}}}
