{"viewData":{"url_key":"sony_ilce7rm2_b_alpha_a7r_iii_mirrorless","name":"Sony Alpha a7R III Mirrorless Digital Camera (Body Only)","sku":"1369441","price":"2,798.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a7R III Mirrorless Digital Camera (A7R III Body ) features 42MP Full-Frame Exmor R BSI CMOS Sensor, BIONZ X Image Processor & Front-End LSI. ","long_description":"Proving that speed, resolution, and video capabilities can all coexist, the Alpha a7R III Mirrorless Digital Camera from Sony is a versatile, high-performance camera characterized by not only its resolution, but by its multimedia versatility. Revolving around a full-frame 42.4MP Exmor R BSI CMOS sensor and updated BIONZ X image processor, the a7R III affords an impressive 10 fps continuous shooting rate along with improved autofocus performance for faster, more reliable subject tracking along with wide frame coverage. This updated Fast Hybrid AF System employs a combination of 399 phase-detection points and 425 contrast-detection areas for quicker acquirement of focus in a variety of lighting conditions, and also maintains focus on subjects more effectively. In addition to speed and AF, the processing improvements also help to realize greater image clarity throughout the sensitivity range from ISO 100-32000, which can further be expanded to ISO 50-102400. Video recording capabilities have also been extended for enhanced quality when recording UHD 4K video with the full width of the full-frame sensor, or when using a Super35 area and 5K oversampling to minimize moiré and aliasing. Additionally, benefitting both stills and video operation, the a7R III retains the 5-axis SteadyShot INSIDE sensor-shift image stabilization, which is now effective to minimize the appearance of camera shake by up to 5.5 stops.In addition to imaging updates, the a7R III also sports a revised body design, which includes a 3.69m-dot Tru-Finder OLED electronic viewfinder for bright, clear, and realistic eye-level monitoring. A rear 3.0\" 1.44m-dot tilting touchscreen LCD is also available for intuitive settings control and to better support working from high and low angles. For greater shooting flexibility, dual SD memory card slots are now featured, and a larger NP-FZ100 battery is also employed to achieve up to approximately 530 shots per charge when using the viewfinder. Suiting the camera's use in trying conditions, the magnesium alloy chassis and extensive weather-sealing also render the a7R III dust- and moisture-resistance","images":{"0":"67cac755ec833667927a3ecd9c17b3cb-0.jpg","1":"67cac755ec833667927a3ecd9c17b3cb-1.jpg","2":"67cac755ec833667927a3ecd9c17b3cb-2.jpg","3":"67cac755ec833667927a3ecd9c17b3cb-3.jpg","4":"67cac755ec833667927a3ecd9c17b3cb-4.jpg","5":"67cac755ec833667927a3ecd9c17b3cb-5.jpg","6":"67cac755ec833667927a3ecd9c17b3cb-6.jpg","7":"67cac755ec833667927a3ecd9c17b3cb-7.jpg","8":"67cac755ec833667927a3ecd9c17b3cb-8.jpg","9":"67cac755ec833667927a3ecd9c17b3cb-9.jpg","10":"67cac755ec833667927a3ecd9c17b3cb-10.jpg","11":"67cac755ec833667927a3ecd9c17b3cb-11.jpg","12":"67cac755ec833667927a3ecd9c17b3cb-12.jpg","13":"67cac755ec833667927a3ecd9c17b3cb-13.jpg","14":"67cac755ec833667927a3ecd9c17b3cb-14.jpg","15":"67cac755ec833667927a3ecd9c17b3cb-15.jpg","16":"67cac755ec833667927a3ecd9c17b3cb-16.jpg","17":"67cac755ec833667927a3ecd9c17b3cb-17.jpg","18":"67cac755ec833667927a3ecd9c17b3cb-18.jpg","19":"67cac755ec833667927a3ecd9c17b3cb-19.jpg","20":"67cac755ec833667927a3ecd9c17b3cb-20.jpg","21":"67cac755ec833667927a3ecd9c17b3cb-21.jpg","22":"67cac755ec833667927a3ecd9c17b3cb-22.jpg","23":"67cac755ec833667927a3ecd9c17b3cb-23.jpg","24":"67cac755ec833667927a3ecd9c17b3cb-24.jpg","25":"67cac755ec833667927a3ecd9c17b3cb-25.jpg","26":"67cac755ec833667927a3ecd9c17b3cb-26.jpg"}},"configuration":{},"availability":{"1369441":{"aditional_price":0,"availabile":778}}}
