{"viewData":{"url_key":"fujifilm_x100f_digital_cameras_with","name":"FUJIFILM X100F Digital Cameras with Free Accessory Kit (Black)","sku":"1377578","price":"1,299.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM X100F Digital Cameras with Free Accessory Kit (Black) featuring Memory Card, Camera Pouch. Review FUJIFILM X100F","long_description":"Featuring an evolution in its core feature-set, the black X100F Digital Camera from FUJIFILM incorporates a series of advanced imaging capabilities while still retaining its trademark design and intuitive handling assets. Most notably, the X100F features a 24.3MP APS-C X-Trans CMOS III sensor and X-Processor Pro image processor to realize rich, high-resolution stills and fluent performance with expandable sensitivity to ISO 51200. A built-in Fujinon 23mm f/2 lens provides a general wide-angle 35mm equivalent focal length, and its optical design utilizes aspherical glass to produce sharp imagery while a Super EBC coating resists flare and ghosting. Benefitting working in a variety of shooting situations, a heightened hybrid autofocus system now utilizes 91 total points, including 49 phase-detection points, for quick, accurate focusing. Complementing the imaging specs is a range of physical attributes that are the hallmark of the X100-series. The Advanced Hybrid Viewfinder, which meshes both optical and electronic viewing means in a switchable manner, has been updated with adjustable magnification for the electronic rangefinder function for more precise manual focus control. Additionally, the body also sports a physical ISO dial, which is incorporated within the shutter speed dial, and the exposure compensation dial can now be set to a C position for an increased +/- 5 stop range of adjustment. Additionally, the rear of the camera sees the inclusion of a focus lever for faster focus point selection, and the majority of the physical controls, buttons, and dials have been moved to the right-hand side for easier one-handed use.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.Store, transport and protect your digital mirrorless or bridge camera from moisture, dirt and dust with the black Lyra 60 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the top grab handle, handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"2c93d9de996bb4574c06458985c52155-0.jpg","1":"2c93d9de996bb4574c06458985c52155-1.jpg","2":"2c93d9de996bb4574c06458985c52155-2.jpg","3":"2c93d9de996bb4574c06458985c52155-3.jpg"}},"configuration":{},"availability":{"1377578":{"aditional_price":0,"availabile":651}}}
