{"viewData":{"url_key":"fujifilm_x_t2_mirrorless_digital_camera","name":"FUJIFILM X-T2 Mirrorless Digital Camera Body with Free Accessory Kit (Black)","sku":"1378583","price":"899.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM X-T2 Mirrorless Digital Camera Body with Free Accessory Kit (Black) featuring Memory Card, External Battery Charger Camera Bag. Review FUJIFILM X-T2","long_description":"Offering a more conventional form factor and packing in UHD 4K video recording, FUJIFILM's X-T2 Mirrorless Digital Camera certainly aims to fill the needs of many working professionals. Equipped with a 24.3MP APS-C X-Trans CMOS III image sensor and the X-Processor Pro Engine, users will be able to capture finely detailed imagery quickly and with low noise at sensitivities up to ISO 51200. The powerful combination permits rapid image capture at up to 8 fps with full AF tracking or at up to 14 fps using the silent electronic shutter. In terms of AF, the X-T2 uses an Intelligent Hybrid system with 325 points that ensure accurate, fast tracking of subjects in all modes. For video, the X-T2 offers internal UHD 4K video as well as an 8-bit 4:2:2 HDMI output. The internal recording offers 100 Mbps bitrate for capturing fine details with ease. Along with this an F-Log Gamma setting will be available for capturing a flat picture best used in serious grading applications. Fuji's array of Film Simulations and Grain Effects can also be used here, for both photo and video shoots.Improved handling is a key upgrade in the X-T2, incorporating a larger grip, locking dials, raised buttons, and more to make operation smoother. The weather-sealed body also sports a 0.5\" 0.77x 2.36m-dot OLED EVF with a larger eyecup for comfortable composition and a base refresh rate of 60 fps, which can be boosted to 100 fps. There is also a 3.0\" 1.04m-dot three-way tilting LCD screen for alternative viewing options. This screen has a unique tilt that permits shooting at odd angles, including in the portrait orientation. Additionally, it has a focus lever joystick that allows for rapidly adjusting and changing the selected AF point or area.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The black Outrigger 45 Backpack from Ruggard holds a standard DSLR system and an iPad. The front pocket measures 8.0 x 7.25\" and contains five small, pen-sized slip-in slots as well as a mesh stash pocket. The second compartment is dedicated for your iPad. The third compartment measures 14.5 x 8.5\" and contains three memory card pockets, two slash stretch pockets and a key ring. The spacious main compartment for your camera gear includes seven removable dividers that can be configured to accommodate whatever gear you carry. For carrying comfort, the back of the backpack is made from a breathable, small-mesh, padded material and features a padded shoulder harness. You can also carry the backpack using the nylon grip handle at the top. The backpack has a sternum strap and a hideaway waist strap. An attached rain cover for inclement weather can be hidden away at the base of the backpack.Charge any Fujifilm NP-W126 or NP-W126S type lithium-ion battery with this dedicated Compact AC/DC Charger from Pawa. It runs on 100-240 VAC power, allowing for worldwide use, and features a folding, 2-prong North American plug. Additionally, the charger includes a European plug adapter and a 12 VDC vehicle adapter that plugs into a cigarette lighter port--making it ideal for use both at home and on the road.","images":{"0":"b60b0234d64ede5507b5fb876663cd0e-0.jpg","1":"b60b0234d64ede5507b5fb876663cd0e-1.jpg","2":"b60b0234d64ede5507b5fb876663cd0e-2.jpg","3":"b60b0234d64ede5507b5fb876663cd0e-3.jpg","4":"b60b0234d64ede5507b5fb876663cd0e-4.jpg"}},"configuration":{},"availability":{"1378583":{"aditional_price":0,"availabile":498}}}
