{"viewData":{"url_key":"canon_eos_rebel_t6_dslr","name":"Canon EOS Rebel T6 DSLR Camera with 18-55mm and 75-300mm Lenses Basic Kit","sku":"1380804","price":"484.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS Rebel T6 DSLR Camera with 18-55mm and 75-300mm Lenses Basic Kit featuring EF-S 18-55mm f/3.5-5.6 IS II Lens, EF 75-300mm f/4-5.6 III Lens EOS Shoulder Bag 100ES. Review Canon Rebel T6","long_description":"Comprising a versatile set of imaging capabilities along with support for a connected workflow, the EOS Rebel T6 from Canon is a compact, sleek DSLR featuring an 18MP APS-C CMOS sensor and a DIGIC 4+ image processor. Combined, these two technologies avail rich image quality with reduced noise, along with a native sensitivity range of ISO 100-6400 that can be further expanded to ISO 12800 to suit working in low and difficult lighting conditions. The sensor and processor also enable the ability to shoot continuously at 3 fps for photographing moving subjects, as well as recording Full HD 1080p/30 video. Benefitting shooting with the optical viewfinder, a 9-point AF system incorporates a single center cross-type AF point for increased accuracy and focusing speed, and a contrast-detection focusing system offers refined autofocus precision for shooting movies or working in live view. The rear 3.0\" 920k-dot LCD offers a bright, clear image for playback and review, and built-in Wi-Fi with NFC also offers the ability to wirelessly share imagery from your camera to a linked mobile device for instant online sharing.Included with the camera body is the EF-S 18-55mm f/3.5-5.6 IS II lens, which provides a 28.8-88mm equivalent focal length range that covers wide-angle to short telephoto perspectives. One aspherical element is featured in the optical design, to control spherical aberrations and contribute to higher clarity, and an Optical Image Stabilizer minimizes the appearance of camera shake for sharper handheld shooting. Extending the combined zoom range even further, the EF 75-300 f/4-5.6 III lens is also included, which offers an equivalent focal length range of 120-480mm. Well-suited to use with distant subjects, this lens utilizes a DC autofocus motor to acquire precise focus while the telephoto perspective is especially useful for visually compressing the space between subjects and producing a shallow depth of field. Additionally, an EOS Shoulder Bag 100ES is also featured in this kit, and serves as a convenient means to protect and carry the entire DSLR and two lens kit.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 16GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 16GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the U3 speed class, which guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 16GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Watson LP-E10 Lithium-Ion Battery Pack works with the same cameras as the Canon LP-E10. This replacement battery pack features a capacity of 1000mAh and 7.4V of output power. Small and lightweight, Lithium-Ion batteries can be charged or discharged at any time without developing memory effects.Don't lose any more lens caps--the Sensei Cap Keeper Lens Cap Holder keeps your lens cap close at hand. One end of the holder has an elastic band which attaches securely around the lens barrel, and the other end fastens to the lens cap via the adhesive-backed disc. The cap remains tethered while shooting and is easily retrieved when finished.The 58mm 95-UVAT UV Filter is one of Chiaro’s highly-rated protective UV filters with 95% light transmission. It’s useful for photographers of all levels who demand high-quality glass and other essential features for great image fidelity and construction.Whether you are shooting in the studio or outdoors, the Vello RS-C1II Wired Remote Switch provides photographers using select cameras featuring a 2.5mm connection with a simple way to control exposures and an easy-to-use tool to create more \"keepers\". The device is larger and more comfortable to use than many other remote devices, with a thick, sturdy cord.  The RS-C1II is compatible with autofocusing, continuous shooting or single image capture, and long exposures. It will autofocus on a half press of the button and trigger the shutter with a full press. Also, users can press the button and slide it forward to lock it for long exposures. Since you can trigger exposures without touching the camera, you will capture sharp, blur-free images. Additionally, the unit does not require batteries as it draws its power from the camera, making it an extremely useful tool to keep in your studio or gear bag.This is a 2 oz Solution Spray Bottle from Field Optics Research. It contains a specially designed cleaning formula that is particularly effective on high-end optics with anti-reflective coatings. The non-alcohol based formula can be used on all lenses to help keep them free from fingerprints, dust, dirt and smudges. The bottle produces a fine mist that is easy to remove.","images":{"0":"dae2f5efc973023b4bc7b965a1c8086c-0.jpg","1":"dae2f5efc973023b4bc7b965a1c8086c-1.jpg","2":"dae2f5efc973023b4bc7b965a1c8086c-2.jpg","3":"dae2f5efc973023b4bc7b965a1c8086c-3.jpg","4":"dae2f5efc973023b4bc7b965a1c8086c-4.jpg","5":"dae2f5efc973023b4bc7b965a1c8086c-5.jpg","6":"dae2f5efc973023b4bc7b965a1c8086c-6.jpg","7":"dae2f5efc973023b4bc7b965a1c8086c-7.jpg"}},"configuration":{},"availability":{"1380804":{"aditional_price":0,"availabile":329}}}
