{"viewData":{"url_key":"sony_alpha_a6000_mirrorless_digital","name":"Sony Alpha a6000 Mirrorless Digital Camera with 16-50mm and 55-210mm Lenses with Free Accessories Kit (Black)","sku":"1381662","price":"648.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a6000 Mirrorless Digital Camera with 16-50mm and 55-210mm Lenses with Free Accessories Kit (Black) featuring E PZ 16-50mm f/3.5-5.6 OSS Lens, E 55-210mm f/4.5-6.3 OSS Lens Memory Card. Review Sony A6000","long_description":"The black Sony Alpha a6000 Mirrorless Digital Camera is a versatile and advanced mirrorless camera featuring a 24.3MP APS-C-sized Exmor APS HD CMOS sensor and BIONZ X image processor to produce high-resolution still images and Full HD movies with marked low-light quality and sensitivity to ISO 25600. Beyond notable imaging traits, the image processor also lends itself to continuous shooting up to 11 fps and an intelligent Fast Hybrid AF system that uses both phase- and contrast-detection methods to quickly and accurately acquire focus.  For live view monitoring, image playback, and menu navigation, both a large rear monitor and detailed electronic viewfinder are available. The 3.0\" 921k-dot Xtra Fine LCD screen features a tilting design to facilitate easier use from both high and low angles and also incorporates WhiteMagic technology for easier viewing in bright conditions. The 0.39\" 1,440k-dot Tru-Finder OLED EVF offers 100% frame coverage and a refined optical design to provide a natural viewing perspective and magnification. The body design of the a6000 also houses a configurable user interface, built around several customizable buttons and two control dials, for efficient and intuitive access to frequently used camera settings. Additionally, a Multi Interface shoe is available for attaching external flashes, continuous lights, or microphones.  Built-in Wi-Fi connectivity, with support for NFC-enabled devices, is also integrated into the a6000 to support remote camera control and image sharing to linked mobile devices. In addition to these base features, with firmware version 2.0 users will have access to the XAVC S format for Full HD 1080p video at 24, 30, and 60 fps. This format will dramatically improve video quality by allowing the camera to capture images at a high bit rate of 50 Mbps, which holds more information than AVCHD for fewer artifacts. Along with this, users will be required to use Class 10 or faster SDXC memory cards with a capacity of 64GB or greater.  Included with the camera body is a retractable E PZ 16-50mm f/3.5-5.6 OSS Lens, which provides a 35mm-equivalent focal length range of 24-75mm. This range of perspectives is well-suited to everyday shooting and is further enhanced through the inclusion of Optical SteadyShot image stabilization for minimizing the appearance of camera shake. Power Zoom technology allows for electronic control over the zoom position and the inclusion of one extra-low dispersion element and four aspherical elements helps to reduce chromatic aberrations throughout the zoom range as well as contribute to high overall sharpness. Also, this kit includes the E 55-210mm f/4.5-6.3 OSS Lens, which covers an 82.5-315mm equivalent focal length range. This lens, too, offers Optical SteadyShot image stabilization and features two extra-low dispersion elements and one aspherical element in its design to control aberrations and distortions.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.Designed for the photographer and videographer alike, the black with yellow trim Onyx 25 Camera/Camcorder Shoulder Bag from Ruggard is designed to hold a compact camcorder with an attached battery or a mirrorless camera up to 6.75\" in length. A durable, weather-resistant nylon shell protects your gear from unwanted elements while high-density foam padding helps prevent damage from accidental impact. For added protection and organization, an included touch-connect divider securely holds your camera in place.  Small accessories like a spare battery or cleaning cloth can be slipped into either of the two zippered side pockets or the front slip pocket. In addition, three memory card pockets and an another slip pocket are conveniently located under the opening flap of the bag. Carry your gear by way of the top padded grab handle with an integrated mesh underside for added comfort when carrying by hand. Alternatively, a double-touch built-in loop securely wraps around your belt for hands-free carrying. Or, take advantage of the removable 1\" wide shoulder strap that can be adjusted from 28\" at its shortest length to 53\" at its longest length to accommodate a variety of heights and carrying preferences.The Pawa NP-FW50 Lithium-Ion Battery Pack works with the same cameras as the Sony NP-FW50. This rechargeable replacement pack features 7.4V of output power, a capacity of 1030mAh, and a rating of 7.7Wh. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effects.This versatile Compact AC/DC Charger from Watson charges any NP-FW50 lithium-ion battery via the included, dedicated battery plate. The charger runs on 100-240 VAC power, allowing for worldwide use. It features a fold-out, 2-prong US plug and is supplied with a European plug adapter, as well as a 12 VDC car charger that plugs into a cigarette lighter. This makes it ideal for use both at home and on the road. ","images":{"0":"4f205fc26bbeb8581ec27b9fb21fef43-0.jpg","1":"4f205fc26bbeb8581ec27b9fb21fef43-1.jpg","2":"4f205fc26bbeb8581ec27b9fb21fef43-2.jpg","3":"4f205fc26bbeb8581ec27b9fb21fef43-3.jpg","4":"4f205fc26bbeb8581ec27b9fb21fef43-4.jpg","5":"4f205fc26bbeb8581ec27b9fb21fef43-5.jpg"}},"configuration":{},"availability":{"1381662":{"aditional_price":0,"availabile":457}}}
