{"viewData":{"url_key":"panasonic_lumix_dc_gh5s_mirrorless_micro","name":"Panasonic Lumix DC-GH5S Mirrorless Micro Four Thirds Digital Camera","sku":"1382031","price":"2,197.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic GH5S Lumix Mirrorless Micro Four Thirds DC-GH5S Digital Camera featuring 10.28MP Multi Aspect Ratio MOS Sensor, DCI 4K60p and Full HD 1080/240p Video.","long_description":"Proving that they can push the GH-series even farther into the video realm, the Panasonic Lumix DC-GH5S is a mirrorless Micro Four Thirds camera optimized for movie recording and low-light performance. Revolving around a 10.28MP Digital Live MOS sensor, DCI and UHD 4K video recording is possible at up to 60p and the large individual pixel size also affords impressive low-light performance to an extended ISO 204800, along with Dual Native ISO technology at ISO 400 and ISO 2500. Coupled with an updated Venus Engine, the sensor and processor combination also enables faster readout speeds along with 1.3x less rolling shutter distortion compared to previous GH-series cameras. Internal DCI 4K30p recording is available with 4:2:2 10-bit sampling and a full-size HDMI A connector can be used to simultaneously output to an optional external monitor or recorder. The sensor's extended sensitivity range has also been used to promote working with V-Log L and Hybrid Log Gamma HDR modes for effectively increasing your dynamic range and affording more flexibility when color grading during post-production.Beyond its video prowess, the GH5S is no slouch when it comes to stills shooting, either. The sensor and Venus Engine combination enable recording 14-bit raw files with a top continuous shooting rate of 12 fps with single-shot AF, or up to 8 fps with continuous autofocus. Borrowing from the video side, 4K PHOTO modes are also available for shooting 8MP stills at up to 60 fps. Benefitting stills, the Depth-From-Defocus AF system works quickly and accurately using 225 dedicated AF areas, and is sensitive to -5 EV luminance for working in extreme low-light conditions.Beyond imaging specs, the GH5S retains its professional build quality the GH-series is known for. The magnesium alloy body is fully weather-sealed for working in inclement conditions, and physical controls have been enhanced for easier tactile control. A large 3.68m-dot OLED electronic viewfinder is featured, for high-resolution eye-level monitoring, as well as a rear 3.2\" 1.62m-dot LCD touchscreen with free-angle movement to suit working from high and low angles. Dual UHS-II SD memory card slots are available for flexible file recording and built-in Wi-Fi with NFC and Bluetooth wireless connectivity enable seamless image sharing and remote camera control from a mobile device.","images":{"0":"f319b1c72d6d01578d4cc46cebdcadbf-0.jpg","1":"f319b1c72d6d01578d4cc46cebdcadbf-1.jpg","2":"f319b1c72d6d01578d4cc46cebdcadbf-2.jpg","3":"f319b1c72d6d01578d4cc46cebdcadbf-3.jpg","4":"f319b1c72d6d01578d4cc46cebdcadbf-4.jpg","5":"f319b1c72d6d01578d4cc46cebdcadbf-5.jpg","6":"f319b1c72d6d01578d4cc46cebdcadbf-6.jpg","7":"f319b1c72d6d01578d4cc46cebdcadbf-7.jpg","8":"f319b1c72d6d01578d4cc46cebdcadbf-8.jpg","9":"f319b1c72d6d01578d4cc46cebdcadbf-9.jpg","10":"f319b1c72d6d01578d4cc46cebdcadbf-10.jpg","11":"f319b1c72d6d01578d4cc46cebdcadbf-11.jpg","12":"f319b1c72d6d01578d4cc46cebdcadbf-12.jpg","13":"f319b1c72d6d01578d4cc46cebdcadbf-13.jpg","14":"f319b1c72d6d01578d4cc46cebdcadbf-14.jpg","15":"f319b1c72d6d01578d4cc46cebdcadbf-15.jpg","16":"f319b1c72d6d01578d4cc46cebdcadbf-16.jpg","17":"f319b1c72d6d01578d4cc46cebdcadbf-17.jpg","18":"f319b1c72d6d01578d4cc46cebdcadbf-18.jpg","19":"f319b1c72d6d01578d4cc46cebdcadbf-19.jpg","20":"f319b1c72d6d01578d4cc46cebdcadbf-20.jpg","21":"f319b1c72d6d01578d4cc46cebdcadbf-21.jpg"}},"configuration":{},"availability":{"1382031":{"aditional_price":0,"availabile":486}}}
