{"viewData":{"url_key":"fujifilm_600019828_finepix_xp130_digital_camera","name":"FUJIFILM FinePix XP130 Digital Camera (Yellow)","sku":"1386436","price":"153.43","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM FinePix XP130 Digital Camera (Yellow) featuring 16.4MP BSI CMOS Sensor, Fujinon 5x Optical Zoom Lens 28-140mm (35mm Equivalent). Review FUJIFILM XP130","long_description":"Distinguished by its durability, the yellow FUJIFILM FinePix XP130 is a rugged compact camera featuring a well-connected interface and versatile imaging capabilities. Revolving around a 16.4MP CMOS sensor, this camera can record high-resolution stills at up to 10 fps and Full HD 1080p video, and the sensor's back-illuminated design maintains smooth, low noise image quality when working in difficult lighting conditions. Complementing the imaging assets is a Fujinon 5x optical zoom lens that covers a 28-140mm equivalent focal length range for working in a variety of scenarios, and optical image stabilization Minimizes the appearance of camera shake for sharper handheld shooting. As a waterproof, shockproof, freeze-proof, and dust-sealed camera, it is well-suited for nearly any adventure, ranging from snorkeling trips to mountain ascensions, or even just for day-trips to the pool. Complementing the imaging attributes, the XP130 is also a well-connected camera with the addition of Bluetooth LE for fast and automatic wireless image transferring between the camera a mobile device. This connectivity, along with Wi-Fi, too, also permits geotagging imagery and syncing time and date using information from your connected smartphone or tablet. Rounding out the XP130's feature-set is an intuitive physical design that incorporates a 3.0\" 920k-dot LCD monitor for clear viewing and image review, and all of the essential camera controls have been placed on the right side of the camera body for intuitive one-handed control.","images":{"0":"03c7671a7c8a122971b07c887d2e0646-0.jpg","1":"03c7671a7c8a122971b07c887d2e0646-1.jpg","2":"03c7671a7c8a122971b07c887d2e0646-2.jpg","3":"03c7671a7c8a122971b07c887d2e0646-3.jpg","4":"03c7671a7c8a122971b07c887d2e0646-4.jpg"}},"configuration":{},"availability":{"1386436":{"aditional_price":0,"availabile":548}}}
