{"viewData":{"url_key":"fujifilm_16568755_x_h1_mirrorless_digital_camera","name":"FUJIFILM X-H1 Mirrorless Digital Camera Body with Battery Grip Kit","sku":"1388298","price":"1,299.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM X-H1 Mirrorless Digital Camera Body with Battery Grip Kit featuring X-H1 Mirrorless Camera, Body Only, VPB-XH1 Vertical Power Booster Grip Two additional NP-W126S Batteries. Review FUJIFILM X-H1","long_description":"Offering plenty of features inside a durable magnesium-alloy housing, the X-H1 Mirrorless Digital Camera from FUJIFILM aims to position itself as a leading option for professional video and photo work. Equipped with a 24.3MP APS-C X-Trans CMOS III image sensor and the X-Processor Pro Engine, this camera allows you to capture high quality imagery quickly and with low noise at sensitivities up to ISO 51200. A major implementation is an in-body 5-axis image stabilization system, a first for X-Series cameras, which can compensate for up to 5.5 stops of shutter speed to create sharp imaging even when little light is available.For using the maximum power of your mirrorless camera, the FUJIFILM NP-W126S Li-Ion Battery Pack has been designed to better manage heat and ensure lightning fast camera performance. This battery is also compatible with older cameras that use the NP-W126 battery pack, but users will not see any performance advantages in those bodies.Bring out the full potential of your X-H1 mirrorless camera with the VPB-XH1 Vertical Power Booster Grip from FUJIFILM. Capable of holding up to two batteries in addition to the one already in the camera, this grip increases the maximum number of shots in normal mode to approximately 900 stills. Its boost mode is its main feature, allowing it to use both batteries simultaneously to improve the speed of burst shots while reducing shutter time lag and blackout period. Additionally, the VPB-XH1 increases the maximum period for movie shooting to about 30 minutes in 4K, making it an essential accessory for videographers.","images":{"0":"98029aa6872801b5c1b4264bea750932-0.jpg","1":"98029aa6872801b5c1b4264bea750932-1.jpg","2":"98029aa6872801b5c1b4264bea750932-2.jpg","3":"98029aa6872801b5c1b4264bea750932-3.jpg","4":"98029aa6872801b5c1b4264bea750932-4.jpg","5":"98029aa6872801b5c1b4264bea750932-5.jpg","6":"98029aa6872801b5c1b4264bea750932-6.jpg","7":"98029aa6872801b5c1b4264bea750932-7.jpg","8":"98029aa6872801b5c1b4264bea750932-8.jpg","9":"98029aa6872801b5c1b4264bea750932-9.jpg","10":"98029aa6872801b5c1b4264bea750932-10.jpg","11":"98029aa6872801b5c1b4264bea750932-11.jpg"}},"configuration":{},"availability":{"1388298":{"aditional_price":0,"availabile":649}}}
