{"viewData":{"url_key":"panasonic_lumix_dc_gh5_mirrorless_micro","name":"Panasonic Lumix DC-GH5 Mirrorless Micro Four Thirds Digital Camera with Microphone Kit","sku":"1388847","price":"1,497.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-GH5 Mirrorless Micro Four Thirds Digital Camera with Microphone Kit featuring External Microphone. Review Panasonic DMC-GH5","long_description":"Upgraded, redesigned, and filled with features, the Lumix DC-GH5 Mirrorless Micro Four Thirds Digital Camera from Panasonic provides an outstanding imaging platform for shooters who demand some of the best video and still photography quality they can get in a single compact camera. At the heart of the camera is a 20.3MP Digital Live MOS sensor and a newly developed Venus Engine processor, which both offer dramatically improved processing times over its predecessor. This enables the ability to record 4K video at up to 60 fps, 10-bit 4:2:2 internal recording with select settings, Full HD video at up to 180 fps, 12 fps continuous shooting, and sensitivities up to ISO 25600. Also, the camera features built-in 5-axis sensor stabilization, which can work with certain lenses to activate Dual I.S. 2 for highly effective shake correction that can compensate for up to 5 stops of shutter speed. Other improvements include a speedier and more accurate Advanced DFD autofocus system that can lock on in just 0.05 seconds, as well as 6K PHOTO at 30 fps and 4K PHOTO at up to 60 fps.Along with all these internal improvements, the body received some significant upgrades as well. For viewing and composing images both the 0.76x OLED viewfinder and 3.2\" free-angle touchscreen received resolution bumps to 3.68m dots and 1.62 m dots, respectively. This will make shooting more comfortable and more accurate. The magnesium alloy body is now freezeproof to 14°F in addition to splash and dustproof. For fast image transfer and saving, there are now two UHS-II SD card slots. Additionally, for a completely wireless setup it offers both Wi-Fi and Bluetooth for advanced functionality when paired with a mobile app.The VideoMic with Rycote Lyre Suspension System from Rode is a shotgun microphone that can easily be mounted on a DSLR camera. It features a Rycote suspension system that attaches to the camera's shoe. The VideoMic is lightweight, and when mounted on a camera it does not appear in the frame. The VideoMic can also mount to Rode's boompoles for elevated audio capture. Its supercardioid polar pattern attenuates sounds from the sides. The result is a signal that sounds closer to the camera, even when shooting in noisy environments or at moderate distances.The included Rycote Lyre is a non-elasticated suspension structure composed of a hard-wearing thermoplastic. It is more effective at acoustically decoupling microphones from unwanted vibrations, handling and cable-borne noise than elasticated suspensions. The lyre remains effective at a wide range of temperatures and is virtually indestructible. It will never wear out, sag, snap or require any rethreading to maintain its effectiveness.An attached, coiled cable terminates to a 1/8\" (3.5mm) mini output connection. The VideoMic features a condenser element that utilizes a standard 9V battery (sold separately). The microphone will run for approximately 100 hours on a single battery.","images":{"0":"15148cfa8104d88569f4e85dd310b23f-0.jpg","1":"15148cfa8104d88569f4e85dd310b23f-1.jpg","2":"15148cfa8104d88569f4e85dd310b23f-2.jpg"}},"configuration":{},"availability":{"1388847":{"aditional_price":0,"availabile":429}}}
