{"viewData":{"url_key":"canon_powershot_g7_x_mark","name":"Canon PowerShot G7 X Mark II Digital Camera Video Creator Kit with Free Accessories","sku":"1391498","price":"699.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot G7 X Mark II Digital Camera Video Creator Kit with Free Accessories featuring Manfrotto PIXI Mini Tabletop Tripod, 2x Rechargeable Lithium-Ion Batteries 2 x Memory Cards. Review Canon G7X Mark II","long_description":"Configured for the aspiring filmmaker, the PowerShot G7 X Mark II Digital Camera Video Creator Kit from Canon bundles the advanced point-and-shoot camera with a Manfrotto PIXI Mini tabletop tripod for stabilizing your shots, a spare NB-13L lithium-ion battery pack for extended recording times, and a 32GB SDHC memory card for saving your footage.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.Store, transport and protect your digital point & shoot camera from moisture, dirt and dust with the black Lyra 50 Camera Pouch from Ruggard. The pouch features an easy access, zippered, clamshell opening, and an interior SD memory card pocket. Soft, padded, interior nylon helps protect your camera from impact, scratches and abrasion. This protection is complemented by a weather-resistant nylon exterior. Carry the pouch with the handy belt loop with touch-fasten tabs, or with the removable shoulder strap. The bright yellow interior makes it easier to locate stored items in low light.","images":{"0":"989d3e6086f9f4e68499144c0cdc3543-0.jpg","1":"989d3e6086f9f4e68499144c0cdc3543-1.jpg","2":"989d3e6086f9f4e68499144c0cdc3543-2.jpg","3":"989d3e6086f9f4e68499144c0cdc3543-3.jpg"}},"configuration":{},"availability":{"1391498":{"aditional_price":0,"availabile":434}}}
