{"viewData":{"url_key":"fujifilm_x_t20_mirrorless_digital_camera","name":"FUJIFILM X-T20 Mirrorless Digital Camera with 16-50mm Lens and Free Accessories Kit (Silver)","sku":"1391890","price":"699.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM X-T20 Mirrorless Digital Camera with 16-50mm Lens and Free Accessories Kit (Silver) featuring XC 16-50mm f/3.5-5.6 OIS II Lens, Holster-Style Camera Bag Memory Card. Review FUJIFILM X-T20","long_description":"Blending a familiar form factor with a heightened feature-set, the silver X-T20 from FUJIFILM is a sleek mirrorless camera designed for multimedia shooters. Utilizing a 24.3MP APS-C X-Trans CMOS III sensor and X-Processor Pro image processor, high-resolution stills can be recorded with notable sharpness and clarity due to the sensor's organic layout and omission of an optical low-pass filter. The sensor and processor combination also avails an extended sensitivity range to ISO 51200, a 14 fps continuous shooting rate when working with the electronic shutter, and the ability to record UHD 4K or Full HD 1080p video. When working with moving subjects, continuous autofocus performance has been optimized for improved moving subject tracking and overall accuracy, and Advanced SR Auto mode can also be used for fully automated shooting with intelligent scene recognition. Additionally, the retro-inspired camera body design incorporates a tilting 3.0\" 1.04m-dot touchscreen LCD as well as a 2.36m-dot electronic viewfinder, and physical dials are available for quickly and intuitively adjusting exposure and shooting settings. Included with the X-T20 is the Fujinon XC 16-50mm f/3.5-5.6 OIS II lens, which covers wide-angle to portrait-length perspectives with its 24-76mm equivalent focal length range. Three aspherical elements and one extra-low dispersion element reduce aberrations and distortions throughout the zoom range and an optical image stabilization system compensates for up to 3.5 stops of camera shake to produce sharper, clearer imagery in low-light conditions.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.","images":{"0":"5d1e798e724bee162765a5f2f9e34db4-0.jpg","1":"5d1e798e724bee162765a5f2f9e34db4-1.jpg","2":"5d1e798e724bee162765a5f2f9e34db4-2.jpg","3":"5d1e798e724bee162765a5f2f9e34db4-3.jpg"}},"configuration":{},"availability":{"1391890":{"aditional_price":0,"availabile":869}}}
