{"viewData":{"url_key":"canon_2680c011_eos_m50_mirrorless_digital","name":"Canon EOS M50 Mirrorless Digital Camera with 15-45mm Lens (Black)","sku":"1393461","price":"649.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS M50 Mirrorless Digital Camera with 15-45mm Lens (Black) featuring 24.1MP APS-C CMOS Sensor, DIGIC 8 Image Processor 2.36m-Dot OLED Electronic Viewfinder. Review Canon M50","long_description":"Comprising a versatile feature-set to suit both stills and video applications, the black EOS M50 Mirrorless Digital Camera from Canon separates itself from the pack with UHD 4K video recording, a high-resolution electronic viewfinder, and improved Dual Pixel CMOS AF with Eye Detection AF. Utilizing a 24.1MP APS-C CMOS sensor and DIGIC 8 image processor, improved Auto Lighting Optimizer helps to ensure clean image quality with low noise, along with top 10 fps shooting rate and a native sensitivity range of ISO 100-25600, which can be extended to ISO 51200 for working in low-light conditions. The sensor and processor combination also enables UHD 4K video recording at 23.98 fps, along with Full HD 1080p60 and HD 720p120 for slow motion capture. The sensor's design also facilitates Dual Pixel CMOS AF, which uses phase-detection autofocus for quick, accurate, and smooth performance to suit both stills and video use. Additionally, Combination IS 5-axis image stabilization also helps to realize steady, shake-free recording by minimizing the appearance of camera shake. Complementing the imaging attributes, the EOS M50 also incorporates a 2.36m-dot OLED electronic viewfinder and a 3.0\" touchscreen LCD for intuitive control. The screen's vari-angle design permits working from high and low working angles and its touchscreen interface allows working with Touch and Drag AF for easier manipulation of the AF area. Additionally, built-in Wi-Fi with NFC is available for quick and convenient pairing with a smartphone or tablet for wireless image sharing, and Bluetooth is also featured for image sharing to and remote camera control from a mobile device.","images":{"0":"b89e59cc7840a56d9fcbfabf6754902f-0.jpg","1":"b89e59cc7840a56d9fcbfabf6754902f-1.jpg","2":"b89e59cc7840a56d9fcbfabf6754902f-2.jpg","3":"b89e59cc7840a56d9fcbfabf6754902f-3.jpg","4":"b89e59cc7840a56d9fcbfabf6754902f-4.jpg","5":"b89e59cc7840a56d9fcbfabf6754902f-5.jpg","6":"b89e59cc7840a56d9fcbfabf6754902f-6.jpg","7":"b89e59cc7840a56d9fcbfabf6754902f-7.jpg","8":"b89e59cc7840a56d9fcbfabf6754902f-8.jpg"}},"configuration":{},"availability":{"1393461":{"aditional_price":0,"availabile":801}}}
