{"viewData":{"url_key":"canon_2680c067_eos_m50_mirrorless_digital","name":"Canon EOS M50 Mirrorless Digital Camera with 15-45mm Lens Video Creator Kit (Black)","sku":"1393464","price":"699.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS M50 Mirrorless Digital Camera with 15-45mm Lens Video Creator Kit (Black) featuring 24.1MP APS-C CMOS Sensor, DIGIC 8 Image Processor 2.36m-Dot OLED Electronic Viewfinder. Review Canon M50","long_description":"Comprising a versatile feature-set to suit both stills and video applications, the black EOS M50 Mirrorless Digital Camera from Canon separates itself from the pack with UHD 4K video recording, a high-resolution electronic viewfinder, and improved Dual Pixel CMOS AF with Eye Detection AF. Utilizing a 24.1MP APS-C CMOS sensor and DIGIC 8 image processor, improved Auto Lighting Optimizer helps to ensure clean image quality with low noise, along with top 10 fps shooting rate and a native sensitivity range of ISO 100-25600, which can be extended to ISO 51200 for working in low-light conditions. The sensor and processor combination also enables UHD 4K video recording at 23.98 fps, along with Full HD 1080p60 and HD 720p120 for slow motion capture. The sensor's design also facilitates Dual Pixel CMOS AF, which uses phase-detection autofocus for quick, accurate, and smooth performance to suit both stills and video use. Additionally, Combination IS 5-axis image stabilization also helps to realize steady, shake-free recording by minimizing the appearance of camera shake. Complementing the imaging attributes, the EOS M50 also incorporates a 2.36m-dot OLED electronic viewfinder and a 3.0\" touchscreen LCD for intuitive control. The screen's vari-angle design permits working from high and low working angles and its touchscreen interface allows working with Touch and Drag AF for easier manipulation of the AF area. Additionally, built-in Wi-Fi with NFC is available for quick and convenient pairing with a smartphone or tablet for wireless image sharing, and Bluetooth is also featured for image sharing to and remote camera control from a mobile device.The VideoMic GO Lightweight On-Camera Microphone from Rode is a lightweight microphone which adds high-quality audio recording to your small camcorder and HDSLR camera. At only 2.6 ounces, the microphone keeps your camera setup lightweight, making it ideal for handheld shooting. It features an integrated Rycote Lyre shock mount for isolation from bumps and vibration, and offers battery-free operation, using instead the plug-in power from your camera's 3.5mm microphone input. Please note that the microphone will not work with cameras that don't supply plug-in power to their 3.5mm audio input jack.The VideoMic GO is a directional microphone. It utilizes a supercardioid polar pattern to attenuate sounds from the sides, resulting in a signal that sounds closer to the camera, even when shooting in noisy environments or at moderate distances. The integrated shoe mount provides a 3/8\" thread for additional mounting options. A foam windshield and 7.9\" dual mono 3.5mm coiled output cable is included.","images":{"0":"969f90d94dab6d456c55046ea218f5f7-0.jpg","1":"969f90d94dab6d456c55046ea218f5f7-1.jpg","2":"969f90d94dab6d456c55046ea218f5f7-2.jpg","3":"969f90d94dab6d456c55046ea218f5f7-3.jpg","4":"969f90d94dab6d456c55046ea218f5f7-4.jpg","5":"969f90d94dab6d456c55046ea218f5f7-5.jpg","6":"969f90d94dab6d456c55046ea218f5f7-6.jpg","7":"969f90d94dab6d456c55046ea218f5f7-7.jpg","8":"969f90d94dab6d456c55046ea218f5f7-8.jpg","9":"969f90d94dab6d456c55046ea218f5f7-9.jpg","10":"969f90d94dab6d456c55046ea218f5f7-10.jpg","11":"969f90d94dab6d456c55046ea218f5f7-11.jpg","12":"969f90d94dab6d456c55046ea218f5f7-12.jpg"}},"configuration":{},"availability":{"1393464":{"aditional_price":0,"availabile":584}}}
