{"viewData":{"url_key":"sony_ilce_7m3k_b_alpha_a7_iii_mirrorless","name":"Sony Alpha a7 III Mirrorless Digital Camera with 28-70mm Lens","sku":"1394219","price":"2,198.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a7 III Mirrorless Digital Camera with 28-70mm Lens featuring 24MP Full-Frame Exmor R BSI CMOS Sensor, BIONZ X Image Processor &amp; Front-End LSI 693-Point Hybrid AF System. Review Sony A7 III","long_description":"Distinguished by its updated sensor design, the Alpha a7 III Mirrorless Digital Camera from Sony is a well-rounded camera suitable for both photo and video applications in a variety of working situations. Refined for improved speed and low-light performance, the full-frame 24.2MP Exmor R BSI CMOS sensor and BIONZ X image processor pair to realize an impressive 10 fps continuous shooting rate and improved autofocus performance for faster, more reliable subject tracking along with wide frame coverage. This updated Fast Hybrid AF System employs a combination of 693 phase-detection points and 425 contrast-detection areas for quicker acquirement of focus in a variety of lighting conditions, and also maintains focus on subjects more effectively. In addition to speed and AF, the processing improvements also help to realize greater image clarity and reduced noise throughout the sensitivity range from ISO 100-51200, which can further be expanded to ISO 50-204800. Video recording capabilities have also been extended for enhanced quality when recording UHD 4K video with the full width of the full-frame sensor to minimize moiré and aliasing. Additionally, benefitting both stills and video operation, the a7 III utilizes a 5-axis SteadyShot INSIDE sensor-shift image stabilization, which is now effective to minimize the appearance of camera shake by up to 5 stops.Beyond just updates to the imaging system, the a7 III's body design has also been revised to include a rear 3.0\" 922k-dot touchscreen LCD, which has a tilting design to better support working from high and low angles. A 2.36m-dot Tru-Finder OLED EVF is also featured for bright and clear eye-level monitoring. For greater shooting flexibility, dual SD memory card slots are now featured, and a larger NP-FZ100 battery is also employed to achieve up to approximately 710 shots per charge. Suiting the camera's use in trying conditions, the magnesium-alloy chassis and weather-sealing also render the a7 III dust- and moisture-resistant.","images":{"0":"5296fbbd7b8e79c86c61873ef8214851-0.jpg","1":"5296fbbd7b8e79c86c61873ef8214851-1.jpg","2":"5296fbbd7b8e79c86c61873ef8214851-2.jpg","3":"5296fbbd7b8e79c86c61873ef8214851-3.jpg","4":"5296fbbd7b8e79c86c61873ef8214851-4.jpg","5":"5296fbbd7b8e79c86c61873ef8214851-5.jpg","6":"5296fbbd7b8e79c86c61873ef8214851-6.jpg","7":"5296fbbd7b8e79c86c61873ef8214851-7.jpg","8":"5296fbbd7b8e79c86c61873ef8214851-8.jpg","9":"5296fbbd7b8e79c86c61873ef8214851-9.jpg","10":"5296fbbd7b8e79c86c61873ef8214851-10.jpg","11":"5296fbbd7b8e79c86c61873ef8214851-11.jpg","12":"5296fbbd7b8e79c86c61873ef8214851-12.jpg","13":"5296fbbd7b8e79c86c61873ef8214851-13.jpg","14":"5296fbbd7b8e79c86c61873ef8214851-14.jpg","15":"5296fbbd7b8e79c86c61873ef8214851-15.jpg","16":"5296fbbd7b8e79c86c61873ef8214851-16.jpg","17":"5296fbbd7b8e79c86c61873ef8214851-17.jpg"}},"configuration":{},"availability":{"1394219":{"aditional_price":0,"availabile":863}}}
