{"viewData":{"url_key":"canon_eos_m50_with_15_45mm","name":"Canon EOS M50 Mirrorless Digital Camera with 15-45mm Lens and Accessory Kit (Black)","sku":"1411820","price":"649.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS M50 Mirrorless Digital Camera with 15-45mm Lens and Accessory Kit (Black) featuring EF-M 15-45mm f/3.5-6.3 IS STM Lens, Memory Card Camera Bag. Review Canon M50","long_description":"Comprising a versatile feature-set to suit both stills and video applications, the black EOS M50 Mirrorless Digital Camera from Canon separates itself from the pack with UHD 4K video recording, a high-resolution electronic viewfinder, and improved Dual Pixel CMOS AF with Eye Detection AF. Utilizing a 24.1MP APS-C CMOS sensor and DIGIC 8 image processor, improved Auto Lighting Optimizer helps to ensure clean image quality with low noise, along with top 10 fps shooting rate and a native sensitivity range of ISO 100-25600, which can be extended to ISO 51200 for working in low-light conditions. The sensor and processor combination also enables UHD 4K video recording at 23.98 fps, along with Full HD 1080p60 and HD 720p120 for slow motion capture. The sensor's design also facilitates Dual Pixel CMOS AF, which uses phase-detection autofocus for quick, accurate, and smooth performance to suit both stills and video use. Additionally, Combination IS 5-axis image stabilization also helps to realize steady, shake-free recording by minimizing the appearance of camera shake. Complementing the imaging attributes, the EOS M50 also incorporates a 2.36m-dot OLED electronic viewfinder and a 3.0\" touchscreen LCD for intuitive control. The screen's vari-angle design permits working from high and low working angles and its touchscreen interface allows working with Touch and Drag AF for easier manipulation of the AF area. Additionally, built-in Wi-Fi with NFC is available for quick and convenient pairing with a smartphone or tablet for wireless image sharing, and Bluetooth is also featured for image sharing to and remote camera control from a mobile device.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Hunter 15 DSLR Holster Bag from Ruggard holds your mirrorless camera with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. The 49mm 95-UVAT UV Filter is one of Chiaro’s highly-rated protective UV filters with 95% light transmission. It’s useful for photographers of all levels who demand high-quality glass and other essential features for great image fidelity and construction.","images":{"0":"84c296ac02121fb31365494cd754c4c4-0.jpg","1":"84c296ac02121fb31365494cd754c4c4-1.jpg","2":"84c296ac02121fb31365494cd754c4c4-2.jpg","3":"84c296ac02121fb31365494cd754c4c4-3.jpg","4":"84c296ac02121fb31365494cd754c4c4-4.jpg"}},"configuration":{},"availability":{"1411820":{"aditional_price":0,"availabile":650}}}
