{"viewData":{"url_key":"leica_19130_c_lux_digital_camera_midnight","name":"Leica C-Lux Digital Camera (Midnight Blue)","sku":"1416961","price":"1,050.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Leica C-Lux Digital Camera (Midnight Blue) featuring 20.1MP 1&quot; MOS Sensor, Leica DC Vario-Elmar 15x Zoom Lens 24-360mm (35mm Equivalent). Review Leica C-Lux","long_description":"Sleek, stylish, and versatile, the midnight blue Leica C-Lux is a multimedia digital camera well-suited for everyday shooting. Revolving around a 20.1MP 1\" MOS sensor, both high-resolution stills and UHD 4030p video can be recorded. The sensor's design affords a top sensitivity of ISO 25600 to enable working in low light, and a top 10-fps shooting rate is also available for photographing moving subjects. Complementing the sensor's versatility is a 15x optical zoom Leica DC Vario-Elmar lens, which covers a 24-360mm equivalent focal length range for photographing in a broad variety of situations. This lens's reach is benefited by 5-axis optical image stabilization, which minimizes the appearance of camera shake for sharper imagery when working handheld.  Beyond its performance, the C-Lux is also distinguished by its physical design that incorporates both a 2.33m-dot electronic viewfinder, for bright eye-level shooting, and a 3.0\" 1.24m-dot touchscreen LCD. Additionally, built-in Wi-Fi and Bluetooth LE connectivity permits wirelessly sharing photos and movies to your mobile devices via the dedicated Leica C-Lux app.","images":{"0":"4f727df43a9112a0cbd6ac62e9e5872e-0.jpg","1":"4f727df43a9112a0cbd6ac62e9e5872e-1.jpg","2":"4f727df43a9112a0cbd6ac62e9e5872e-2.jpg","3":"4f727df43a9112a0cbd6ac62e9e5872e-3.jpg","4":"4f727df43a9112a0cbd6ac62e9e5872e-4.jpg","5":"4f727df43a9112a0cbd6ac62e9e5872e-5.jpg","6":"4f727df43a9112a0cbd6ac62e9e5872e-6.jpg","7":"4f727df43a9112a0cbd6ac62e9e5872e-7.jpg","8":"4f727df43a9112a0cbd6ac62e9e5872e-8.jpg"}},"configuration":{},"availability":{"1416961":{"aditional_price":0,"availabile":524}}}
