{"viewData":{"url_key":"sony_cyber_shot_dsc_rx100_vi_basic","name":"Sony Cyber-shot DSC-RX100 VI Digital Camera with Accessory Kit","sku":"1423236","price":"1,198.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Cyber-shot DSC-RX100 VI Digital Camera with Accessory Kit featuring Memory Card, Camera Case External Battery Charger. Review Sony DSC-RX100 VI","long_description":"Offering longer reach and improved performance, the Cyber-shot DSC-RX100 VI from Sony is a pocket-sized powerhouse characterized by an impressive lineup of stills and video capabilities. Distinguished in the series by its extended zoom, the RX100 VI sports a 24-200mm-equivalent ZEISS Vario-Sonnar T* lens covering wide-angle to telephoto focal lengths for greater shooting flexibility. Leveraging the most from the updated lens design is the 20.1MP 1\" Exmor RS CMOS sensor, along with an improved BIONZ X image processor, for fast shooting performance to 24 fps, high sensitivity to ISO 12800, and UHD 4K video recording. The sensor's design also provides a 315-point hybrid AF system for quick and accurate focus performance and subject tracking in both stills and video modes. A stacked design and front-end LSI also contribute to quickened operation and enhanced image quality. Video performance has been upgraded through the incorporation of S-Log3 and HLG gamma settings, and High Frame Rate shooting allows you to record at up to 960 fps for slow-motion playback.Even with the integrated 24-200mm, the form factor of the RX100 VI remains nearly as compact as ever, but still without sacrificing on functionality. A pop-up 2.36m-dot OLED electronic viewfinder is a sleek means for eye-level viewing or, alternatively, a 3.0\" 921.6k-dot LCD touchscreen can be used. The LCD features a tilting design to support working from high and low angles and its touch capability permits the use of Touch Focus and Touch Shutter functions. The camera also sports wireless connectivity for sharing imagery to a linked mobile device or for embedding location information from your smartphone.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.The HFV-260 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.The Sony BCTRX Battery Charger is a portable battery charger that is compatible with Info-Lithium X, G, N, D, T, R, and K-series battery packs. It is capable of fully charging a battery in as little as 90 minutes and it features a retractable plug and compact design for traveling.","images":{"0":"04790fa99b1afedfc84ba18dc02e788e-0.jpg","1":"04790fa99b1afedfc84ba18dc02e788e-1.jpg","2":"04790fa99b1afedfc84ba18dc02e788e-2.jpg","3":"04790fa99b1afedfc84ba18dc02e788e-3.jpg","4":"04790fa99b1afedfc84ba18dc02e788e-4.jpg"}},"configuration":{},"availability":{"1423236":{"aditional_price":0,"availabile":524}}}
