{"viewData":{"url_key":"fujifilm_x_h1_ditigal_camera_with","name":"FUJIFILM X-H1 Mirrorless Digital Camera with Vertical Grip and Accessories Kit","sku":"1423232","price":"1,757.90","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM X-H1 Mirrorless Digital Camera with Vertical Grip and Accessories Kit featuring VPB-XH1 Vertical Power Booster Grip, Memory Card Camera Bag. Review FUJIFILM X-H1","long_description":"Offering plenty of features inside a durable magnesium-alloy housing, the X-H1 Mirrorless Digital Camera from FUJIFILM aims to position itself as a leading option for professional video and photo work. Equipped with a 24.3MP APS-C X-Trans CMOS III image sensor and the X-Processor Pro Engine, this camera allows you to capture high quality imagery quickly and with low noise at sensitivities up to ISO 51200. A major implementation is an in-body 5-axis image stabilization system, a first for X-Series cameras, which can compensate for up to 5.5 stops of shutter speed to create sharp imaging even when little light is available.Bring out the full potential of your X-H1 mirrorless camera with the VPB-XH1 Vertical Power Booster Grip from FUJIFILM. Capable of holding up to two batteries in addition to the one already in the camera, this grip increases the maximum number of shots in normal mode to approximately 900 stills. Its boost mode is its main feature, allowing it to use both batteries simultaneously to improve the speed of burst shots while reducing shutter time lag and blackout period. Additionally, the VPB-XH1 increases the maximum period for movie shooting to about 30 minutes in 4K, making it an essential accessory for videographers.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.The black Outrigger 45 Backpack from Ruggard holds a standard DSLR system and an iPad. The front pocket measures 8.0 x 7.25\" and contains five small, pen-sized slip-in slots as well as a mesh stash pocket. The second compartment is dedicated for your iPad. The third compartment measures 14.5 x 8.5\" and contains three memory card pockets, two slash stretch pockets and a key ring. The spacious main compartment for your camera gear includes seven removable dividers that can be configured to accommodate whatever gear you carry. For carrying comfort, the back of the backpack is made from a breathable, small-mesh, padded material and features a padded shoulder harness. You can also carry the backpack using the nylon grip handle at the top. The backpack has a sternum strap and a hideaway waist strap. An attached rain cover for inclement weather can be hidden away at the base of the backpack.For using the maximum power of your mirrorless camera, the FUJIFILM NP-W126S Li-Ion Battery Pack has been designed to better manage heat and ensure lightning fast camera performance. This battery is also compatible with older cameras that use the NP-W126 battery pack, but users will not see any performance advantages in those bodies.","images":{"0":"aa1fefeadeec8c502bc17c1acaee3dcc-0.jpg","1":"aa1fefeadeec8c502bc17c1acaee3dcc-1.jpg","2":"aa1fefeadeec8c502bc17c1acaee3dcc-2.jpg","3":"aa1fefeadeec8c502bc17c1acaee3dcc-3.jpg","4":"aa1fefeadeec8c502bc17c1acaee3dcc-4.jpg","5":"aa1fefeadeec8c502bc17c1acaee3dcc-5.jpg"}},"configuration":{},"availability":{"1423232":{"aditional_price":0,"availabile":356}}}
