{"viewData":{"url_key":"panasonic_lumix_dc_gh5_mirrorless_micro","name":"Panasonic Lumix DC-GH5 Mirrorless Micro Four Thirds Digital Camera with 12-35mm f/2.8 Lens and Accessories Kit","sku":"1429260","price":"2,395.98","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-GH5 Mirrorless Micro Four Thirds Digital Camera with 12-35mm f/2.8 Lens and Accessories Kit featuring X Vario 12-35mm f/2.8 II ASPH. Lens, Memory Card Camera Bag. Review Panasonic DC-GH5","long_description":"Upgraded, redesigned, and filled with features, the Lumix DC-GH5 Mirrorless Micro Four Thirds Digital Camera from Panasonic provides an outstanding imaging platform for shooters who demand some of the best video and still photography quality they can get in a single compact camera. At the heart of the camera is a 20.3MP Digital Live MOS sensor and a newly developed Venus Engine processor, which both offer dramatically improved processing times over its predecessor. This enables the ability to record 4K video at up to 60 fps, 10-bit 4:2:2 internal recording with select settings, Full HD video at up to 180 fps, 12 fps continuous shooting, and sensitivities up to ISO 25600. Also, the camera features built-in 5-axis sensor stabilization, which can work with certain lenses to activate Dual I.S. 2 for highly effective shake correction that can compensate for up to 5 stops of shutter speed. Other improvements include a speedier and more accurate Advanced DFD autofocus system that can lock on in just 0.05 seconds, as well as 6K PHOTO at 30 fps and 4K PHOTO at up to 60 fps.Along with all these internal improvements, the body received some significant upgrades as well. For viewing and composing images both the 0.76x OLED viewfinder and 3.2\" free-angle touchscreen received resolution bumps to 3.68m dots and 1.62 m dots, respectively. This will make shooting more comfortable and more accurate. The magnesium alloy body is now freezeproof to 14°F in addition to splash and dustproof. For fast image transfer and saving, there are now two UHS-II SD card slots. Additionally, for a completely wireless setup it offers both Wi-Fi and Bluetooth for advanced functionality when paired with a mobile app.A versatile zoom covering wide-angle to portrait-length perspectives, the Lumix G X Vario 12-35mm f/2.8 II ASPH. POWER O.I.S. Lens from Panasonic is designed for Micro Four Thirds cameras, where it provides a convenient 24-70mm equivalent focal length range. A constant f/2.8 maximum aperture affords consistent performance throughout the zoom range, and benefits working in difficult lighting conditions as well as enables greater control over depth of field. The sophisticated optical design employs a series of aspherical, low dispersion, and high refractive index glass elements to control a variety of aberrations and distortions for sharp, clean image quality and a Nano Surface Coating has also been applied to reduce ghosting and flare. A POWER Optical Image Stabilizer minimizes the appearance of camera shake to suit handheld shooting, and this O.I.S. system is also compatible with Dual I.S. for enhanced stabilization performance. Additionally, the lens also features a durable all-metal housing that is dust, splash, and freezeproof to enable its use in harsh climates.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.Store, transport, and protect your DSLR with attached lens, 2-4 extra lenses, flash, and related accessories with the black Kontrast DSLR Shoulder Bag from Case Logic. The padded main compartment has a hammock system that suspends the camera for improved shock protection, and padded, touch-fastening dividers for organizing gear. Water-resistant DuraBase, foam padding, and polyester construction ensures strength and durability. The lid unzips away from wearer for easy access to gear, and has a convenient zip pocket underneath for small items. Dual, zippered side and front pockets provide additional storage capacity. The front pocket features two slip-in pockets. Carry your Kontrast Shoulder Bag with the padded top handle, or wear with the removable, padded shoulder strap. The gray interior lining makes finding gear in low light easier.The Watson DMW-BLF19 Lithium-Ion Battery Pack works with the same cameras as the Panasonic DMW-BLF19 or Sigma BP-61. This replacement battery pack features a capacity of 1750mAh, 7.4V of output power, and 12.95 watt hours. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effects.","images":{"0":"9d9106856287b1e4ab6d3792d032f11e-0.jpg","1":"9d9106856287b1e4ab6d3792d032f11e-1.jpg","2":"9d9106856287b1e4ab6d3792d032f11e-2.jpg","3":"9d9106856287b1e4ab6d3792d032f11e-3.jpg","4":"9d9106856287b1e4ab6d3792d032f11e-4.jpg","5":"9d9106856287b1e4ab6d3792d032f11e-5.jpg"}},"configuration":{},"availability":{"1429260":{"aditional_price":0,"availabile":743}}}
