{"viewData":{"url_key":"nikon_z6_mirrorless_digital_camera","name":"Nikon Z 6 Mirrorless Digital Camera with 24-70mm Lens and FTZ Mount Adapter Kit","sku":"1431755","price":"2,596.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon Z 6 Mirrorless Digital Camera with 24-70mm Lens and FTZ Mount Adapter Kit featuring 24.5MP FX-Format BSI CMOS Sensor, EXPEED 6 Image Processing Engine UHD 4K30 Video; N-Log &amp; 10-Bit HDMI Out. Review Nikon Z6","long_description":"Part of Nikon's next step in their imaging journey, the Z 6 Mirrorless Camera is positioned as the \"all-arounder\" within the new Z System. Beginning with the Z Mount itself, a large-diameter design with a short 16mm flange distance allows Nikon to create compact, yet powerful cameras and develop more advanced optics. The Z 6 is among the first in the series, and features a high-performing FX-format 24.5MP BSI CMOS sensor and the EXPEED 6 Image Processing Engine delivering outstanding image quality and speed with a native sensitivity range of ISO 100-51200.On the sensor you will find an advanced phase-detect autofocus system using 273 points covering 90% of the image area, and the sensor features 5-axis Vibration Reduction technology for stabilized photos and video regardless of the lens used. This advanced hybrid AF system will also benefit video. The Z 6 features UHD 4K recording at up to 30p and can use the N-Log gamma profile along with the camera's 10-bit HDMI output to create cinema-quality video.As with many mirrorless systems, the Z Series boasts a much more compact form factor than its DSLR counterparts. The Z 6 is no exception with its slimmed down design and lighter build, though it maintains the weather sealing and ergonomics for which Nikon is known. The camera features multiple displays and screens for ease of use, including a 0.80x 3.6m-dot EVF with NIKKOR optics and a Fluorine coating, ensuring clear viewing. The rear of the camera is equipped with a 3.2\" 2.1m-dot tilting touchscreen LCD while the top offers a dot-matrix OLED for quickly checking settings. For storage, the Z 6 has a single XQD card slot that is compatible with CFexpress for faster speeds in the future. Additionally, the body is equipped with both Wi-Fi and Bluetooth.Enabling the use of nearly any Nikon F-mount lens on Z-mount mirrorless camera bodies, the FTZ Mount Adapter is a sophisticated means for expanding the range of usable lenses. While compatible with approximately 360 distinct F-mount lenses, this adapter is especially ideal for use with over 90 E, G, and D-type lenses, where it fully maintains autofocus and auto-exposure capabilities for seamless use of the SLR lenses on the mirrorless body. The adapter, which is built from magnesium alloy and is weather-sealed, also incorporates a 1/4\"-20 mount on the base to provide a more balanced means for working on a tripod with longer, heavier lenses.","images":{"0":"7164fb6ade782e0f18ab0fc765435afa-0.jpg","1":"7164fb6ade782e0f18ab0fc765435afa-1.jpg","2":"7164fb6ade782e0f18ab0fc765435afa-2.jpg"}},"configuration":{},"availability":{"1431755":{"aditional_price":0,"availabile":445}}}
