{"viewData":{"url_key":"canon_powershot_sx740_hs_digital","name":"Canon PowerShot SX740 HS Digital Camera with Accessories Kit (Black)","sku":"1433954","price":"399.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon PowerShot SX740 HS Digital Camera with Accessories Kit (Black) featuring 20.3MP CMOS Digital Camera Sensor, DIGIC 8 Image Processor 24-960mm (35mm Equivalent). Review Canon SX740 HS","long_description":"Few things will be too far away for the black PowerShot SX740 HS Digital Camera from Canon. Boasting a 20.3MP CMOS sensor and 40x optical zoom, this all-in-one point-and-shoot can capture things near and far. Helping the far end of its 24-960mm zoom range (35mm equivalent) is optical image stabilization which keeps your photos sharp and in focus. Zoom Framing Assistant makes it easier to track subjects at the long end of the focal length by quickly zooming out and then back in at the press of a button once you've located your subject. Canon's DIGIC 8 Image Processor helps the camera keep up with your shooting, allowing for 10-fps continuous shooting with AF lock on.  The 20.3MP sensor is also capable of 4K video and 4K time-lapse recording. Framing for videos and photos can be done via the 3.0\" LCD screen on the rear of the device, which can tilt 180° for selfies. Built-in Wi-Fi and Bluetooth allow the camera to connect to compatible mobile devices with the Canon Camera Connect app installed and enables quick editing and sharing of photos.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 16GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 16GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the U3 speed class, which guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 16GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The HFV-260 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.","images":{"0":"1c15fc63068897748e7c63aa5139171c-0.jpg","1":"1c15fc63068897748e7c63aa5139171c-1.jpg","2":"1c15fc63068897748e7c63aa5139171c-2.jpg","3":"1c15fc63068897748e7c63aa5139171c-3.jpg"}},"configuration":{},"availability":{"1433954":{"aditional_price":0,"availabile":903}}}
