{"viewData":{"url_key":"canon_eos_r_mirrorless_digital","name":"Canon EOS R Mirrorless Digital Camera (Body Only)","sku":"1433710","price":"2,299.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Canon EOS R Mirrorless Digital Camera (EOSR Camera Body) featuring 30.3MP Full-Frame CMOS Sensor, DIGIC 8 Image Processor.","long_description":"The first step in Canon's mirrorless evolution, the EOS R pairs a redeveloped lens mount and updated full-frame image sensor for a unique and sophisticated multimedia camera system. Revolving around the new RF lens mount, the EOS R is poised to be the means from which to make the most of a new series of lenses and optical technologies.Focusing on the camera itself, the EOS R features a high-resolution 30.3MP full-frame CMOS sensor along with a DIGIC 8 image processor. The combination of these technologies offers a wide sensitivity range up to a native ISO 40000, fast continuous shooting to 8 fps, and UHD 4K30 video recording. In addition to imaging, the sensor also facilitates an advanced Dual Pixel CMOS AF system, which uses 5655 selectable points for quickly and accurately acquiring focus. This focusing system is also sensitive down to EV -6 for working in impressively dark conditions. The AF system is also perfectly matched to the UHD 4K video recording capabilities, which are also rounded out by Movie Digital IS to minimize camera shake, built-in Canon Log gamma for a greater dynamic range, and 4K 10-bit 4:2:2 output over HDMI for even greater color control.Beyond the performance attributes, this camera has been designed from the ground up and features a high-resolution 3.69m-dot OLED electronic viewfinder for clear and bright eye-level viewing. Conversely, a rear 3.15\" 2.1m-dot LCD touchscreen is also featured, and has a swivel design to suit working from high and low angles. Also catering to the tactile cravings is a Multi-Function bar, which is customizable for intuitively adjusting shooting settings. And as a camera built to withstand the toughest environments, the magnesium alloy body is dust and moisture-sealed.","images":{"0":"457cb712db72d3414b564f3a739723e2-0.jpg","1":"457cb712db72d3414b564f3a739723e2-1.jpg","2":"457cb712db72d3414b564f3a739723e2-2.jpg","3":"457cb712db72d3414b564f3a739723e2-3.jpg","4":"457cb712db72d3414b564f3a739723e2-4.jpg","5":"457cb712db72d3414b564f3a739723e2-5.jpg","6":"457cb712db72d3414b564f3a739723e2-6.jpg","7":"457cb712db72d3414b564f3a739723e2-7.jpg","8":"457cb712db72d3414b564f3a739723e2-8.jpg","9":"457cb712db72d3414b564f3a739723e2-9.jpg","10":"457cb712db72d3414b564f3a739723e2-10.jpg","11":"457cb712db72d3414b564f3a739723e2-11.jpg","12":"457cb712db72d3414b564f3a739723e2-12.jpg","13":"457cb712db72d3414b564f3a739723e2-13.jpg","14":"457cb712db72d3414b564f3a739723e2-14.jpg","15":"457cb712db72d3414b564f3a739723e2-15.jpg","16":"457cb712db72d3414b564f3a739723e2-16.jpg"}},"configuration":{},"availability":{"1433710":{"aditional_price":0,"availabile":562}}}
