{"viewData":{"url_key":"fujifilm_16588509_x_t3_mirrorless_digital_camera","name":"FUJIFILM X-T3 Mirrorless Digital Camera (Body Only, Black)","sku":"1433839","price":"1,499.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"uy Fujifilm X-T3 Mirrorless Digital Camera (XT3 Camera Body, Black) features 26.1MP APS-C X-Trans BSI CMOS 4 Sensor, X-Processor 4 with Quad CPU. ","long_description":"Designed for videographers and action photographers alike, the black FUJIFILM X-T3 is a versatile mirrorless camera characterized by its high-speed performance, more-than-capable imaging, and multimedia flexibility. Revolving around a newly developed image sensor and processor, both high-resolution stills and 4K video can be recorded while an apt autofocus system delivers quick and accurate focusing performance. The sensor, a 26.1MP APS-C-format X-Trans CMOS 4, features a back-illuminated design, to promote greater image quality throughout the sensitivity range, along with an expansive 2.16m-point phase-detection autofocus system for quick, precise AF performance and subject tracking. Complementing the imaging and focusing is the X-Processor 4, which uses four CPUs for faster image processing as well as continuous shooting up to 11 fps with a mechanical shutter, 30 fps shooting at a 1.25x crop and electronic shutter, and internal 4K60p 10-bit video recording. Like previous X-T cameras, the X-T3 retains its classically inspired looks and prominent tactile controls, and adds a new OLED electronic viewfinder design with 3.69m-dot resolution and a high 0.75x magnification. This finder has a high refresh rate of 100 fps for fluid viewing and remains blackout-free while shooting at the top 30 fps shooting rate. Also, a unique Sports Finder Mode can be used, which highlights the 16.6MP crop area in order to give you additional room outside of the frame to recognize moving subjects. Conversely, a rear 3.2\" 1.04m-dot LCD monitor can also be used for live view shooting and larger image playback. Additionally, the X-T3 also sports built-in Bluetooth for wireless sharing and remote control, and the magnesium-alloy body is fully weather-sealed for working in trying weather conditions.","images":{"0":"14e600594c1af16e0cbb80c087e445de-0.jpg","1":"14e600594c1af16e0cbb80c087e445de-1.jpg","2":"14e600594c1af16e0cbb80c087e445de-2.jpg","3":"14e600594c1af16e0cbb80c087e445de-3.jpg","4":"14e600594c1af16e0cbb80c087e445de-4.jpg","5":"14e600594c1af16e0cbb80c087e445de-5.jpg","6":"14e600594c1af16e0cbb80c087e445de-6.jpg","7":"14e600594c1af16e0cbb80c087e445de-7.jpg","8":"14e600594c1af16e0cbb80c087e445de-8.jpg","9":"14e600594c1af16e0cbb80c087e445de-9.jpg","10":"14e600594c1af16e0cbb80c087e445de-10.jpg","11":"14e600594c1af16e0cbb80c087e445de-11.jpg","12":"14e600594c1af16e0cbb80c087e445de-12.jpg"}},"configuration":{},"availability":{"1433839":{"aditional_price":0,"availabile":375}}}
