{"viewData":{"url_key":"nikon_1588_d3500_dslr_camera_with","name":"Nikon D3500 DSLR Camera with 18-55mm and 70-300mm Lenses","sku":"1433065","price":"546.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D3500 DSLR Camera with 18-55mm and 70-300mm Lenses featuring 24.2MP DX-Format CMOS Sensor, EXPEED 4 Image Processor No Optical Low-Pass Filter. Review Nikon D3500","long_description":"Compact, easy to use, and versatile are all traits of the Nikon D3500, which is designed to be as flexible and intuitive as possible, while still offering the imaging capabilities you expect from a DSLR. Utilizing a DX-format 24.2MP CMOS sensor and EXPEED 4 image processor, the D3500 provides a native sensitivity range from ISO 100-25600 to suit working in a variety of lighting conditions, and the sensor and processor combination also provides a 5 fps continuous shooting rate as well as Full HD 1080p video recording at 60 fps. The sensor's design also omits an optical low-pass filter in order to achieve greater sharpness and resolution from both photos and videos.Complementing the imaging capabilities, the D3500 also features SnapBridge, which utilizes Bluetooth connectivity, for wireless sharing of images to your mobile device, including automatic sharing of 2MP images between the camera and your mobile device. The lightweight camera body incorporates a 3.0\" 921k-dot LCD screen for live view monitoring and image review and, catering to first-time DSLR owners, the D3500 also features a helpful Guide Mode to aid in achieving specific photographic looks or techniques, such as how to produce shallow depth of field imagery in a helpful, step-by-step manner. Ten different Special Effects are also available in-camera to creatively refine the look of both stills and movies.","images":{"0":"28ee1fb2b0aae920c15c54d29cf9989f-0.jpg","1":"28ee1fb2b0aae920c15c54d29cf9989f-1.jpg","2":"28ee1fb2b0aae920c15c54d29cf9989f-2.jpg","3":"28ee1fb2b0aae920c15c54d29cf9989f-3.jpg","4":"28ee1fb2b0aae920c15c54d29cf9989f-4.jpg","5":"28ee1fb2b0aae920c15c54d29cf9989f-5.jpg","6":"28ee1fb2b0aae920c15c54d29cf9989f-6.jpg","7":"28ee1fb2b0aae920c15c54d29cf9989f-7.jpg","8":"28ee1fb2b0aae920c15c54d29cf9989f-8.jpg","9":"28ee1fb2b0aae920c15c54d29cf9989f-9.jpg","10":"28ee1fb2b0aae920c15c54d29cf9989f-10.jpg"}},"configuration":{},"availability":{"1433065":{"aditional_price":0,"availabile":427}}}
