{"viewData":{"url_key":"panasonic_lumix_dc_gx9_mirrorless_micro","name":"Panasonic Lumix DC-GX9 Mirrorless Micro Four Thirds Digital Camera with 12-60mm Lens and Accessories Kit (Black)","sku":"1439450","price":"797.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-GX9 Mirrorless Micro Four Thirds Digital Camera with 12-60mm Lens and Accessories Kit (Black) featuring 12-60mm f/3.5-5.6 ASPH POWER O.I.S. Lens, Camera Bag Memory Card. Review Panasonic DC-GX9","long_description":"Offering a versatile feature-set to please photographers and videographers alike, the black Lumix DC-GX9 from Panasonic is a Micro Four Thirds mirrorless camera that is also characterized by its rangefinder-inspired body design and sleek form factor. Featuring a 20.3 MP Digital Live MOS sensor, along with a Venus Engine image processor, the GX9 is able to record UHD 4K movies at 30 or 24 fps, record full-resolution stills at up to 9 fps with AF-S or 8MP stills at 30 fps, and work in difficult lighting situations with a top sensitivity of ISO 25600. Additionally, complementing the imaging capabilities, is a Dual I.S.2 system that offers the use of both in-camera and in-lens image stabilization systems to effectively minimize the appearance of camera shake by up to four stops. In regard to the physical design, the GX9 incorporates a tilting 2.76m-dot electronic viewfinder and a tilting 3.0\" 1.24m-dot rear LCD touchscreen to suit working from a variety of angles. A top dual dial affords direct adjustment of both exposure compensation and shooting mode settings, and the top plate also avails access to a hot shoe as well as a built-in pop-up flash. For remote use of the camera, integrated Bluetooth LE allows wireless control over the shutter and select shooting functions with a linked mobile device, and built-in Wi-Fi can also be used for transferring imagery to a smartphone or tablet.The Hunter 25 DSLR Holster Bag from Ruggard is slightly larger than the Hunter 15 and holds your DSLR with lens attached, face down, in shooting position. When you're ready to shoot, simply remove your camera, get the shot and replace your camera in the bag. The zippered top of the bag opens away from your body for fast access to your gear. This also serves as a security feature since no one but you will be able to see inside the bag. Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.Corel PaintShop Pro 2019 Ultimate is a comprehensive photo editing, image management, and graphic design software, along with a bonus pack of four additional programs—PhotoMirage Express, Painter Essentials 6, Perfectly Clear 3.5 SE, and AfterShot 3—for a thorough range of post-production capabilities. The 2019 version of this application sees updates to performance speeds, with faster, more intuitive, and versatile tools, as well as a simplified user experience and a greater range of creative capabilities. Individual tools have been optimized for greater control, including the Crop tool, which now has faster performance along with the ability to apply several enhancement features during the cropping process. Additionally, support has been added for 360° imagery along with new brushes, palettes, gradients, patterns, and picture tubes for a richer range of adjustments and effects you can apply to your photos.","images":{"0":"deef0ff503c3a994bbf3c681cf690220-0.jpg","1":"deef0ff503c3a994bbf3c681cf690220-1.jpg","2":"deef0ff503c3a994bbf3c681cf690220-2.jpg","3":"deef0ff503c3a994bbf3c681cf690220-3.jpg","4":"deef0ff503c3a994bbf3c681cf690220-4.jpg"}},"configuration":{},"availability":{"1439450":{"aditional_price":0,"availabile":921}}}
