{"viewData":{"url_key":"nikon_coolpix_p1000_digital_camera","name":"Nikon COOLPIX P1000 Digital Camera with Accessory Kit","sku":"1441953","price":"996.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon COOLPIX P1000 Digital Camera with Accessory Kit featuring Memory Card, Camera Bag. Review Nikon P1000","long_description":"Shoot at staggering distances with the 125x optical zoom COOLPIX P1000 Digital Camera from Nikon. This camera, which has a 16MP backside illuminated CMOS sensor, features a built-in NIKKOR lens with a 35mm equivalent focal length range of 24-3000mm. You can zoom even further with 250x Dynamic Fine digital zoom, which will give you an equivalent focal length of 6000mm. Coupled with these extreme focal lengths is Nikon's Dual Detect Optical Vibration Reduction, which provides 5 stops of optical image stabilization and ensures your telephoto shots are crisp.Gracing the back of the camera are a 3.2\" vari-angle, 921k-dot LCD monitor and an eye-level 2.36m-dot electronic viewfinder, so your subjects will always be easy to see. The camera is also capable of recording 4K UHD video at 30 or 25 fps and supports an external microphone via a 3.5mm connector. Camera shake may be a concern while shooting at extreme focal lengths on a tripod. Or, you may need to otherwise remotely operate the P1000. The optional ML-L7 remote satisfies these needs with wireless operation off the camera's zoom, shutter, and other settings. Once you're done with a shoot, immediately access your photos on a paired smartphone via the Nikon SnapBridge app and the camera's built-in Wi-Fi and Bluetooth.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 150 MB/s and write speeds max out at 60 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s.Store, protect, and transport your compact DSLR or mirrorless camera with an attached lens, flash, related accessories, and up to two extra lenses with the lightweight, black Journey 34 DSLR Shoulder Bag from Ruggard. This handsome bag features a large flap with a quick release buckle, and double-pull zipper closure. The main compartment has four padded, touch-fastening dividers for organizing equipment. A light gray interior lining makes it easier to locate gear in low light. Under the lid is a large, zippered, mesh accessory pocket. Small accessories are easily accommodated in the front exterior zippered pocket. Inside this pocket are two slip-in pockets, two memory card pockets with touch-fastening flaps, and a zippered mesh pocket.  Photographers will appreciate the neoprene water bottle/accessory pocket located on the exterior left side of the bag. On the opposite side is a strap for attaching accessories. Carry the Journey 34 Shoulder Bag by the padded top handle, or wear with the removable, adjustable, padded shoulder strap. The strap has swiveling snap-hooks that attach to metal D-rings on either side of bag. And on the back of the bag is a trolley strap that comes in handy when traveling with rolling luggage. Two strips of plastic feet on the bottom of the bag help protect it against abrasion. This well-made bag is constructed from weather-resistant polyester and ballistic nylon.","images":{"0":"5f6067ac6139a9b49505e873c3bbace3-0.jpg","1":"5f6067ac6139a9b49505e873c3bbace3-1.jpg","2":"5f6067ac6139a9b49505e873c3bbace3-2.jpg","3":"5f6067ac6139a9b49505e873c3bbace3-3.jpg"}},"configuration":{},"availability":{"1441953":{"aditional_price":0,"availabile":674}}}
