{"viewData":{"url_key":"nikon_d3500_dslr_camera_with","name":"Nikon D3500 DSLR Camera with 18-55mm and 70-300mm Lenses Basic Kit","sku":"1442373","price":"579.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon D3500 DSLR Camera with 18-55mm and 70-300mm Lenses Basic Kit featuring AF-P DX 18-55mm f/3.5-5.6G VR Lens, AF-P DX 70-300mm f/4.5-6.3G ED Lens Memory Card. Review Nikon D3500","long_description":"Compact, easy to use, and versatile are all traits of the Nikon D3500, which is designed to be as flexible and intuitive as possible, while still offering the imaging capabilities you expect from a DSLR. Utilizing a DX-format 24.2MP CMOS sensor and EXPEED 4 image processor, the D3500 provides a native sensitivity range from ISO 100-25600 to suit working in a variety of lighting conditions, and the sensor and processor combination also provides a 5 fps continuous shooting rate as well as Full HD 1080p video recording at 60 fps. The sensor's design also omits an optical low-pass filter in order to achieve greater sharpness and resolution from both photos and videos.Complementing the imaging capabilities, the D3500 also features SnapBridge, which utilizes Bluetooth connectivity, for wireless sharing of images to your mobile device, including automatic sharing of 2MP images between the camera and your mobile device. The lightweight camera body incorporates a 3.0\" 921k-dot LCD screen for live view monitoring and image review and, catering to first-time DSLR owners, the D3500 also features a helpful Guide Mode to aid in achieving specific photographic looks or techniques, such as how to produce shallow depth of field imagery in a helpful, step-by-step manner. Ten different Special Effects are also available in-camera to creatively refine the look of both stills and movies.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.With the Watson EN-EL14A V2 Lithium-Ion Battery Pack, you can power any camera that runs on the Nikon EN-EL14A. This replacement battery features 7.4V of output power, an 1100mAh capacity, and an 8.14Wh energy consumption rate. Small and lightweight, lithium-ion batteries can be charged or discharged at any time without developing memory effect.The 55mm 98-UVATS UV Filter is one of Chiaro’s highest-rated protective UV filters with 98% light transmission. It’s ideal for photographers of all levels who demand high-quality glass and other essential features for excellent image fidelity and construction.The 58mm 95-UVAT UV Filter is one of Chiaro’s highly-rated protective UV filters with 95% light transmission. It’s useful for photographers of all levels who demand high-quality glass and other essential features for great image fidelity and construction.Clean your lenses, fine optics, LCD displays, and even your eyeglasses with the Lens Care Kit from optics manufacturer, ZEISS. Compact enough to store in almost any camera bag, the kit comes with a 2 ounce lens cleaning spray bottle and a microfiber cloth.","images":{"0":"6ed9ece8a5cc2c3761709af8774d9d77-0.jpg","1":"6ed9ece8a5cc2c3761709af8774d9d77-1.jpg","2":"6ed9ece8a5cc2c3761709af8774d9d77-2.jpg","3":"6ed9ece8a5cc2c3761709af8774d9d77-3.jpg","4":"6ed9ece8a5cc2c3761709af8774d9d77-4.jpg","5":"6ed9ece8a5cc2c3761709af8774d9d77-5.jpg","6":"6ed9ece8a5cc2c3761709af8774d9d77-6.jpg"}},"configuration":{},"availability":{"1442373":{"aditional_price":0,"availabile":694}}}
