{"viewData":{"url_key":"sony_alpha_a7_iii_mirrorless","name":"Sony Alpha a7 III Mirrorless Digital Camera with 24-70mm f/2.8 Lens and Accessory Kit","sku":"1443776","price":"4,196.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a7 III Mirrorless Digital Camera with 24-70mm f/2.8 Lens and Accessory Kit featuring FE 24-70mm f/2.8 GM Lens, Memory Card Spare Battery. Review Sony A7 III","long_description":"Distinguished by its updated sensor design, the Alpha a7 III Mirrorless Digital Camera from Sony is a well-rounded camera suitable for both photo and video applications in a variety of working situations. Refined for improved speed and low-light performance, the full-frame 24.2MP Exmor R BSI CMOS sensor and BIONZ X image processor pair to realize an impressive 10 fps continuous shooting rate and improved autofocus performance for faster, more reliable subject tracking along with wide frame coverage. This updated Fast Hybrid AF System employs a combination of 693 phase-detection points and 425 contrast-detection areas for quicker acquirement of focus in a variety of lighting conditions, and also maintains focus on subjects more effectively. In addition to speed and AF, the processing improvements also help to realize greater image clarity and reduced noise throughout the sensitivity range from ISO 100-51200, which can further be expanded to ISO 50-204800. Video recording capabilities have also been extended for enhanced quality when recording UHD 4K video with the full width of the full-frame sensor to minimize moiré and aliasing. Additionally, benefitting both stills and video operation, the a7 III utilizes a 5-axis SteadyShot INSIDE sensor-shift image stabilization, which is now effective to minimize the appearance of camera shake by up to 5 stops.Beyond just updates to the imaging system, the a7 III's body design has also been revised to include a rear 3.0\" 922k-dot touchscreen LCD, which has a tilting design to better support working from high and low angles. A 2.36m-dot Tru-Finder OLED EVF is also featured for bright and clear eye-level monitoring. For greater shooting flexibility, dual SD memory card slots are now featured, and a larger NP-FZ100 battery is also employed to achieve up to approximately 710 shots per charge. Suiting the camera's use in trying conditions, the magnesium-alloy chassis and weather-sealing also render the a7 III dust- and moisture-resistant.A fast, standard zoom favored for its versatility, the Sony FE 24-70mm f/2.8 GM is a wide-angle to short telephoto lens designed for E-mount mirrorless cameras. Featuring a constant f/2.8 maximum aperture, this lens maintains consistent performance throughout the zoom range and benefits working in low-light conditions and with selective focus techniques. Complementing the apt light-gathering capabilities is an equally impressive optical design, which incorporates three aspherical elements and two extra-low dispersion elements. One of the aspherical elements features an XA (extreme aspherical) designation, ensuring its refined surface precision and notable ability to minimize spherical aberrations throughout the zoom range. Additionally, a Nano AR Coating has been applied to individual elements to significantly minimize lens flare and ghosting for increased contrast and color neutrality. Pairing a sophisticated optical design and versatile speed, this standard zoom is well-suited for use in a wide array of environments and lighting conditions.Beyond the attributes of the lens system itself, this 24-70mm is also characterized by a Direct Drive SSM (Super Sonic wave Motor) system that provides fast, quiet AF performance as well as responsive manual focus handling. The lens is also dust- and moisture-sealed, to permit working in inclement weather conditions, and nuanced details, such as a focus hold button and rubberized control dials, further the intuitiveness in handling.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The Watson NP-FZ100 Lithium-Ion Battery Pack replaces the Sony NP-FZ100 battery. Plus, the battery has a capacity of 2000mAh, an output power of 7.2V, and 16.4 watt hours.","images":{"0":"eebda9f8426901e3e3f3eb796cc9c893-0.jpg","1":"eebda9f8426901e3e3f3eb796cc9c893-1.jpg","2":"eebda9f8426901e3e3f3eb796cc9c893-2.jpg","3":"eebda9f8426901e3e3f3eb796cc9c893-3.jpg","4":"eebda9f8426901e3e3f3eb796cc9c893-4.jpg"}},"configuration":{},"availability":{"1443776":{"aditional_price":0,"availabile":110}}}
