{"viewData":{"url_key":"panasonic_lumix_dmc_gx85_mirrorless_micro","name":"Panasonic Lumix DMC-GX85 Mirrorless Micro Four Thirds Digital Camera with 12-32mm and 45-150mm Lenses and Accessories Kit (Black)","sku":"1444716","price":"497.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DMC-GX85 Mirrorless Micro Four Thirds Digital Camera with 12-32mm and 45-150mm Lenses and Accessories Kit (Black) featuring Lumix G Vario 12-32mm f/3.5-5.6 Lens, Lumix G Vario 45-150mm f/4-5.6 Lens Memory Card. Review Panasonic DMC-GX85","long_description":"An all-around Micro Four Thirds camera designed for photographers and videographers, the black Lumix DMC-GX85 from Panasonic features a compact build and intuitive layout, along with a feature-set to suit a multimedia lifestyle. Utilizing a 16MP Live MOS sensor, which lacks an optical low-pass filter for increased sharpness, the GX85 is capable of shooting continuously at up to 10 fps with single-shot autofocus, or 6 fps with continuous autofocus, as well as up to 40 fps when using an electronic shutter function. UHD 4K video recording is also supported in 30 and 24 fps frame rates, as well as Full HD 1080p, and the 4K recording abilities also permit shooting 8MP stills at a 30 fps rate. A sensitivity range up to ISO 25600 permits working in difficult and low-light settings while 5-axis sensor-shift image stabilization also helps to minimize the appearance of camera shake for sharper handheld shooting. Spanning a broad range of features for both still and moving images, the GX85 is a versatile mirrorless camera further characterized by its sleek form factor and connected functionality. Complementing the imaging attributes, the camera also incorporates both a 2.76m-dot electronic viewfinder as well as a 3.0\" 1.04m-dot touchscreen LCD, which has a tilting design to better enable working from high and low angles. Built-in Wi-Fi is also integrated into the design, which facilitates wireless image transferring and remote camera control from linked smartphones or tablets.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.Store, transport, and protect your DSLR with attached lens, 2-4 extra lenses, flash, and related accessories with the black Kontrast DSLR Shoulder Bag from Case Logic. The padded main compartment has a hammock system that suspends the camera for improved shock protection, and padded, touch-fastening dividers for organizing gear. Water-resistant DuraBase, foam padding, and polyester construction ensures strength and durability. The lid unzips away from wearer for easy access to gear, and has a convenient zip pocket underneath for small items. Dual, zippered side and front pockets provide additional storage capacity. The front pocket features two slip-in pockets. Carry your Kontrast Shoulder Bag with the padded top handle, or wear with the removable, padded shoulder strap. The gray interior lining makes finding gear in low light easier.The 37mm 95-UVAT UV Filter is one of Chiaro’s highly-rated protective UV filters with 95% light transmission. It’s useful for photographers of all levels who demand high-quality glass and other essential features for great image fidelity and construction.","images":{"0":"8f853a9b69b8b27554928a872e4f1c37-0.jpg","1":"8f853a9b69b8b27554928a872e4f1c37-1.jpg","2":"8f853a9b69b8b27554928a872e4f1c37-2.jpg","3":"8f853a9b69b8b27554928a872e4f1c37-3.jpg","4":"8f853a9b69b8b27554928a872e4f1c37-4.jpg"}},"configuration":{},"availability":{"1444716":{"aditional_price":0,"availabile":810}}}
