{"viewData":{"url_key":"leica_19116_d_lux_7_digital_camera","name":"Leica D-Lux 7 Digital Camera","sku":"1445092","price":"1,195.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Leica D-Lux 7 Digital Camera featuring 17MP Four Thirds MOS Sensor, DC Vario-Summilux 3.1x Zoom Lens 24-75mm (35mm Equivalent). Review Leica D-Lux 7","long_description":"Poised as the ideal pocket camera, the Leica D-Lux 7 is a svelte, compact camera characterized by its large sensor design, versatile lens, and sleek styling. The 17MP Four Thirds MOS sensor offers impressive performance with a sensitivity range up to ISO 25600 along with an 11-fps continuous shooting rate and UHD 4K30p video recording to suit multimedia shooting applications in a variety of conditions. Balancing the imaging capabilities is a flexible DC Vario-Summilux lens, which offers a 24-75mm equivalent focal length range along with a bright f/1.7-2.8 design for controlling depth of field and working in difficult lighting conditions. This lens also utilizes optical image stabilization to minimize the appearance of camera shake in order to realize sharper handheld imagery.Complementing the sensor and lens attributes is a travel-friendly physical design, which incorporates both a 2.76m-dot electronic viewfinder and a 3.0\" 1.24m-dot rear touchscreen LCD. These assets are backed up by built-in Bluetooth and Wi-Fi, which work in conjunction with the Leica FOTOS app for seamless wireless sharing as well as remote camera control from a linked iOS or Android device.","images":{"0":"c7ff1ccac645c187d339110f9b1e1812-0.jpg","1":"c7ff1ccac645c187d339110f9b1e1812-1.jpg","2":"c7ff1ccac645c187d339110f9b1e1812-2.jpg","3":"c7ff1ccac645c187d339110f9b1e1812-3.jpg","4":"c7ff1ccac645c187d339110f9b1e1812-4.jpg","5":"c7ff1ccac645c187d339110f9b1e1812-5.jpg","6":"c7ff1ccac645c187d339110f9b1e1812-6.jpg","7":"c7ff1ccac645c187d339110f9b1e1812-7.jpg","8":"c7ff1ccac645c187d339110f9b1e1812-8.jpg"}},"configuration":{},"availability":{"1445092":{"aditional_price":0,"availabile":872}}}
