{"viewData":{"url_key":"sony_alpha_a7r_iii_mirrorless","name":"Sony Alpha a7R III Mirrorless Digital Camera Body with Accessories Kit","sku":"1445149","price":"2,798.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a7R III Mirrorless Digital Camera Body with Accessories Kit featuring Memory Card, Spare Battery Camera Bag. Review Sony A7R III","long_description":"Proving that speed, resolution, and video capabilities can all coexist, the Alpha a7R III Mirrorless Digital Camera from Sony is a versatile, high-performance camera characterized by not only its resolution, but by its multimedia versatility. Revolving around a full-frame 42.4MP Exmor R BSI CMOS sensor and updated BIONZ X image processor, the a7R III affords an impressive 10 fps continuous shooting rate along with improved autofocus performance for faster, more reliable subject tracking along with wide frame coverage. This updated Fast Hybrid AF System employs a combination of 399 phase-detection points and 425 contrast-detection areas for quicker acquirement of focus in a variety of lighting conditions, and also maintains focus on subjects more effectively. In addition to speed and AF, the processing improvements also help to realize greater image clarity throughout the sensitivity range from ISO 100-32000, which can further be expanded to ISO 50-102400. Video recording capabilities have also been extended for enhanced quality when recording UHD 4K video with the full width of the full-frame sensor, or when using a Super35 area and 5K oversampling to minimize moiré and aliasing. Additionally, benefitting both stills and video operation, the a7R III retains the 5-axis SteadyShot INSIDE sensor-shift image stabilization, which is now effective to minimize the appearance of camera shake by up to 5.5 stops.In addition to imaging updates, the a7R III also sports a revised body design, which includes a 3.69m-dot Tru-Finder OLED electronic viewfinder for bright, clear, and realistic eye-level monitoring. A rear 3.0\" 1.44m-dot tilting touchscreen LCD is also available for intuitive settings control and to better support working from high and low angles. For greater shooting flexibility, dual SD memory card slots are now featured, and a larger NP-FZ100 battery is also employed to achieve up to approximately 530 shots per charge when using the viewfinder. Suiting the camera's use in trying conditions, the magnesium alloy chassis and extensive weather-sealing also render the a7R III dust- and moisture-resistanceThe Watson NP-FZ100 Lithium-Ion Battery Pack replaces the Sony NP-FZ100 battery. Plus, the battery has a capacity of 2000mAh, an output power of 7.2V, and 16.4 watt hours.Designed for the photographer, traveler, urban commuter, and everyone in between, the ash Everyday Messenger 13\" Version 1 from Peak Design showcases smart features to meet your day-to-day needs. The Messenger holds a full-frame DSLR and up to two lenses, thanks to the two origami-inspired adjustable touch-fastening padded dividers. Simply remove the dividers if you prefer to carry books or overnight essentials. Your up to 13\" laptop can be stored separately in a rear, padded compartment with an interior sleeve for your tablet or important documents.  Smaller accessories like extra batteries, memory cards, or even a smartphone can be tucked inside the expandable front access panel featuring color-coded stitching to help you further organize gear. An interior slip pocket is suitable for a passport or extra cash when traveling. Additional small items can be stored in the slim zippered pocket under the messenger flap or in one of the two side slip pockets. Keys can be kept handy thanks to the hidden key/ID tether with an anchor link connector in one of the side pockets.  Inclement weather is not to be feared thanks to the weatherproof waxed 500D Kodra synthetic canvas padded shell and DWR undercoat. Exterior zippers are weatherproof, and stress points are reinforced and bar-tacked. A soft yet durable poly-cotton interior is gentle on your gear, and strap ends are tucked away into the sidewalls of the messenger.  The MagLatch adjustable latching system allows your bag to expand and contract without losing shape or sacrificing time transferring contents into another bag. A magnetic clasp and four ladder locking points create multiple options for you to secure your gear. Two dedicated capture clip attachment points and a top zippered opening allow for quick camera access. The 2\" wide messenger strap easily converts into a low-slung shoulder strap, while a stabilizer strap can be worn cross-body for better weight distribution, or as a trolley strap for convenient coupling when traveling with rolling luggage.Designed for SD devices that can capture Full HD, 3D, and 4K video, as well as raw and burst photography, the 64GB Extreme PRO UHS-I SDXC Memory Card from SanDisk has a capacity of 64GB, is compatible with the UHS-I bus, and features a speed class rating of V30, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 standard, this card also supports the U3 standard, which likewise guarantees minimum write speeds of 30 MB/s. Read speeds are supported up to 170 MB/s and write speeds max out at 90 MB/s. A built-in write-protect switch helps to safeguard against the accidental erasure of card data. While this card has been designed for cameras that are UHS-I / V30 / U3 compatible, it may be used in devices that do not support UHS-I / V30 / U3. However, bear in mind that this card will then default to your device's speed class and bus rating, such as UHS-I and U1, which supports minimum write speeds of 10 MB/s, or Class 10, which also supports minimum write speeds of 10 MB/s. As with most SanDisk cards, this memory card is shockproof, X-ray proof, waterproof, while also being able to withstand temperatures from -13 to 185°F, allowing you to take this card with you into extreme environments, such as snow, deserts, and pools. Should the card's data become compromised, you also benefit from the option to download RescuePRO Deluxe software as well as a limited lifetime warranty.","images":{"0":"4cfd71343a46042e64f306ba9447f9da-0.jpg","1":"4cfd71343a46042e64f306ba9447f9da-1.jpg","2":"4cfd71343a46042e64f306ba9447f9da-2.jpg","3":"4cfd71343a46042e64f306ba9447f9da-3.jpg","4":"4cfd71343a46042e64f306ba9447f9da-4.jpg"}},"configuration":{},"availability":{"1445149":{"aditional_price":0,"availabile":607}}}
