{"viewData":{"url_key":"sony_alpha_a9_mirrorless_digital","name":"Sony Alpha a9 Mirrorless Digital Camera Body and Flash Kit","sku":"1446083","price":"3,498.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a9 Mirrorless Digital Camera Body and Flash Kit featuring On-Camera Flash, Memory Card. Review Sony A9","long_description":"Bringing the speed Sony mirrorless shooters have been waiting for, the Alpha a9 Mirrorless Digital Camera takes impressive multimedia capabilities and ups the processing capabilities for ultra-fast continuous shooting. Making use of a 24.2MP full-frame Exmor RS stacked CMOS sensor and BIONZ X image processor, the a9 is capable of shooting at up to 20 fps, recording UHD 4K video internally, and shooting with an expanded sensitivity range to ISO 204,800. Balancing the quickness of the processor is a well-matched 693-point phase-detection autofocus system that covers 93% of the image area for accurate and quick subject tracking in a variety of lighting conditions. Additionally, complementing both the imaging and focusing assets, the a9 also sports 5-axis SteadyShot INSIDE image stabilization to minimize the appearance of camera shake when shooting handheld.Matching its professional imaging capabilities is a well-rounded physical construction that is fully weather-sealed for use in trying environmental conditions. For clear, uncompromised viewing, a quad-VGA OLED Tru-Finder is featured with an impressive 3.686m-dot resolution and 120 fps refresh rate for clear, bright, and smooth eye-level viewing. Alternatively, a 3.0\" 1.44m-dot tilting touchscreen LCD is also available to benefit working from high and low angles. Dual SD memory card slots, a customizable menu system, and a variety of physical control dials further round out the camera's intuitive design, and built-in Wi-Fi and Bluetooth enables wireless image sharing and remote camera control from linked mobile devices.Power, speed, and integrated radio transmission make the VING V860IIS TTL Li-Ion Flash Kit from Godox a hard-to-beat option for your Sony cameras. Fully compatible with ADI / P-TTL systems, the V860IIS supports many advanced functions and features. Also, it features the Godox 2.4GHz X wireless radio system which provides both master and slave TTL functionality with a range of up to 328'. On top of this, the flash is powerful and versatile, featuring a guide number of 197' at ISO 100 and 200mm along with a zoom range of 20-200mm, which can be expanded to 14mm with the use of the pull-out panel. And, this flash runs off a rechargeable Li-ion battery pack, that ensures fast recharge and long-lasting shoots.  For general operation, the V860IIS features full bounce flash capabilities, including tilting from -7 to 90° and rotation left and right 180°. As a ADI / P-TTL-compatible unit, this flash offers support for high-speed sync, flash exposure compensation, 1st and 2nd curtain sync, and much more. Additionally, it can function as an optical master or slave unit if needed.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.","images":{"0":"076224635b355dda8a2ea3e8625883c5-0.jpg","1":"076224635b355dda8a2ea3e8625883c5-1.jpg","2":"076224635b355dda8a2ea3e8625883c5-2.jpg","3":"076224635b355dda8a2ea3e8625883c5-3.jpg"}},"configuration":{},"availability":{"1446083":{"aditional_price":0,"availabile":875}}}
