{"viewData":{"url_key":"sony_cyber_shot_dsc_rx100_iii_digital","name":"Sony Cyber-shot DSC-RX100 III Digital Camera with Accessories Kit","sku":"1447050","price":"748.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Cyber-shot DSC-RX100 III Digital Camera with Accessories Kit featuring Memory Card, Camera Case External Battery Charger. Review Sony DSC-RX100 III","long_description":"The Sony Cyber-shot DSC-RX100 III Digital Camera is a versatile and advanced point-and-shoot featuring a large 20.1 megapixel 1\" Exmor R CMOS sensor to produce high-resolution still imagery and full HD video. This sensor's design utilizes backside-illuminated technology to improve clarity and image quality when working in dimly-lit conditions as well as increase the sensitivity to a native ISO 12800. Benefitting the performance of this sensor is the BIONZ X image processor, which helps to produce images with smooth quality and tonal gradations as well as provide expedited performance throughout all aspects of the camera, including a continuous shooting rate of 10 fps in Speed Priority mode, shutter release lag of 0.008 sec., and XAVC S movie recording at 50 Mbps.The built-in Zeiss Vario-Sonnar T* 2.9x zoom lens provides a 35mm-equivalent focal length range of 24-70mm, covering wide-angle to portrait-length perspectives to suit working in a wide variety of environments. An f/1.8-2.8 maximum aperture benefits working in low lighting and controlling focus throughout the zoom range. Optical SteadyShot image stabilization is also available to help minimize the appearance of camera shake when working in dimly-lit conditions and with greater zoom magnifications. Furthermore, a built-in three-stop ND filter is incorporated into the camera's design to suit shooting in bright conditions with wider apertures and for greater control over how movement is depicted. The lens also features a Zeiss T* anti-reflective coating, which helps to reduce surface reflections, lens flare, and ghosting in order to produce imagery that is rich in contrast and clarity.Complementing the imaging capabilities of the RX100 III is a sleek body design featuring both an electronic viewfinder and a tilting LCD screen. The 0.39\" 1,440k-dot SVGA OLED Tru-Finder has Zeiss T*-coated optics and provides a bright, clear means for eye-level viewing. It features a unique pop-up mechanism that helps to maintain the compact form factor of the camera when carrying or if preferring to work with the rear screen. The 3.0\" 1,229k-dot Xtra Fine LCD incorporates WhiteMagic technology for easier visibility in bright conditions and its tilting design permits greater usability from high, low, and front-facing angles. Furthermore, built-in Wi-Fi connectivity with NFC allows instant image sharing to, as well as remote camera control and monitoring from, linked mobile devices.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.The HFV-250 Protective Camera Case from Ruggard is a semi-hard shell case that can hold your digital point-and-shoot camera or smartphone. The tough outer shell protects the contents from bumps, abrasions, and incidental contact while the inside, with its softer lining, will be gentle on the screen and finish of your camera.Charge any Sony NP-BX1 type lithium-ion battery with this dedicated Compact AC/DC Charger from Pawa. It runs on 100-240 VAC power, allowing for worldwide use, and features a folding, 2-prong North American plug. Additionally, the charger includes a European plug adapter and a 12 VDC vehicle adapter that plugs into a cigarette lighter port--making it ideal for use both at home and on the road.","images":{"0":"c89a6a517c97b40ef3e582569f500fb9-0.jpg","1":"c89a6a517c97b40ef3e582569f500fb9-1.jpg","2":"c89a6a517c97b40ef3e582569f500fb9-2.jpg","3":"c89a6a517c97b40ef3e582569f500fb9-3.jpg","4":"c89a6a517c97b40ef3e582569f500fb9-4.jpg"}},"configuration":{},"availability":{"1447050":{"aditional_price":0,"availabile":902}}}
