{"viewData":{"url_key":"olympus_v201080bu000_om_d_e_m1x_mirrorless_micro","name":"Olympus OM-D E-M1X Mirrorless Digital Camera (Body Only)","sku":"1450952","price":"2,999.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Olympus EM1X Mirrorless Digital Camera (OM-D E-M1X Camera Body) featuring 20.4MP Live MOS Micro Four Thirds Sensor, Dual TruePic VIII Image Processors.","long_description":"Focused on reliability, speed, and versatility, the Olympus OM-D E-M1X is a Micro Four Thirds mirrorless camera offering a broad range of photo and video capabilities to satisfy the professional shooter's needs. Featuring a high-resolution 20.4MP Live MOS sensor and dual TruePic VIII image processors, the E-M1X is characterized by its quick continuous shooting, up to 60 fps with an electronic shutter and 15 fps with a mechanical shutter, as well as DCI and UHD 4K video recording. The sensor and processors also offer a sensitivity range up to ISO 25600 while a sophisticated 5-axis sensor-shift image stabilization system compensates for up to 7.5 stops of camera shake for sharper handheld shooting. Beyond just imaging, the sensor's design also incorporates 121 on-chip phase-detection points, all of which are cross-type, along with 121 contrast-detection areas for fast and precise focusing and subject tracking performance.Distinguishing itself further, the E-M1X is also the first Micro Four Thirds camera to feature an integrated vertical grip for improved ergonomics and handling regardless of shooting in horizontal or vertical orientation. This grip also allows for two batteries to be used at a time, for longer shooting sessions. The durable magnesium-alloy body is further characterized by its extensive weather-sealing to support working in harsh climates, and both a 2.36m-dot, 0.83x-magnification electronic viewfinder and 3.0\" 1.037m-dot vari-angle LCD touchscreen are featured, too, for intuitive control and working from a variety of angles. Additionally, built-in Wi-Fi and Bluetooth further expand sharing and remote shooting capabilities, and dual SD card slots and a USB 3.0 Type-C port expand file saving and tethered shooting capabilities.","images":{"0":"b29aef6a9ebfc4649675c3c103485059-0.jpg","1":"b29aef6a9ebfc4649675c3c103485059-1.jpg","2":"b29aef6a9ebfc4649675c3c103485059-2.jpg","3":"b29aef6a9ebfc4649675c3c103485059-3.jpg","4":"b29aef6a9ebfc4649675c3c103485059-4.jpg","5":"b29aef6a9ebfc4649675c3c103485059-5.jpg","6":"b29aef6a9ebfc4649675c3c103485059-6.jpg","7":"b29aef6a9ebfc4649675c3c103485059-7.jpg","8":"b29aef6a9ebfc4649675c3c103485059-8.jpg","9":"b29aef6a9ebfc4649675c3c103485059-9.jpg","10":"b29aef6a9ebfc4649675c3c103485059-10.jpg","11":"b29aef6a9ebfc4649675c3c103485059-11.jpg","12":"b29aef6a9ebfc4649675c3c103485059-12.jpg","13":"b29aef6a9ebfc4649675c3c103485059-13.jpg","14":"b29aef6a9ebfc4649675c3c103485059-14.jpg","15":"b29aef6a9ebfc4649675c3c103485059-15.jpg","16":"b29aef6a9ebfc4649675c3c103485059-16.jpg","17":"b29aef6a9ebfc4649675c3c103485059-17.jpg","18":"b29aef6a9ebfc4649675c3c103485059-18.jpg","19":"b29aef6a9ebfc4649675c3c103485059-19.jpg","20":"b29aef6a9ebfc4649675c3c103485059-20.jpg","21":"b29aef6a9ebfc4649675c3c103485059-21.jpg","22":"b29aef6a9ebfc4649675c3c103485059-22.jpg","23":"b29aef6a9ebfc4649675c3c103485059-23.jpg","24":"b29aef6a9ebfc4649675c3c103485059-24.jpg","25":"b29aef6a9ebfc4649675c3c103485059-25.jpg","26":"b29aef6a9ebfc4649675c3c103485059-26.jpg","27":"b29aef6a9ebfc4649675c3c103485059-27.jpg","28":"b29aef6a9ebfc4649675c3c103485059-28.jpg","29":"b29aef6a9ebfc4649675c3c103485059-29.jpg"}},"configuration":{},"availability":{"1450952":{"aditional_price":0,"availabile":746}}}
