{"viewData":{"url_key":"sony_ilce_6400m_b_alpha_a6400_mirrorless_digital","name":"Sony Alpha a6400 Mirrorless Digital Camera with 18-135mm Lens","sku":"1453771","price":"1,298.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Alpha a6400 Mirrorless Digital Camera with 18-135mm Lens featuring 24.2MP APS-C Exmor CMOS Sensor, Real-Time Eye AF &amp; Real-Time Tracking XGA Tru-Finder 2.36m-Dot OLED EVF. Review Sony A6400","long_description":"Stable, fast, versatile, and compact, the Alpha a6400 from Sony is an APS-C-format mirrorless camera that adopts many of the features normally reserved for their full-frame lineup. This includes an autofocus acquisition of 0.02 seconds, Real-time Eye AF and Real-time Tracking capabilities, high-speed shooting up to 11 fps and silent shooting up to 8 fps, both with AF/AE tracking, an upgraded BIONZ X image processing engine, an LCD touchscreen that tilts 180째 up and 74째 down, UHD 4K movie recording with full pixel readout and no pixel binning, internal recording for time-lapse videos, and more.The a6400 is well-suited for both photo and video creators, ranging from professionals to vloggers. Revolving around a 24.2MP Exmor CMOS sensor and BIONZ X image processor, clean image quality is provided with a wide expandable sensitivity range of ISO 100 to 102400, along with accelerated readout speeds for internal 4K24 and Full HD 1080p120 video recording with full pixel readout. The processor further benefits videographers with the inclusion of an S&Q (Slow & Quick) Motion setting that permits capturing Full HD video at a variety of frame rates ranging from 1-120 fps, plus HLG (Hybrid Log-Gamma), which supports HDR workflows, and both S-Log2 and S-Log3 for color grading flexibility. Stills shooters also benefit from the processing speed, which enables continuous shooting at 11 fps for up to 116 JPEGs, 46 raw images, or 44 raw and JPEG frames in a burst, as well as 14-bit raw file output. The sensor and processor combination also avail 4D FOCUS, with a wide-coverage 425-point phase-detection system that covers around 84% of the image area, and a 425-point contrast-detection system, both of which provide quick and precise focusing performance. This focusing system also enables Real-time Eye AF, which delivers improved accuracy, speed, and tracking performance of Eye AF, so the eyes of your subject are automatically detected. Furthermore, Real-time Tracking uses AI-based object recognition and processes color, subject distance (depth), and pattern (brightness) as spatial information to ensure that all subjects can be captured with accuracy. Increasingly versatile and fully featured in both photo and video realms, the a6400 is a fast and precise imaging tool for multimedia capture.Complementing the imaging assets, the a6400 sports a robust magnesium-alloy body with sealed buttons and dials to help keep out dust and moisture, plus anti-dust functionality that protects the optical filter. The compact profile incorporates a high-resolution XGA Tru-Finder 2.36m-dot OLED electronic viewfinder for bright, clear, eye-level viewing, and this EVF features a 120 fps viewing mode for smooth tracking of fast-moving subjects. A rear 3.0\" 921.6k-dot touchscreen TFT LCD monitor is also available and tilts 180째 up and 74째 down to benefit shooting from high and low working angles. The touchscreen design also allows for intuitive touch-to-focus control. Additionally, for wireless remote control over the camera, or for just sharing imagery online, built-in Wi-Fi with NFC permits linking with a mobile device for intuitive wireless control.Spanning a useful wide-angle to medium telephoto range, the E 18-135mm f/3.5-5.6 OSS from Sony is a versatile 27-202.5mm equivalent zoom for APS-C-format E-mount mirrorless cameras. Complementing the range of focal lengths is an Optical SteadyShot image stabilization system, which minimizes the appearance of camera shake for sharper handheld shooting. Also helping to produce sharper imagery is a linear autofocus motor, which delivers quick and accurate focusing performance that is also quiet to suit video recording applications. Balancing with the handling attributes, this lens also sports an intelligent optical design that uses both extra-low dispersion glass and aspherical elements to control spherical and chromatic aberrations for high sharpness and clarity throughout the zoom range.","images":{"0":"9cf73411dce2cb9d99f8fc749ca44a0a-0.jpg","1":"9cf73411dce2cb9d99f8fc749ca44a0a-1.jpg","2":"9cf73411dce2cb9d99f8fc749ca44a0a-2.jpg","3":"9cf73411dce2cb9d99f8fc749ca44a0a-3.jpg","4":"9cf73411dce2cb9d99f8fc749ca44a0a-4.jpg","5":"9cf73411dce2cb9d99f8fc749ca44a0a-5.jpg","6":"9cf73411dce2cb9d99f8fc749ca44a0a-6.jpg","7":"9cf73411dce2cb9d99f8fc749ca44a0a-7.jpg","8":"9cf73411dce2cb9d99f8fc749ca44a0a-8.jpg","9":"9cf73411dce2cb9d99f8fc749ca44a0a-9.jpg","10":"9cf73411dce2cb9d99f8fc749ca44a0a-10.jpg","11":"9cf73411dce2cb9d99f8fc749ca44a0a-11.jpg","12":"9cf73411dce2cb9d99f8fc749ca44a0a-12.jpg","13":"9cf73411dce2cb9d99f8fc749ca44a0a-13.jpg","14":"9cf73411dce2cb9d99f8fc749ca44a0a-14.jpg"}},"configuration":{},"availability":{"1453771":{"aditional_price":0,"availabile":569}}}
