{"viewData":{"url_key":"panasonic_dc_s1rmk_lumix_dc_s1r_mirrorless_digital","name":"Panasonic Lumix DC-S1R Mirrorless Digital Camera with 24-105mm Lens","sku":"1455068","price":"4,597.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-S1R Mirrorless Digital Camera with 24-105mm Lens featuring 47.3MP Full-Frame MOS Sensor, Venus Engine Image Processor 5.76m-Dot 0.78x-Magnification OLED LVF. Review Panasonic DC-S1R","long_description":"Panasonic's high-resolution entry into the full-frame mirrorless world, the Lumix DC-S1R pairs impressive and versatile imaging capabilities with a durable physical construction. The hallmark of the S1R is its full-frame 47.3MP MOS sensor, which is paired with a Venus Engine, to produce detailed, high dynamic range stills along with video recording up to 4K60p. The sensor's design omits a traditional low-pass filter in order to achieve the greatest sharpness and on-chip aspherical micro lenses promote greater sensitivity, light condensation, and color response. Additionally, the sensor and processor work to achieve a top expanded sensitivity of ISO 51200 along with quick 9 fps continuous shooting rate. Complementing both stills and video capabilities, the image sensor also utilizes an advanced DFD contrast-detection autofocus system for quick and precise focusing and subject tracking. Additionally, sensor-shift image stabilization helps to minimize the appearance of camera shake by 5.5 stops for sharper handheld shooting.Beyond the imaging attributes, the S1R is also distinguished by its body design, which incorporates an impressively high resolution 5.76m-dot OLED electronic viewfinder along with a 3.2\" 2.1m-dot triaxial tilt touchscreen LCD. The magnesium-alloy body is weather-sealed to permit working in harsh conditions and has a top status LCD for reviewing shooting settings on the fly. XQD and SD card slots offer flexible storage capabilities and Bluetooth and Wi-Fi connectivity afford remote camera control along with wireless image transferring to tablets and smartphones.","images":{"0":"82e97a08a181a8bcce0068def466133a-0.jpg","1":"82e97a08a181a8bcce0068def466133a-1.jpg","2":"82e97a08a181a8bcce0068def466133a-2.jpg","3":"82e97a08a181a8bcce0068def466133a-3.jpg","4":"82e97a08a181a8bcce0068def466133a-4.jpg","5":"82e97a08a181a8bcce0068def466133a-5.jpg","6":"82e97a08a181a8bcce0068def466133a-6.jpg","7":"82e97a08a181a8bcce0068def466133a-7.jpg","8":"82e97a08a181a8bcce0068def466133a-8.jpg","9":"82e97a08a181a8bcce0068def466133a-9.jpg","10":"82e97a08a181a8bcce0068def466133a-10.jpg"}},"configuration":{},"availability":{"1455068":{"aditional_price":0,"availabile":373}}}
