{"viewData":{"url_key":"panasonic_dc_s1body_lumix_dc_s1_mirrorless_digital","name":"Panasonic Lumix DC-S1 Mirrorless Digital Camera (Body Only)","sku":"1455066","price":"2,497.99","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Panasonic Lumix DC-S1 Mirrorless Digital Camera (S1 Camera Body) featuring 24.2MP Full-Frame MOS Sensor, Venus Engine Image Processor.","long_description":"As part of Panasonic's entry into full-frame mirrorless, the Lumix DC-S1 is a well-rounded camera offering advanced feature-sets for both stills and video, along with a robust physical construction. Characterized by its full-frame 24.2MP MOS sensor, which is supported by an updated Venus Engine, the S1 offers impressive image quality along with a quick 9 fps shooting rate and expanded sensitivity range up to ISO 204800. In regard to video, the S1 can record UHD 4K30p with full-pixel readout, 4:2:0 10-bit color, and unlimited shooting times, as well as 4K60p for up to 29:59. HDR video recording is possible using the dedicated Hybrid Log Gamma mode, and a firmware update will be available to add 4:2:2 10-bit internal recording along with V-Log. Complementing both stills and video capabilities, the image sensor also utilizes an advanced DFD contrast-detection autofocus system for quick and precise focusing and subject tracking. Additionally, sensor-shift image stabilization helps to minimize the appearance of camera shake by 5.5 stops for sharper handheld shooting.Beyond the imaging attributes, the S1 is also distinguished by its body design, which incorporates an impressively high resolution 5.76m-dot OLED electronic viewfinder along with a 3.2\" 2.1m-dot triaxial tilt touchscreen LCD. The magnesium-alloy body is weather-sealed to permit working in harsh conditions and has a top status LCD for reviewing shooting settings on the fly. XQD and SD card slots offer flexible storage capabilities and Bluetooth and Wi-Fi connectivity afford remote camera control along with wireless image transferring to tablets and smartphones.","images":{"0":"9e779ee5351477676ff802481066b39a-0.jpg","1":"9e779ee5351477676ff802481066b39a-1.jpg","2":"9e779ee5351477676ff802481066b39a-2.jpg","3":"9e779ee5351477676ff802481066b39a-3.jpg","4":"9e779ee5351477676ff802481066b39a-4.jpg","5":"9e779ee5351477676ff802481066b39a-5.jpg","6":"9e779ee5351477676ff802481066b39a-6.jpg","7":"9e779ee5351477676ff802481066b39a-7.jpg","8":"9e779ee5351477676ff802481066b39a-8.jpg","9":"9e779ee5351477676ff802481066b39a-9.jpg","10":"9e779ee5351477676ff802481066b39a-10.jpg"}},"configuration":{},"availability":{"1455066":{"aditional_price":0,"availabile":214}}}
