{"viewData":{"url_key":"fujifilm_x_t30_mirrorless_digital_camera","name":"FUJIFILM X-T30 Mirrorless Digital Camera (Body Only, Black)","sku":"1459274","price":"899.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy FUJIFILM X-T30 Mirrorless Digital Camera (Fuji XT30 Camera Body, Black) features 26.1MP APS-C X-Trans BSI CMOS 4 Sensor, X-Processor 4 with Quad CPU.","long_description":"Pairing impressive imaging capabilities with an especially compact design, the black FUJIFILM X-T30 is a versatile mirrorless camera distinguished by advanced stills and video recording along with sleek and intuitive handling characteristics. Featuring a revised image sensor and processor, both high-resolution stills and 4K video can be recorded while an apt autofocus system delivers quick and accurate focusing performance. The sensor, a 26.1MP APS-C-format X-Trans CMOS 4, features a back-illuminated design, to promote greater image quality throughout the sensitivity range, along with a 425-point phase-detection autofocus system for quick, precise AF performance and subject tracking. Complementing the imaging and focusing is the X-Processor 4, which uses four CPUs for faster image processing as well as continuous shooting up to 8 fps with a mechanical shutter, 30 fps shooting at a 1.25x crop and electronic shutter, and internal DCI/UHD 4K30 video recording. Sharing a familiar aesthetic of FUJIFILM X-series cameras, the X-T30 sports classically inspired looks, has prominent physical controls, and has a high-resolution 2.36m-dot OLED electronic viewfinder. Conversely, a rear 3.0\" 1.04m-dot tilting touchscreen LCD can also be used for live view shooting and larger image playback. Additionally, the X-T30 also sports built-in Bluetooth for wireless sharing and remote control.","images":{"0":"abff8a9b4c1fd5c4759991a75ee333c0-0.jpg","1":"abff8a9b4c1fd5c4759991a75ee333c0-1.jpg","2":"abff8a9b4c1fd5c4759991a75ee333c0-2.jpg","3":"abff8a9b4c1fd5c4759991a75ee333c0-3.jpg","4":"abff8a9b4c1fd5c4759991a75ee333c0-4.jpg","5":"abff8a9b4c1fd5c4759991a75ee333c0-5.jpg","6":"abff8a9b4c1fd5c4759991a75ee333c0-6.jpg"}},"configuration":{},"availability":{"1459274":{"aditional_price":0,"availabile":390}}}
