{"viewData":{"url_key":"nikon_coolpix_a1000_digital_camera","name":"Nikon COOLPIX A1000 Digital Camera (Black)","sku":"1462786","price":"476.95","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Nikon COOLPIX A1000 Digital Camera (Black) featuring 16MP 1/2.3&quot; BSI CMOS Sensor, NIKKOR Super ED 35x Optical Zoom Lens 24-840mm (35mm Equivalent). Review Nikon A1000","long_description":"Pocketable and versatile, the black Nikon COOLPIX A1000 is a sleek point-and-shoot offering flexible imaging capabilities and a well-rounded physical design. A 16MP BSI CMOS sensor and EXPEED image processing yield high-resolution, well-defined imagery with an ISO 100-6400 sensitivity range and a fast 10 fps shooting rate for photographing moving subjects. UHD 4K video recording is also supported at 30p, along with Full HD recording at up to 60p, and still frames can be pulled from 4K footage for isolating fast-moving moments. Complementing the imaging assets is the impressive 35x Zoom-NIKKOR ED lens, which covers a 24-840mm equivalent focal length range to suit shooting in nearly any situation. Lens-shift VR benefits stills shooting at long focal lengths and with slower shutter speeds, and compensates for the effects of camera shake for up to three stops. Additionally, the A1000 is further characterized by its high-resolution 1.166m-dot electronic viewfinder for eye-level viewing, a rear 3.0\" 1.036m-dot tilting touchscreen LCD, and built-in Wi-Fi and Bluetooth for wireless sharing and remote control.","images":{"0":"d00839d8e115b255e89db2abec5eca34-0.jpg","1":"d00839d8e115b255e89db2abec5eca34-1.jpg","2":"d00839d8e115b255e89db2abec5eca34-2.jpg","3":"d00839d8e115b255e89db2abec5eca34-3.jpg","4":"d00839d8e115b255e89db2abec5eca34-4.jpg","5":"d00839d8e115b255e89db2abec5eca34-5.jpg","6":"d00839d8e115b255e89db2abec5eca34-6.jpg","7":"d00839d8e115b255e89db2abec5eca34-7.jpg","8":"d00839d8e115b255e89db2abec5eca34-8.jpg","9":"d00839d8e115b255e89db2abec5eca34-9.jpg"}},"configuration":{},"availability":{"1462786":{"aditional_price":0,"availabile":754}}}
