{"viewData":{"url_key":"ricoh_gr_iii_digital_camera","name":"Ricoh GR III Digital Camera with GC-9 Soft Case Kit","sku":"1462753","price":"944.90","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Ricoh GR III Digital Camera with GC-9 Soft Case Kit featuring 24.2MP APS-C CMOS Sensor, GR Engine 6 28mm f/2.8 Lens (35mm Equivalent). Review Ricoh ","long_description":"The long-awaited installment in the popular series of fast, compact cameras, the Ricoh GR III continues the legacy of being a pocketable powerhouse, offering impressive image quality, fast response, and immense portability. Featuring a redeveloped imaging feature-set, the GR III incorporates a 24.2MP APS-C CMOS sensor and GR Engine 6 to realize smooth tonality, rich color and high sensitivity from ISO 100-102400, along with the ability to produce high-resolution 14-bit DNG stills or Full HD video. Complementing the sensor design is an updated 28mm-equivalent prime lens, which features a bright f/2.8 design, to suit everyday shooting with a comfortably wide field of view. Additionally, a first for GR, a 3-axis Shake Reduction System compensates for the effects of camera shake to help render sharper handheld shots when working with slower shutter speeds.Physically, the GR III looks familiarly compact, but incorporates a redesigned control scheme to promote a larger, more comfortable grip while maintaining easy access to physical controls. A 3.0\" 1.037m-dot LCD is used for image composition, playback, and menu navigation, and its touchscreen design offers intuitive control along with Touch AF capabilities. Additionally, built-in Bluetooth LE and Wi-Fi can be used to pair with a mobile device for quick, wireless transferring of files to your smartphone or tablet.Dedicated to the Ricoh GR III digital camera, the GC-9 Soft Case is a protective custom-fit case to guard your camera when not in use. It has a single flap with a snap closure to secure the camera in place and its soft design offers protection without being too bulky.","images":{"0":"a57ff1583f12e4857258bacaa0b4d6ee-0.jpg","1":"a57ff1583f12e4857258bacaa0b4d6ee-1.jpg","2":"a57ff1583f12e4857258bacaa0b4d6ee-2.jpg"}},"configuration":{},"availability":{"1462753":{"aditional_price":0,"availabile":263}}}
