{"viewData":{"url_key":"sony_cyber_shot_rx100_vi_digital","name":"Sony Cyber-Shot RX100 VI Digital Camera with Grip Kit","sku":"1463078","price":"1,345.78","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony Cyber-Shot RX100 VI Digital Camera with Grip Kit featuring VCT-SGR1 Shooting Grip, Spare Battery Memory Card. Review Sony DSC-RX100 VI","long_description":"Offering longer reach and improved performance, the Cyber-shot DSC-RX100 VI from Sony is a pocket-sized powerhouse characterized by an impressive lineup of stills and video capabilities. Distinguished in the series by its extended zoom, the RX100 VI sports a 24-200mm-equivalent ZEISS Vario-Sonnar T* lens covering wide-angle to telephoto focal lengths for greater shooting flexibility. Leveraging the most from the updated lens design is the 20.1MP 1\" Exmor RS CMOS sensor, along with an improved BIONZ X image processor, for fast shooting performance to 24 fps, high sensitivity to ISO 12800, and UHD 4K video recording. The sensor's design also provides a 315-point hybrid AF system for quick and accurate focus performance and subject tracking in both stills and video modes. A stacked design and front-end LSI also contribute to quickened operation and enhanced image quality. Video performance has been upgraded through the incorporation of S-Log3 and HLG gamma settings, and High Frame Rate shooting allows you to record at up to 960 fps for slow-motion playback.Even with the integrated 24-200mm, the form factor of the RX100 VI remains nearly as compact as ever, but still without sacrificing on functionality. A pop-up 2.36m-dot OLED electronic viewfinder is a sleek means for eye-level viewing or, alternatively, a 3.0\" 921.6k-dot LCD touchscreen can be used. The LCD features a tilting design to support working from high and low angles and its touch capability permits the use of Touch Focus and Touch Shutter functions. The camera also sports wireless connectivity for sharing imagery to a linked mobile device or for embedding location information from your smartphone.A unique tool to help improve stability, the VCT-SGR1 Shooting Grip from Sony is a flexible accessory that serves as both a larger grip for handheld shooting as well as a sleek tabletop tripod. Designed for select cameras from Sony's RX100, RX0, HX, and WX-series, this grip attaches to cameras via the 1/4\"-20 tripod mount and then connects to the camera using the Multi terminal for on-grip control. Integrated shutter release and video record buttons are featured, as well as a zoom rocker switch, and the grip's head can tilt upward 70° and downward 100° for easier positioning.The NP-BX1/M8 Rechargeable Lithium-Ion Battery Pack from Sony is designed to replace the original NP-BX1 battery. It is rated at 3.6V and features a capacity of 1240mAh.Built to meet the demands of photographers and passionate shutterbugs who are using advanced cameras and HD camcorders, the 32GB Extreme UHS-I SDHC Memory Card  from SanDisk allows users to take advantage of functions such as fast action shots, continuous burst mode, and multiple frames per second. It features a capacity of 32GB, is compatible with the UHS-I bus, and delivers maximum read speeds of up to 90 MB/s and maximum write speeds of up to 40 MB/s. This Extreme UHS-I SDHC card supports the V30 speed class, which guarantees minimum write speeds of 30 MB/s. If your device does not support the V30 speed class, this card also supports the U3 speed class, which likewise guarantees minimum write speeds of 30 MB/s. If your device only supports the Class 10 standard, minimum write speeds are guaranteed not to drop below 10 MB/s. Built for extreme conditions, SanDisk's 32GB Extreme UHS-I SDHC Memory Card is water, shock, and x-ray proof, while also being able to withstand temperatures from -13 to 185°F, allowing for use in environments such as snow and deserts. A built-in write protect switch further helps to safeguard your content, while advanced Error Correction Code engine offers improved data integrity and card reliability during read and write operations. Downloadable RescuePRO data recovery software helps you restore accidentally deleted images. The card also has a writable label on its surface and the included jewel case makes for easy storage and organization. This card is backed by a limited lifetime warranty.","images":{"0":"32ebccba15f0723d792f72052cf8db71-0.jpg","1":"32ebccba15f0723d792f72052cf8db71-1.jpg","2":"32ebccba15f0723d792f72052cf8db71-2.jpg","3":"32ebccba15f0723d792f72052cf8db71-3.jpg","4":"32ebccba15f0723d792f72052cf8db71-4.jpg"}},"configuration":{},"availability":{"1463078":{"aditional_price":0,"availabile":457}}}
