{"viewData":{"url_key":"leica_19050_q2_digital_camera","name":"Leica Q2 Digital Camera","sku":"1464271","price":"4,995.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Leica Q2 Digital Camera featuring 47.3MP Full-Frame CMOS Sensor, Maestro II Image Processor.","long_description":"Redeveloped while retaining impressive imaging and optical attributes, the Leica Q2 is an advanced compact camera characterized by its updated sensor design and intuitive operation. Revolving around a revised full-frame 47.3MP CMOS sensor and Maestro II image processor, high-resolution stills shooting is possible along with both DCI and UHD 4K video recording. The image processor also contributes to a broad ISO 50-50000 sensitivity range along with quick 10-fps full-resolution continuous shooting. The added resolution also affords a series of unique Crop Modes, which simulate working with longer focal length lenses, including 35mm, 50mm, and 75mm fields of view.Speaking of the lens, the Q2 features the same impressive wide-angle prime Summilux 28mm f/1.7 ASPH. fixed lens, which has been matched to the sensor design for exceptional resolution and clarity. The lens's design incorporates three aspherical elements and its bright f/1.7 maximum aperture suits working in low-light conditions. Additionally, a macro setting permits working with subjects as close as 6.7\" away.Complementing the imaging and optical assets, the Q2 remains an especially compact and intuitive camera, well-suited for street and travel photography. Its sleek magnesium alloy body is weather-sealed for working in trying environments and it has adopted the same battery featured in the flagship SL mirrorless camera for longer battery life. A high-resolution 3.68MP OLED electronic viewfinder is featured for fluid and clear eye-level monitoring and a rear 3.0\" 1.04m-dot touchscreen LCD also affords straightforward playback and settings control. Built-in Bluetooth LE and Wi-Fi permit wireless sharing and remote camera control from a linked mobile device via the Leica FOTOS app.","images":{"0":"7cb7d4ac537b3b17b5662347167b3d17-0.jpg","1":"7cb7d4ac537b3b17b5662347167b3d17-1.jpg","2":"7cb7d4ac537b3b17b5662347167b3d17-2.jpg","3":"7cb7d4ac537b3b17b5662347167b3d17-3.jpg","4":"7cb7d4ac537b3b17b5662347167b3d17-4.jpg","5":"7cb7d4ac537b3b17b5662347167b3d17-5.jpg","6":"7cb7d4ac537b3b17b5662347167b3d17-6.jpg","7":"7cb7d4ac537b3b17b5662347167b3d17-7.jpg","8":"7cb7d4ac537b3b17b5662347167b3d17-8.jpg","9":"7cb7d4ac537b3b17b5662347167b3d17-9.jpg","10":"7cb7d4ac537b3b17b5662347167b3d17-10.jpg","11":"7cb7d4ac537b3b17b5662347167b3d17-11.jpg"}},"configuration":{},"availability":{"1464271":{"aditional_price":0,"availabile":577}}}
