{"viewData":{"url_key":"sony_dsc_rx0ii_cyber_shot_dsc_rx0_ii_digital","name":"Sony Cyber-shot DSC-RX0 II Digital Camera","sku":"1469682","price":"698.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Buy Sony RX0 II Digital Camera DSC-RX0 II features 15.3MP 1\" ; Exmor RS Stacked CMOS Sensor, ZEISS Tessar T* 24mm Equivalent f/4 Lens.","long_description":"Sony has worked wonders with the Cyber-shot DSC-RX0 II, creating a premium, ultra-compact, and tough camera with an outstanding feature set for both stills and video. This form factor makes it ideal for travel and everyday life while the 15.3MP 1\" Exmor RS stacked CMOS sensor and BIONZ X image processor ensure your images are of the highest quality. Also, this model offers internal UHD 4K30 video recording, electronic image stabilization for movies, and a 1.5\" 230k-dot 180° tilting LCD that is perfect for selfies and vlogging. Beyond that, the RX0 II can handle adverse conditions with ease, being waterproof to 33', dustproof, crushproof to 440 lb, and shockproof to 6.5'.Image quality is of the utmost importance, and the relatively large 1\"-type sensor benefits from a stacked architecture and dedicated DRAM chip that dramatically speeds up processing and performance. Tied into this system is the BIONZ X processor, enabling outstanding low-light performance with sensitivities up to ISO 12800 as well as continuous shooting at 16 fps and support for Eye AF in select modes. The fast sensor readout also improves rolling shutter and speeds of up to 1/32000 second. Benefitting this imaging system is a ZEISS Tessar T* 24mm equivalent f/4 lens that ensures minimal distortion, excellent sharpness, and a minimum focus distance of just 7.9\".All this technology makes the RX0 II a stellar video camera, too, as it offers internal UHD 4K30 video along with Picture Profiles, including the advanced S-Log2 gamma. Users looking for the best can still output an uncompressed and clean 4:2:2 4K image over HDMI as well as benefit from the camera's 3.5mm microphone input for improved audio capture. The RX0 II has electronic image stabilization for steady handheld footage. Full HD video at up to 120 fps is available as well, though a High Frame Rate or HFR Mode will enable super slow-motion capture at up to 960 fps in NTSC or 1000 fps in PAL. Additionally, interval recording is possible for creating time-lapse movies.Taking things a step further are the RX0 II's advanced connectivity options. Built-in Wi-Fi and Bluetooth allow for remote control and image transfer to a mobile device via the Imaging Edge Mobile app. This setup can operate multiple RX0 II cameras at once. The camera also benefits from other optional accessories that allow the RX0 II to be integrated into advanced configurations with up to 100 cameras.","images":{"0":"17402b5fb672725f05575aa4136dd23b-0.jpg","1":"17402b5fb672725f05575aa4136dd23b-1.jpg","2":"17402b5fb672725f05575aa4136dd23b-2.jpg","3":"17402b5fb672725f05575aa4136dd23b-3.jpg","4":"17402b5fb672725f05575aa4136dd23b-4.jpg","5":"17402b5fb672725f05575aa4136dd23b-5.jpg","6":"17402b5fb672725f05575aa4136dd23b-6.jpg","7":"17402b5fb672725f05575aa4136dd23b-7.jpg","8":"17402b5fb672725f05575aa4136dd23b-8.jpg","9":"17402b5fb672725f05575aa4136dd23b-9.jpg","10":"17402b5fb672725f05575aa4136dd23b-10.jpg","11":"17402b5fb672725f05575aa4136dd23b-11.jpg","12":"17402b5fb672725f05575aa4136dd23b-12.jpg","13":"17402b5fb672725f05575aa4136dd23b-13.jpg","14":"17402b5fb672725f05575aa4136dd23b-14.jpg","15":"17402b5fb672725f05575aa4136dd23b-15.jpg","16":"17402b5fb672725f05575aa4136dd23b-16.jpg","17":"17402b5fb672725f05575aa4136dd23b-17.jpg","18":"17402b5fb672725f05575aa4136dd23b-18.jpg","19":"17402b5fb672725f05575aa4136dd23b-19.jpg","20":"17402b5fb672725f05575aa4136dd23b-20.jpg","21":"17402b5fb672725f05575aa4136dd23b-21.jpg","22":"17402b5fb672725f05575aa4136dd23b-22.jpg","23":"17402b5fb672725f05575aa4136dd23b-23.jpg","24":"17402b5fb672725f05575aa4136dd23b-24.jpg","25":"17402b5fb672725f05575aa4136dd23b-25.jpg","26":"17402b5fb672725f05575aa4136dd23b-26.jpg","27":"17402b5fb672725f05575aa4136dd23b-27.jpg"}},"configuration":{},"availability":{"1469682":{"aditional_price":0,"availabile":837}}}
