{"viewData":{"url_key":"canon_3453c002_eos_rebel_sl3_dslr","name":"Canon EOS Rebel SL3 DSLR Camera with 18-55mm Lens (Black)","sku":"1473087","price":"649.00","categories":{"0":{"categoryName":"Digital Cameras","urlKey":"digital-cameras"}},"short_description":"Canon EOS Rebel SL3 DSLR Camera with 18-55mm Lens Kit (SL3 EOS Rebel Camera Kit - Black).  ","long_description":"Defined by its notably sleek form factor, the black Canon EOS Rebel SL3 is a versatile DSLR offering an ideal mix of stills and video capabilities. Featuring a 24.1MP APS-C-format CMOS sensor and DIGIC 8 image processor, high-resolution stills and UHD 4K video recording are possible, along with a wide ISO 100-25600 sensitivity range to suit working in a variety of lighting conditions. In-camera 4K time-lapse movie creation is also possible for creatively depicting subjects over time. Benefitting the imaging attributes, the sensor's design also facilitates Dual Pixel CMOS AF, which uses phase-detection autofocus for quick, accurate, and smooth focusing performance when recording movies or shooting stills in live view. When shooting stills using the optical viewfinder, a 9-point phase-detection system is used for quick and accurate focusing in a variety of shooting scenarios. Within the compact body design, a large 3.0\" 1.04m-dot touchscreen LCD is featured for intuitive settings control and live view monitoring, and it uses a vari-angle design to permit easier viewing from high and low working angles. Additionally, built-in Wi-Fi is available for quick and convenient pairing with a smartphone or tablet for wireless image sharing, and Bluetooth is also featured for image sharing to and remote camera control from a mobile device.","images":{"0":"42fcf0af5cb7f7637ec2314841c6f0de-0.jpg","1":"42fcf0af5cb7f7637ec2314841c6f0de-1.jpg","2":"42fcf0af5cb7f7637ec2314841c6f0de-2.jpg","3":"42fcf0af5cb7f7637ec2314841c6f0de-3.jpg","4":"42fcf0af5cb7f7637ec2314841c6f0de-4.jpg","5":"42fcf0af5cb7f7637ec2314841c6f0de-5.jpg","6":"42fcf0af5cb7f7637ec2314841c6f0de-6.jpg","7":"42fcf0af5cb7f7637ec2314841c6f0de-7.jpg","8":"42fcf0af5cb7f7637ec2314841c6f0de-8.jpg","9":"42fcf0af5cb7f7637ec2314841c6f0de-9.jpg","10":"42fcf0af5cb7f7637ec2314841c6f0de-10.jpg","11":"42fcf0af5cb7f7637ec2314841c6f0de-11.jpg"}},"configuration":{},"availability":{"1473087":{"aditional_price":0,"availabile":724}}}
